[
  {
    "text": "Leidos Inc., Reston, Virginia, is being awarded a $105,545,414 single-award, cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract for the provision of operational readiness research support services to include investigative studies that involve planning, coordinating, designing, and executing experimental protocols in support of the Naval Health Research Center. The contract will include a 60-month ordering period with no options. Work will begin in September 2025 and is expected to be completed by September 2030. Work will be performed in San Diego, California (80%), and Reston, Virginia (20%). Fiscal 2025 research, development, test and evaluation (Navy) funds in the contract's minimum amount of $1,000 will be obligated at time of award and will not expire at the end of the current fiscal year. Subsequent task orders under the resultant contract will be funded with appropriate fiscal research, development, test and evaluation funds (Navy). The requirement was competitively procured through the system for award management (SAM.gov) as unrestricted, competitive procurement with two offers received. Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department, Philadelphia, Pennsylvania, is the contracting activity (N00189-25-DZ021).",
    "contract_date": "2025-08-07"
  },
  {
    "text": "L3 Harris Technologies Inc., Melbourne, Florida, has been awarded a $53,843,771 fixed- price-incentive-fee modification (P00026) to a previously awarded contract (FA8819-22-C- 0001) for the procurement of an additional three production units for Foreign Military Sales (FMS) and procure an alternate 4.6-meter antenna. The modification brings the total cumulative face value of the contract to $235,938,547 from $182,094,876. Work will be performed at Palm Bay, Florida, and is expected to be completed by December 2028. This contract involves FMS. FMS funds in the amount $10,545,213 are being obligated at time of award. The Space Combat Power Directorate, Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity.",
    "contract_date": "2025-08-07"
  },
  {
    "text": "CACI NSS LLC, Reston, Virginia, was awarded a $43,202,330 firm-fixed-price, cost-plus-fixed fee, and cost-reimbursable no fee, indefinite-delivery/indefinite-quantity contract for the sustainment and modernization of the Integrated Broadcast Services Network Services (IBS-NS) system. This contract provides for the sustainment of the IBS-NS fielded systems as well as procurement, development, and modification of this system. Work will be performed at multiple locations inside and outside of the contiguous U.S., and is expected to be complete by August 19, 2028. This contract involves Foreign Military Sales to the United Kingdom and Canada. This contract was a sole source acquisition. Fiscal 2025 operations and maintenance funds in the amount of $1,643,185 are being obligated at the time of award. The Air Force Life Cycle Management Center, Robins Air Force Base, Georgia, is the contracting activity (FA8555-25-D-B001).",
    "contract_date": "2025-08-07"
  },
  {
    "text": "Puerto Rico Industries for the Blind Corp.,** Mayaguez, Puerto Rico, has been awarded a maximum $28,981,411 fixed-price, indefinite-delivery/indefinite-quantity contract for green service uniform coats and trousers. This is a two-year contract with no option periods. The ordering period end date is Aug. 6, 2027. Using military service is Army. Type of appropriation is fiscal 2025 through 2028 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-N014).",
    "contract_date": "2025-08-07"
  },
  {
    "text": "UPDATE: Best Medical Wear Ltd.,* Brooklyn, New York (SPE2DE-25-D-0016, $10,000,000), has been added as an awardee to the multiple award contract for medical and surgical supplies and equipment for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DE-22-R-0017 and awarded Sept. 28, 2023. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-08-07"
  },
  {
    "text": "Akima Facilities Operations LLC, Herndon, Virginia, was awarded a $23,034,485 modification (P00129) to contract W52P1J-20-F-0137 for maintenance, transportation, and supply services. The modification brings the total cumulative face value of the contract to $23,034,485. Work will be performed in Fort Hood, Texas, with an estimated completion date of July 9, 2026. Fiscal 2025 operation and maintenance, Army funds in the amount of $2,866,921 were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity.",
    "contract_date": "2025-08-07"
  },
  {
    "text": "Applied Research Associates Inc., Albuquerque, New Mexico, was awarded a $19,499,697 modification (P00017) to contract W911QX-23-C-0010 for end-to-end support for development, implementation, and extension of evolving National System for Geospatial architecture. The modification brings the total cumulative face value of the contract to $143,498,644. Work will be performed in Albuquerque, New Mexico, with an estimated completion date of June 1, 2027. Fiscal 2025 defense operation and maintenance funds in the amount of $6,244,432 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.",
    "contract_date": "2025-08-07"
  },
  {
    "text": "*Small business** Mandatory source",
    "contract_date": "2025-08-07"
  }
]