[
  {
    "text": "BL Harbert International LLC,** Birmingham, Alabama (N62742-25-D-1339); Black Construction– Tutor Perini JV,** Harmon, Guam (N62742-25-D-1340); Conti Federal Services, LLC,** Orlando, Florida (N62742-25-D-1341); Core Tech-HDCC-Kajima LLC,** Tamuning, Guam (N62742-25-D-1342); ECC Expeditionary Constructors LLC,** Burlingame, California (N62742-25-D-1343); Gilbane Federal JV,** Providence, Rhode Island (N62742-25-D-1344); Granite-Obayashi 3, A JV,** Watsonville, California (N62742-25-D-1345); Hensel Phelps Construction Co.,** Honolulu, Hawaii (N62742-25-D-1346); Nan Inc.,** Honolulu, Hawaii (N62742-25-D-1347); and SLSCO Ltd.,** Galveston, Texas (N62742-25-D-1348), are awarded a combined $15,000,000,000 indefinite-delivery/indefinite-quantity, multiple award contract for construction projects primarily located in Guam; and other areas under the cognizance of Naval Facilities Engineering Systems Command Pacific area of responsibility. SLSCO Ltd. is awarded a $41,825,700 firm-fixed-price task order for the construction of a low-rise school age center facility. Work will be performed in Andersen Air Force Base, Guam, and is expected to be completed by August 2028. Fiscal 2025 military construction (Navy) funds in the amount of $41,825,700 will be obligated on this award which will not expire at the end of the current fiscal year. All other awardees are awarded a $25,000 minimum contract guarantee. Fiscal 2025 military construction (Navy) funds in the amount of $225,000 will be obligated to all other awardees at time of award and will not expire at the end of the current fiscal year. All other funding will be made available at the task order level as contracting actions occur. The term of the contract is not to exceed 96 months with an expected completion date of September 2033. This acquisition was competitively procured via the SAM.gov website with 13 proposals received. These 10 contractors may compete for task orders under the terms and conditions of the awarded contracts. Naval Facilities Engineering Systems Command Pacific, Hawaii, is the contracting activity.",
    "contract_date": "2025-09-10"
  },
  {
    "text": "CBRE/JJ UK JV LLC, Franklin, Tennessee (N40084-25-D-0084); DGC JV, Montrose, Colorado (N40084-25-D-0085); ECC Diego Garcia LLC, Burlingame, California (N40084-25-D-0086); MVL Diego Garcia JV LLC, Lansing, Michigan (N40084-25-D-0087); and Black Construction/MACE International JV, Harmon, Guam (N40084-25-D-0088), are awarded a combined $1,500,000,000 indefinite-delivery/indefinite-quantity contract for new construction, renovation and modernization, and routine repair and maintenance projects at Navy Support Facility, Diego Garcia, British Indian Ocean Territory (B.I.O.T.). Black Construction/MACE International JV will be awarded $6,077,681 for the seed project. All remaining awardees will be awarded $100,000 each for the minimum contract guarantee at contract award. The maximum combined dollar value, including the base period of five years, and one option period of three years, for all five contracts is $1,500,000,000. Work will be performed at U.S. Navy Support Facility, Diego Garcia, B.I.O.T., and is expected to be completed by September 2033. Future task orders will be primarily funded by operation and maintenance O&M) (Navy); and Navy working capital contract funds. Fiscal 2025 O&M (Navy) funding in the amount of $6,477,681 will be obligated at time of award and will expire at the end of the current fiscal year. This contract was competitively procured via the SAM.gov website with five offers received. NAVFAC Far East, Commander Fleet Activities Yokosuka, Japan, is the contracting activity.",
    "contract_date": "2025-09-10"
  },
  {
    "text": "CDW Government LLC, Vernon Hills, Illinois (W519TC-25-D-A012); CTG Federal LLC,* Reston, Virginia (W519TC-25-D-A013); Wildflower International LTD,* Santa Fe, New Mexico (W519TC-25-D-A014); New Tech Solutions,* Fremont, California (W519TC-25-D-A015); Braxton-Grant Technologies,* Hanover, Maryland (W519TC-25-D-A016); Trace3 Government LLC,* Colorado Springs, Colorado (W519TC-25-D-A017); World Wide Technology LLC, St. Louis, Missouri (W519TC-25-D-A018); Lyme Computer Systems Inc.,* Lebanon, New Hampshire (W519TC-25-D-A019); BEAMITNTS Corp,* Walnut Creek, California (W519TC-25-D-A021); IMPRES Technology Solutions Inc.,* Round Rock, Texas (W519TC-25-D-A023); GovConnection Inc., Rockville, Maryland (W519TC-25-D-A024); MicroTechnologies LLC,* Delray Beach, Florida (W519TC-25-D-A025); Koi Computers,* Downers Grove, Illinois (W519TC-25-D-A026); Anacapa Micro Products Inc.,* Oxnard, California (W519TC-25-D-A027); VAE Inc.,* Springfield, Virginia (W519TC-25-D-A029); Blue Tech Inc.,* San Diego, California (W519TC-25-D-A030); Transource Service Corp,* Phoenix, Arizona (W519TC-25-D-A031); CACI idt LLC, Ashburn, Virginia (W519TC-25-D-A033); Affigent LLC,* Herndon, Virginia (W519TC-25-D-A034); American Wordata Inc. (AWData),* Tampa, Florida (W519TC-25-D-A035); GovTec Ventures LLC,* Annapolis, Maryland (W519TC-25-D-A036); CounterTrade Products Inc.,* Arvada, Colorado (W519TC-25-D-A037); Dell Federal Systems LP, Round Rock, Texas (W519TC-25-D-A038); Presidio Government Solutions LLC, Reston, Virginia (W519TC-25-D-A039); Strategic Communications LLC,* Louisville, Kentucky (W519TC-25-D-A040); Dynamic Systems Inc.,* El Segundo, California (W519TC-25-D-A041); iT1 Source LLC,* Tempe, Arizona (W519TC-25-D-A042); Insight Public Sector Inc., Chandler, Arizona (W519TC-25-D-A043); GovSmart Inc.,* Charlottesville, Virginia (W519TC-25-D-A044); Better Direct LLC,* Tempe, Arizona (W519TC-25-D-A045); Integrated Technologies Group Inc.,* Falls Church, Virginia (W519TC-25-D-A046); FedData Technology Solutions LLC,* Annapolis Junction, Maryland (W519TC-25-D-A047); Epoch Concepts LLC,* Littleton, Colorado (W519TC-25-D-A048); Software Information Resource Corp.,* Washington, D.C. (W519TC-25-D-A049); Paragon Micro Inc.,* Buffalo Grove, Illinois (W519TC-25-D-A050); FCN Inc.,* Rockville, Maryland (W519TC-25-D-A051); Atlantic Diving Supply Inc.,* Virginia Beach, Virginia (W519TC-25-D-A052); iGov Technologies Inc.,* Reston, Virginia (W519TC-25-D-A053); Blazar Technology Solutions LLC,* Gardnerville, Nevada (W519TC-25-D-A054); Iron Bow Technologies LLC, Herndon, Virginia (W519TC-25-D-A055); Red River Technology LLC, Chantilly, Virginia (W519TC-25-D-A056); Sterling Computers Corp.,* North Sioux City, South Dakota (W519TC-25-D-A057); ACE Computers (JC Technology),* Des Plaines, Illinois (W519TC-25-D-A058); Optivor Technologies LLC,* Orlando, Florida (W519TC-25-D-A059); Copper River Technologies LLC,* Anchorage, Alaska (W519TC-25-D-A062); Swish Data Corp.,* McLean, Virginia (W519TC-25-D-A064); NCS Technologies Inc.,* Manassas, Virginia (W519TC-25-D-A066); Norseman Defense Services Inc.,* Elkridge, Maryland (W519TC-25-D-A067); and ThunderCat Technology LLC,* Reston, Virginia (W519TC-25-D-A070), will compete for each order of the $10,000,000,000 firm-fixed-price contract for Information Technology Enterprise Solutions-4 Hardware (ITES-4H). Work locations and funding will be determined with each order, with an estimated completion date of Sept. 18, 2035. Army Contracting Command, Rock Island, Illinois, is the contracting activity.",
    "contract_date": "2025-09-10"
  },
  {
    "text": "RSE Inc.,* New Baltimore, Michigan, was awarded a $36,014,711 firm-fixed-price contract for high-efficiency gas adsorbers. Bids were solicited via the web with one received. Work locations and funding will be determined with each order, with an estimated completion date of March 9, 2031. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W91ZLK-25-D-0006).",
    "contract_date": "2025-09-10"
  },
  {
    "text": "Amazon Web Services Inc., Seattle, Washington, was awarded a $16,604,329 modification (P00015) to contract W519TC-24-F-A004 for cloud computing and storage. Work will be performed in Seattle, Washington, with an estimated completion date of Nov. 21, 2025. Fiscal 2025 operation and maintenance, Army funds in the amount of $16,604,329 were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity.",
    "contract_date": "2025-09-10"
  },
  {
    "text": "Great Lakes Dock and Materials LLC,* Muskegon, Michigan, was awarded a $9,257,575 firm-fixed-price contract for marine construction. Bids were solicited via the web with three received. Work will be performed in Grand Haven, Michigan, with an estimated completion date of Oct. 30, 2027. Fiscal 2022 civil construction funds in the amount of $9,257,575 were obligated at the time of the award. U.S. Army Corps of Engineers, Detroit District, is the contracting activity (W911XK-25-C-A034).",
    "contract_date": "2025-09-10"
  },
  {
    "text": "UES Inc., Dayton, Ohio, has been awarded a $499,999,999 indefinite-delivery/indefinite-quantity and two cost-plus-fixed-fee task orders valued at $148,419,093 and $98,677,956, for research within the High-Performance Electromagnetic Spectrum Survivable Materials Advancement program. This contract provides for research on the effects of, and interactions produced by, electromagnetic spectrum sources on materials, components, and systems in configurations of interest to the Department of the Air Force and the Department of War in both air and space domains. Work will be performed at Dayton, Ohio, and is expected to be completed by Sept. 1, 2033. This contract was a competitive acquisition, and two offers were received. Fiscal 2025 research, development, test and evaluation funds in the amount of $1,420,000 are being obligated at the time of award. The Air Force Research Laboratory, Wright-Patterson Air Force Base, Dayton, Ohio, is the contracting activity (FA2394-25-D-B001; FA2394-25-F-B010; FA2394-25-F-B011).",
    "contract_date": "2025-09-10"
  },
  {
    "text": "The Boeing Co., Long Beach, California has been awarded a $282,477,510 modification (P00024) to previously awarded (FA8526-21-D-0001) for C-17 Globemaster III sustainment for Ordering Period Five landing gear spares. The modification brings the total cumulative face value of the contract from $7,597,672,417 to $7,880,149,927. Work will be performed at various locations including but not limited to Long Beach, California; San Antonio, Texas; Robins Air Force Base, Georgia; Charleston, South Carolina; McCord Air Force Base, Washington; and various locations around the globe, and is expected to be completed by Oct. 31, 2027. This contract involves Foreign Military Sales (FMS) to Australia, Canada, India, Kuwait, the NATO Airlift Management Program, Qatar, the United Arab Emirates, and the United Kingdom. Fiscal 2025 operations and maintenance funds in the amount of $228,036,388; and FMS funds in the amount of $54,441,122, are being obligated at the time of award. The Air Force Lifecycle Management Center, Robins Air Force Base, Georgia, is the contracting activity.",
    "contract_date": "2025-09-10"
  },
  {
    "text": "AR6 Construction & Engineering, New Braunfels, Texas (FA3020-25-D-0005); G.M. Hill Engineering Inc., Jacksonville, Florida (FA3020-25-D-0006); GUY-JDA JV, Tulsa, Oklahoma (FA3020-25-D-0007); and MDLE LLC, Charlottesville, Virginia (FA3020-25-D-0008), were awarded an indefinite-delivery/indefinite-quantity contract with a ceiling amount of $9,900,000. This contract provides for a contracting vehicle for Sheppard Air Force Base, Texas, to expedite architectural-engineering services. Work will be performed at Sheppard AFB, Texas; Sheppard Annex, Lake Texoma, Texas; and Frederick Airfield, Oklahoma, and is expected to be completed by Sept. 9, 2030. These contracts were competitive acquisitions and six offers were received. Fiscal 2025 operations and maintenance funds in the amount of $233,371 are being obligated at time of award. The 82nd Contracting Squadron, Sheppard AFB, Texas, is the contracting activity.",
    "contract_date": "2025-09-10"
  },
  {
    "text": "Parsons Government Services Inc., Centreville, Virginia, has been awarded a $30,989,406 modification (P00023) to cost-plus-fixed-fee contract HR001122C0027 for additional work within scope of the Blackjack program. The modification brings the total cumulative face value of the contract to $49,368,687 from $18,379,281. Work will be performed in Colorado Springs, Colorado (83%); Centennial, Colorado (8%); Los Gatos, California (7%); Florham Park, New Jersey (1%); Littleton, Colorado; Lafayette, Colorado; and Denver, Colorado (totaling 1%), with an expected completion date of October 2028. Fiscal 2025 research and development funds in the amount of $2,538,000 are being obligated at the time of award. The Defense Advanced Research Projects Agency, Arlington, Virginia, is the contracting activity.",
    "contract_date": "2025-09-10"
  },
  {
    "text": "Leisnoi Professionals Services LLC, Anchorage, Alaska, has been awarded a $12,377,632 firm-fixed-price contract (HQ003425CE092). The amount of this action is. Fiscal 2025 operations and maintenance funds in the amount of $8,728,231 are being obligated at the time of the award.  The purpose of this contract is to provide services support to the Office of the Chief Digital and Artificial Intelligence Office (OCDAO) as it provides accelerated adoption of data, analytics, and AI to generate decision advantage. The contractor will provide a range of support services to enable OCDAO to accelerate the delivery of data analytics and AI-enabled capabilities, scale for department-wide impact of data analytics and AI to synchronize Department of War data analysis and AI activities to expand Joint-Force advantages. The work will be performed at the Pentagon, Arlington, Virginia. The estimated contract completion date is June 10, 2026. Washington Headquarters Services, Arlington, Virginia, is the contracting activity.",
    "contract_date": "2025-09-10"
  },
  {
    "text": "Honeywell International, Oro Valley, Arizona, has been awarded a maximum of $9,104,071 firm-fixed-price contract for F-16 transmitters. This was a competitive acquisition with one response received. The performance completion date is July 12, 2027. Using military service is Air Force. Type of appropriation is fiscal 2025, defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation Hill Air Force Base, Utah (SPRHA4‐25-F-0020).",
    "contract_date": "2025-09-10"
  },
  {
    "text": "*Small business**Large business",
    "contract_date": "2025-09-10"
  }
]