[
  {
    "text": "World Wide Technology LLC, St. Louis, Missouri, was awarded a $99,999,999 indefinite-delivery/indefinite-quantity, firm-fixed-price contract for IT Transformation with AF CyberWorx. This contract provides for a streamlined and flexible approach to evaluating current mission system shortfalls and rapidly developing and fielding modernization and interconnection solutions to shorten sensor-to-shooter analysis and decision time and transform command and control capabilities. Work will be performed throughout the continental U.S. and outside the continental U.S., and is expected to be completed by Aug. 26, 2030. This contract was a competitive acquisition, and two offers were received. Fiscal 2025 Space Force procurement funds in the amount of $1,747,572 are being obligated at time of award. The 10th Contracting Squadron, U.S. Air Force Academy, Colorado, is the contracting activity (FA7000-25-D-0010).",
    "contract_date": "2025-08-26"
  },
  {
    "text": "J&J Mechanical and Construction Group LLC, Jersey City, New Jersey (FA4484-25-D-0027); Kaser Mechanical LLC, Burlington, New Jersey (FA4484-25-D-0028); and M.E.R.I.T Inc., Newark, New Jersey (FA4484-25-D-0029), were awarded a ceiling $71,500,000 firm-fixed-price, indefinite-delivery/indefinite-quantity, multiple award contract for mechanical services. This contract provides for labor, materials, equipment, supervision necessary to inspect, test, troubleshoot, construct, install, maintain, repair and replace heating, ventilation, air conditioning, refrigeration equipment, systems, sub systems, hydraulic systems, pumps, motors, piping systems, pipe insulation, fuel systems, miscellaneous plumbing and fixtures. Work will be performed at Joint Base McGuire-Dix-Lakehurst, New Jersey, and is expected to be completed by Aug. 25, 2031. These contracts were competitive acquisitions, and ten offers were received. No funds are being obligated at the time of award. The 87th Contracting Squadron, Joint Base McGuire-Dix-Lakehurst, New Jersey, is the contracting activity.",
    "contract_date": "2025-08-26"
  },
  {
    "text": "Amentum Services Inc., Chantilly, Virginia, has been awarded a $7,891,644 modification (P00131) to a previously awarded contract (FA4610-22-C-0006) for the Aerospace Support Services Contract. Work will be performed at Vandenberg Space Force Base, California; Patrick SFB, Florida; and Cape Canaveral Space Force Station, Florida, and is expected to be completed by Sept. 30, 2026.  Fiscal 2026 operations and maintenance appropriation funds in the amount of $1,969,161 are being obligated at time of award.  The 30th Contracting Squadron, Vandenberg SFB, California, is the contracting activity.",
    "contract_date": "2025-08-26"
  },
  {
    "text": "Hexagon US Federal Inc., Huntsville, Alabama, is awarded an $87,473,958 firm-fixed-price, cost-plus-fixed-fee, and cost-only modification to a previously awarded contract (N00024-19-D-4114) for the procurement of Surface Ship Situational Awareness, Boundary Enforcement and Response computing hardware production, spare parts, and engineering support. Work will be performed in Huntsville, Alabama, and is expected to be completed by November 2028. No funding will be obligated at time of award. Funds will be obligated as individual orders are issued, as the minimum guarantee was met at time of initial award. The Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-26"
  },
  {
    "text": "Astraeus Operations LLC,* Springfield, Virginia, is awarded a $22,000,000 firm-fixed-price and cost-reimbursable, indefinite-delivery/indefinite-quantity contract to provide cyber operations systems engineering and technical assistance. Work will be performed in Laurel, Maryland, and is expected to be completed in August 2030. No funds will be obligated at time of award. Funds will be obligated on individual task orders as they are issued. This contract was not competitively procured pursuant to Federal Acquisition Regulation 6.302-5(b)(4). Marine Corps System Command, Quantico, Virginia, is the contracting activity (M67854-25-D-0185).",
    "contract_date": "2025-08-26"
  },
  {
    "text": "RDA Inc.,* Doylestown, Pennsylvania, is awarded a $9,999,904 modification (P00007) to a previously awarded cost-plus-fixed-fee order (N6833524F0025) against a previously issued basic ordering agreement (N6833520G3039). This effort is in support of Small Business Innovation Research Topics N98-035, N04-247, and N06-011 entitled \"Signal Processing and System Concepts to Exploit Passive Signals in Airborne Active ASW Missions\"; \"Littoral Environment Parameter Estimation from Bistatic and Multistatic Fleet Air Antisubmarine Warfare (ASW) Acoustic Reverberation Data,\" and \"Multi-Sensor Data Fusion for Littoral Undersea Warfare,\" respectively and will expedite the digitization of legacy and future sonobuoys through the development and delivery of prototype sonobuoys for initial development test. Work will be performed in DeLeon Springs, Florida (77%); and Doylestown, Pennsylvania (23%), and is expected to be completed in August 2029. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $500,000 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. Naval Air Warfare Center Aircraft Division Lakehurst, New Jersey, is the contracting activity.",
    "contract_date": "2025-08-26"
  },
  {
    "text": "Raytheon Co., Indianapolis, Indiana, is awarded a $9,163,682 modification (P00009) to a cost-plus-fixed-fee order (N0001924F2582) against a previously issued basic ordering agreement (N0001920G0007). This modification adds scope to implement software updates associated with the compatibility of the generation six radio in the V-22 for the Navy and Air Force. Work will be performed in Indianapolis, Indiana and is expected to be completed in May 2027. Fiscal 2024 aircraft procurement (Navy) funds in the amount of $5,522,435; and fiscal 2024 aircraft procurement (Air Force) funds in the amount of $3,641,247, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-26"
  },
  {
    "text": "Great Lakes Dredge & Dock Co. LLC, Houston, Texas, was awarded a firm-fixed-price contract (W912DS-25-C-A012) for maintenance dredging of East Rockaway Inlet, New York. The amount of this action is $13,971,960. Bids were solicited via the internet with three received. Work will be performed in Queens, New York, with an estimated completion date of Nov. 28, 2025. Fiscal 2025 civil construction, funds in the amount of $13,971,960 were obligated at the time of the award. U.S. Army Corps of Engineers, New York District, is the contracting activity.",
    "contract_date": "2025-08-26"
  },
  {
    "text": "UPDATE: Belleville Shoe Manufacturing Co.,* Belleville, Illinois (SPE1C1-25-D-0080, $24,625,378), has been added as an awardee to the multiple award contract for hot weather combat improved boots, issued against solicitation SPE1C1‐24‐R‐0090 and awarded June 26, 2025. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-08-26"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-26"
  }
]