[
  {
    "text": "Raytheon Co., Tucson, Arizona, has been awarded a $760,000,000 cost plus fixed-fee, firm-fixed-price, indefinite-delivery/indefinite-quantity contract in support of Advance Medium Range Air-to-Air Missiles (AMRAAM). This contract will allow for the mitigation of obsolescence in support of efforts that cover production, sustainment, and development of the AMRAAM. Work will be performed at Tucson, Arizona and is expected to be completed by Sept. 7, 2030. This contract involves Foreign Military Sales (FMS) to Canada, Taiwan, Sweden, Czech Republic, Korea, Kuwait, Japan, Finland, Germany, the United Kingdom, Portugal, Italy, Netherlands, Saudi Arabia, Norway, Belgium, Australia, Turkey, Spain, and Lithuania. Fiscal 2025 Air Force missile procurement funds in the amount of $1,058,951; fiscal 2025 Navy weapons procurement funds in the amount of $144,402; and FMS funds in the amount of $346,685, are being obligated at the time of award. This award is the result of a sole source acquisition; one solicitation was mailed, and one offer was received. The Weapons Superiority Contracting Branch, Robins Air Force Base, Georgia, is the contracting activity (FA8556-25-D-B001). (Awarded Sept. 8. 2025)",
    "contract_date": "2025-09-09"
  },
  {
    "text": "General Atomics Aeronautical Systems Inc., Poway, California, has been awarded a $14,100,000,000 ceiling value indefinite-delivery/indefinite-quantity contract for the International Remotely Piloted Aircraft IDIQ Solution (IRIS) to support the MQ-9 enterprise. This contract provides for the development, procurement, retrofit, sustainment, and any other activities related to the MQ-9 platform. The location of performance is Poway, California, and work is expected to be complete by Dec. 31, 2031. This contract involves Foreign Military Sales (FMS) to India, and potential future FMS customers. This award is the result of a sole source acquisition. FMS funds in the amount of $108,279,000 are being obligated on the first delivery order (FA8689-25-F-B010) at the time of award. Air Force Life Cycle Management Center, Wright Patterson Air Force Base, Ohio, is the contracting activity (FA8689-25-D-B001).",
    "contract_date": "2025-09-09"
  },
  {
    "text": "The Applied Research Laboratory, University of Texas at Austin (ARL:UT), Austin, Texas, was awarded a $390,000,000 cost-plus-fixed-fee modification to a previously awarded indefinite-delivery/indefinite-quantity contract (N00024-17-D-6421) increasing its ceiling to provide research, development, engineering, and test and evaluation for programs throughout the Department of Defense (DOD) within its approved core competency areas of: characteristics of the medium, high frequency sonar, acoustic and electromagnetic properties, signal and information processing and display, navigation and precise location, Command, Control, Communications, Computers, and Intelligence Information Warfare, and mission related and public service oriented research. Work will be performed in Austin, Texas, and is expected to be completed by September 2027. Funds of multiple different appropriation types and years from program offices and components throughout the DOD may be obligated on individual task orders for efforts that fall within the ARL:UT core competency areas. Naval Sea Systems Command, Washington Navy Yard, D.C., is the contracting activity.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "ISPA Technology LLC,* Lithia, Florida, is awarded a $74,274,672 indefinite-delivery/indefinite-quantity contract for the production and lifecycle support for the Tactical Shore, Afloat, and Expeditionary C4I Tactical Data Center (TDC) Command and Control (C2) as part of the Joint Expeditionary Command and Command Control Family of Systems (JEXC2 FoS). The TDC C2 capability is designed to align with the Navy's Application Arsenal goals to speed the delivery of new capabilities and software updates to the fleet. TDC architecture creates the ability for on-demand applications, continuous cyber compliance, and remote administration of deployed systems. Additionally, this requirement will assist JEXC2 systems with the transition to production and integration for usage at scale by Fleet users across the JEXC2 FoS. This contract includes option periods which, if exercised, would bring the cumulative value of this contract to $74,274,672. Work will be performed in Panama City, Florida, and is expected to be completed by August 2030. If all options are exercised, work will continue through August 2030. Fiscal 2025 other procurement (Navy) funds in the amount of $1,000,000 will be obligated at time of award of the first delivery order and will expire at the end of the current fiscal year. This contract was not competitively procured via the Sam.gov, in accordance with 10 U.S. Code 4022(f)(2)(A)(B) and Defense Federal Acquisition Regulation Supplement 206.001-70 Exception for prototype projects for follow-on production contracts. Naval Surface Warfare Center, Panama City Division, Panama City, Florida, is the contracting activity (N61331-25-D-0005).",
    "contract_date": "2025-09-09"
  },
  {
    "text": "Northrop Grumman Corp., Charlottesville, Virginia, is awarded a $25,729,881 cost-plus-incentive-fee, firm-fixed-price, cost-plus-fixed-fee, and cost modification to a delivery order under a previously awarded contract (N00024-20-D-5230) for the low-rate initial production and engineering of surface navigation processor module configurations and associated maintenance assistance module kits. Work will be performed in Charlottesville, Virginia (89%); Baltimore, Maryland (6%); Salt Lake City, Utah (1%); Annapolis, Maryland (1%); Sykesville, Maryland (1%); Rolling Meadows, Illinois (1%); and Woodland Hills, California (1%), and is expected to be completed by February 2028. Fiscal 2025 other procurement (Navy) funds in the amount of $6,302,168 (25%); fiscal 2024 shipbuilding and conversion (Navy) funds in the amount of $6,094,370 (24%); fiscal 2022 shipbuilding and conversion (Navy) funds in the amount of $5,705,421 (23%); fiscal 2023 shipbuilding and conversion (Navy) funds in the amount of $3,436,133 (14%); fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $3,047,185 (12%); and fiscal 2024 other procurement (Navy) funds in the amount of $388,948 (2%), will be obligated at the time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "Huntington Ingalls Inc., Pascagoula, Mississippi, was awarded a $14,158,049 cost-plus-incentive-fee modification to a previously awarded contract (N00024-23-C-2324) for the USS Zumwalt (DDG 1000) modernization period execution. Work will be performed in Pascagoula, Mississippi (95%); and other locations each less than 1% (totaling 5%), and is expected to be completed by May 2026. No additional funding will be obligated at the time of award. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "Integration Innovation Inc.,* Huntsville, Alabama, is being awarded a $7,718,644 cost-plus-fixed-fee contract for analysis, evaluation, and development of techniques and technologies for electronic attack and high-power microwave synergistic interactions in high-power electronic warfare scenarios. This contract includes options which, if exercised, would bring the cumulative value of this contract to $36,760,191. Work will be performed in Huntsville, Alabama, and is expected to be completed by September 2030. Fiscal 2024 research, development, test and evaluation funding in the amount of $15,000 will be obligated at time of award and will expire at the end of the current fiscal year. This contract was competitively procured with one offer received in response to the U.S. Naval Research Laboratory's Broad Agency Announcement, (N0017324SBA01). The U.S. Naval Research Laboratory, Washington, D.C., is the contracting activity (N0017325C2435).",
    "contract_date": "2025-09-09"
  },
  {
    "text": "MM Manufacturing LLC,*** Lajas, Puerto Rico (SPE1C1-25-D-0085, $153,697,392); and Aurora Industries LLC,**** Orocovis, Puerto Rico (SPE1C1-25-D-0086, $146,133,800), have each been awarded a fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract under solicitation SPE1C1-25-R-0003 for various types of combat uniform unisex coats and trousers. This was a competitive acquisition with 16 responses received. These are five-year contracts with no option periods. The ordering period end date is Sept 4, 2030. Using military services are Army and Air Force. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "American Apparel Inc.,* Selma, Alabama, has been awarded a maximum $21,917,087 modification (P00029) exercising the fourth one-year option period of a one-year base contract (SPE1C1-21-D-1481) with four one-year option periods for various types of coats. This is a firm-fixed-price, indefinite-delivery/indefinite-quantity contract. The ordering period end date is Sept. 28, 2026. Using military services are Army and Air Force. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "American Polymer LLC,** Vernon, California, has been awarded a maximum $7,536,615 modification (P00019) exercising the third one-year option period of a one-year base contract (SPE1C1-23-D-0001) with four one-year option periods for blouses and trousers. This is a firm-fixed-price, indefinite-delivery/indefinite-quantity contract. Location of performance is New Jersey, with a Sept.13, 2026, ordering period end date. Using military service is Marine Corps. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "CORRECTION: The contract announced on Aug. 28, 2025, for Sysco Central Alabama, Calera, Alabama (SPE300-25-D-3020), for $33,103,659 was announced with an incorrect award date. The correct award date is Sept. 4, 2025.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "UPDATE: Red One Medical Devices LLC,** doing business as Red One Medical, Savannah, Georgia (SPE2DE-25-D-0015, $450,000,000), has been added as an awardee to the multiple award contract for medical and surgical supplies for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DE-22-R0017 and awarded Sept. 28, 2023. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "Korte Construction Co., doing business as The Korte Co., St. Louis, Missouri, was awarded a $106,114,818 firm-fixed-price contract for the Disaster Resiliency Program Phase Two, Creech Air Force Base, Nevada. This one-phase design-build construction contract includes the design and construction of a 79,335-square-foot aircraft maintenance facility hangar, a 4,429-square-foot covered aerospace ground equipment storage yard, a 204-square-foot hazardous material storage area, and 100,167 square feet of airfield pavements to support the Disaster Resiliency Program mission sets. The amount of this action is $106,114,818. Bids were solicited via the web with one received. Work will be performed in Indian Springs, Nevada, with an estimated completion date of Oct. 10, 2027. Fiscal 2025 other procurement, Air Force funds in the amount of $106,114,818 were obligated at the time of the award. U.S. Army Corps of Engineers, Los Angeles District, is the contracting activity (W912PL-25-C-A011).",
    "contract_date": "2025-09-09"
  },
  {
    "text": "Cam Lock Ltd., Aldershot, United Kingdom, was awarded a $97,917,545 firm-fixed-price contract for the manufacturing and procurement of Hybrid Summer Flyers gloves to support the Uniform Integrated Protection Ensemble Family of Systems Gloves, Aviation Glove Program. This contract includes a five-year base period with two one-year options. The amount of this action is $97,917,545. Bids were solicited via the web with one received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 4, 2032. Army Contracting Command, Aberdeen Proving Ground, Natick Division, is the contracting activity (W911QY-25-D-A006).",
    "contract_date": "2025-09-09"
  },
  {
    "text": "Right Way Environmental,* Barranquitas, Puerto Rico, was awarded a $21,531,004 firm-fixed-price contract for construction support services at the La Chuleta Material Management Area in San Juan, Puerto Rico. Bids were solicited via the web with four received. Work will be performed in San Juan, Puerto Rico, with an estimated completion date of Sept. 8, 2030. Fiscal 2025 construction, Corps of Engineers, civil funds in the amount of $21,531,004 were obligated at the time of the award. U.S. Army Corps of Engineers, Caribbean District, is the contracting activity (W51DQV-25-C-A002).",
    "contract_date": "2025-09-09"
  },
  {
    "text": "L3 Communications Corp. Communication Systems West, Salt Lake City, Utah, was awarded a $9,841,809 modification (PX0013) to contract W58RGZ-11-C-0023 to settle a claim resulting from a termination for convenience. The original contract, awarded on Nov. 2, 2010, and completed on March 15, 2015, was for the Kiowa L2MUM B-Kit. The modification brings the total cumulative face value of the contract to $47,659,631. Work will be performed in Salt Lake City, Utah, with an estimated completion date of Sept. 30, 2025. Fiscal 2023 aircraft procurement, Army funds in the amount of $9,841,809 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-09-09"
  },
  {
    "text": "*Small business**Service-disabled veteran-owned small business***Women-owned small business in historically underutilized business zones****Small-disadvantaged business",
    "contract_date": "2025-09-09"
  }
]