[
  {
    "text": "RTX Corp., Arlington, Virginia, has been awarded a maximum $50,000,000,000 terms and conditions umbrella contract for RTX systems and end-item production, spare parts, services and other types of support. This umbrella is comprised of basic terms and conditions allowing for indefinite-delivery/indefinite-quantity and \"C\" type subsumable contracts for negotiated pricing. This contract was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a 20-year contract with no option periods. Locations of performance are inside and outside the continental U.S., with a July 31, 2045, performance completion date. Using customers are Army, Defense Logistics Agency and Defense Department. Using customers are solely responsible for funding the subsumable contracts and vary in appropriations type and fiscal year. The contracting activity is the Defense Logistics Agency Land and Maritime, Aberdeen Proving Ground, Maryland (SPRBL1-25-D-0006).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Valiant Technical Services Inc., Fayetteville, North Carolina, has been awarded an estimated $22,545,627 hybrid firm-fixed-price, fixed price with economic-price-adjustment, time-and-material contract for Chemical Management Services/Third Party Logistics services. This was a competitive acquisition with one response received. This is a one-year base contract with four one-year option periods. Location of performance is Georgia, with a July 31, 2026, performance completion date. Using military service is Air Force. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Distribution, New Cumberland, Pennsylvania (SP3300‐25-C-5002).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "The Source Group Inc., Signal Hill, California, has been awarded an estimated $26,513,566 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for environmental restoration, compliance and facility maintenance services at Defense Fuel Support Point, Norwalk, California. This was a competitive acquisition with one response received. This is a four-year base contract with one six-month option period. The ordering period end date is July 31, 2029. Using customer is Defense Logistics Agency. Type of appropriations is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Energy, Fort Belvoir, Virginia (SPE603-25-D-5003).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Peckham Inc.,** Lansing, Michigan, has been awarded a maximum $12,443,328 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for fleece undershirts. This is a five-year contract with no option periods. The ordering period end date is July 31, 2030. Using military service is Marine Corps. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-N008).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Tecmotiv (USA) Inc.,* Niagara Falls, New York, has been awarded a maximum $10,416,679 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for turbo superchargers. This is a five-year contract with no option periods. This was a competitive acquisition with three responses received. The performance completion date is Aug. 1, 2030. Using military service is Army. Type of appropriation is fiscal 2025 through 2030 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan (SPRDL1-25-D-0062).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Palantir USG Inc., Palo Alto, California, was awarded a firm-fixed-price contract transitioning existing contracts in which Palantir is currently a prime or subcontractor to this enterprise agreement. The amount of this action is $10,000,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2035. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity (W519TC-25-D-0039). (Awarded July 31, 2025)",
    "contract_date": "2025-08-01"
  },
  {
    "text": "The Boeing Co., Ridley Park, Pennsylvania, was awarded a cost-plus-fixed-fee contract for cargo engineering and logistics support services. The amount of this action is $883,122,870. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2030. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity (W58RGZ-25-D-0022).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "IMT Defense Corp.,* Champaign, Illinois, was awarded a $358,766,929 modification (P00009) to contract W15QKN-23-D-0009 for 155mm Artillery M795 Metal Part Assemblies. The modification brings the total cumulative face value of the contract to $749,781,969. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Nov. 21, 2027. Army Contracting Command, Newark, New Jersey, is the contracting activity.",
    "contract_date": "2025-08-01"
  },
  {
    "text": "BAE Systems Land & Armaments L.P., York, Pennsylvania, was awarded a $139,597,684 modification (P00033) to contract W56HZV-23-C-0024 for the procurement of Armored Multipurpose Vehicles. The modification brings the total cumulative face value of the contract to $2,286,486,021. Work will be performed in York, Pennsylvania, with an estimated completion date of May 31, 2028. Fiscal 2025 procurement of weapons and tracked combat vehicles, Army funds in the amount of $139,597,684 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Systems Products and Solutions Inc.,* Huntsville, Alabama, was awarded a firm-fixed-price contract for maintenance support device version four rugged and version four light systems. The amount of this action is $74,792,859 with a total cumulative face value of $74,792,859. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2030. Army Contracting Command, Newark, New Jersey, is the contracting activity (W15QKN-25-D-0020).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Outside the Box,* Richmond, Virginia, was awarded a firm-fixed-price contract for construction. The amount of this action is $18,885,132 with a total cumulative face value of $18,885,132. Bids were solicited via the internet with eight received. Work will be performed in Camp Mackall, North Carolina, with an estimated completion date of Sept. 20, 2027. Fiscal 2025 military construction, defense-wide funds in the amount of $18,885,132 were obligated at the time of the award. U.S. Army Corps of Engineers, Wilmington, North Carolina, is the contracting activity (W912PM-25-C-0033).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "CORRECTION: The $99,697,753 firm-fixed-price contract (W519TC-25-C-0037) announced on July 30, 2025, to Computable Insights LLC, Herndon, Virginia, for Salesforce software licenses, was actually awarded on July 31, 2025.",
    "contract_date": "2025-08-01"
  },
  {
    "text": "The MITRE Corp., Bedford, Massachusetts, has been awarded a ceiling $583,945,675 cost reimbursement continuation contract for support to the Air Force from MITRE as the administrator of the National Security Engineering Center Federally Funded Research and Development Center. This contract provides for the exercise of an option under the basic contract (FA8702-19-C-0001). This contract was a sole-source acquisition. Work will be performed at Bedford, Massachusetts; McLean, Virginia; other various locations throughout the continental U.S.; and outside the continental U.S., and is expected to be completed by Sept. 30, 2026. This contract involves Foreign Military Sales to various countries. Fiscal 2025 research and development funds in the amount of $103,511 are being obligated at the time of award. The Air Force Life Cycle Management Center, Hanscom Air Force Base, Massachusetts, is the contracting activity (FA8702-25-C-B001).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "SJ Technologies Inc., Sugar Hill, Georgia, was awarded a maximum $50,000,000 firm-fixed-price task order for software development services. This contract provides for consultation and planning, business solutions, life-cycle support services, and software engineering development services to support senior decision makers at Headquarters Air Force, including the Secretary of the Air Force, the Air Staff, and other Air Force organizations within the National Capital Region. Work will be performed at Joint Base Andrews, Maryland, and is expected to be complete by March 31, 2031 (includes a six-month extension). This contract was a competitive acquisition and 16 offers were received. Fiscal 2025 operations and maintenance appropriations in the amount of $8,797,214 are being obligated at the time of award. The Air Force District of Washington, Contracting, Joint Base Andrews, Maryland, is the contracting activity (FA7014-25-F-0232).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "The Lockheed Martin Corp., Sunnyvale, California, has been awarded a $29,414,652 modification (P00014) to a previously awarded contractor (FA8807-24-C-B001) to provide risk reduction and design activities for the Mobile User Objective System Service Life Extension (MUOS SLE) Phase I prior to entering MUOS SLE Phase II. The modification will bring the total cumulative face value of the contract to $95,414,413. Work will be performed at the contractor's facility and is expected to be completed by Aug. 1, 2026. Fiscal 2025 research, development, test and evaluation appropriation funding in the amount of $10,000,000 is being obligated at the time of modification award. The Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity.",
    "contract_date": "2025-08-01"
  },
  {
    "text": "The Boeing Co., El Segundo, California, has been awarded a $29,368,714 modification (P00016) to a previously awarded contract (FA8807-24-C-B002) to provide risk reduction and design activities for the Mobile User Objective System Service Life Extension (MUOS SLE) Phase I prior to entering MUOS SLE Phase II. The modification will bring the total cumulative face value of the contract to $95,309,979. Work will be performed at the contractor's facility and is expected to be completed by Aug. 1, 2026. Fiscal 2025 research, development, test and evaluation appropriation funding in the amount of $10,000,000 is being obligated at the time of modification award. The Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity.",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Benaka Inc., New Brunswick, New Jersey, was awarded a $23,881,532 firm-fixed-price contract for repairing and renovating Langley Dorm Facility 130. This contract provides for repairs of exterior closure and roof, windows and doors, damage to concrete masonry unit block walls and drywall, degradation of structural members, extensive repair of walkway overhangs and railings, sidewalks, exterior lighting, repair and replacement of plumbing, electrical, communications, fire alarm and suppression, and heating, ventilation, and air-conditioning systems, and replacement of all interior finishes and construction of a new 520 square feet utility building. Work will be performed on Langley Air Force Base, Virginia, and is expected to be completed June 10, 2027. This contract was a competitive acquisition and four offers were received. Fiscal 2025 operations and maintenance funds in the amount of $23,881,532 are being obligated at the time of award. The 633rd Contracting Squadron, Joint Base Langley-Eustis, Virginia, is the contracting activity (FA4800-25-C-0010).",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Raytheon Technologies Corp., doing business as Pratt and Whitney Military Engines, East Hartford, Connecticut, is awarded a $115,075,000 contract modification (P00007) to the previously awarded firm-fixed-price, cost-plus-incentive-fee and fixed-price incentive Lot 19 contract (N0001923C0030). This modification adds scope to procure long-lead time materials for the future production and delivery of F135 propulsion systems for the F-35 in support of the Joint Strike Fighter program for the Air Force, Marine Corps, Navy, F-35 Cooperative Program Partners, and Foreign Military Sales (FMS) customers. Work will be performed in East Hartford, Connecticut (20%); Indianapolis, Indiana (15%); Minneapolis, Minnesota (11%); Rocky Mountain, North Carolina (9%); Cleveland, Ohio (6%); Hartford, Connecticut (2%); Laconia, New Hampshire (2%); Detroit, Michigan (2%); Joplin, Missouri (2%); Redmond, Oregon (2%); Phoenix, Arizona (1%); various locations within the continental U.S. (1%); and various locations outside the continental U.S (27%), and is expected to be completed in February 2028. Fiscal 2024 aircraft procurement (Navy) funding in the amount of $1,800,000; fiscal 2024 aircraft procurement (Marine Corps) funding in the amount of $29,725,000; fiscal 2024 aircraft procurement (Marine Corps) funding in the amount of $8,400,000; FMS funds in the amount of $44,150,000; and non-U.S. Department of Defense participant funds in the amount of $31,000,000, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. The Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-01"
  },
  {
    "text": "TOTE Services LLC, Jacksonville, Florida, is being awarded a $49,880,134 firm-fixed-price contract (N3220525C4084) inclusive of pass-through items for the operation and maintenance of Operation Petroleum Discharge System (OPDS) vessels. OPDS will continue supporting Military Sealift Command's pre-positioning requirements on a worldwide basis. This contract includes one 12-month base period, one 12-month option period, and one three-month option period. The contract will be performed on a worldwide basis beginning Aug. 1, 2025, and will conclude on Oct. 31, 2027, if all options are exercised. This contract will be non-competitively awarded under the authority of 10 U.S. Code 3204(a)(2), as implemented by Federal Acquisition Regulation 6.302-1(a)(2), Only One Responsible Source No Other Supplies or Services Will Satisfy Agency Requirements, as captured on the Government Point of Entry website. Military Sealift Command, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-08-01"
  },
  {
    "text": "Maritime Institute of Technology and Graduate Studies, Linthicum Heights, Maryland, is awarded a $43,000,000 indefinite-delivery/indefinite-quantity, firm-fixed-price contract (N3220525D4204) to provide a comprehensive Unlicensed Mariner to Licensed Mariner Training Program. The contract will be performed in Linthicum Heights, Maryland, with an ordering period beginning on Aug. 1, 2025, and concluding on July 31, 2035, if all options are exercised. The contract will have a five-year ordering period and an option to extend the ordering period for an additional five years. The solicitation utilized full and open competition with proposals solicited via the Government Point of Entry website and one proposal was received in response to the solicitation. Military Sealift Command, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-08-01"
  },
  {
    "text": "*Small business**Mandatory source",
    "contract_date": "2025-08-01"
  }
]