[
  {
    "text": "Triquetra III JV, San Diego, California, is awarded a $240,000,000 cost-plus-award-fee, indefinite-delivery/indefinite-quantity contract for architect-engineer services. This contract provides for environmental support services for Comprehensive Long-Term Environmental Action requirements to include environmental technical and engineering services in support of the Navy's Environmental Restoration Program. Work will be performed at Navy and Marine Corps installations within the Naval Facilities Engineering Systems Command (NAVFAC) Pacific region, including NAVFAC Southwest (80%); NAVFAC Northwest (5%); NAVFAC Hawaii (12%); and NAVFAC Marianas (3%). Fiscal 2025 environmental restoration (Navy) funding in the amount of $5,000 will be obligated for the minimum contract guarantee; funds will be obligated on individual task orders as they are issued. This contract was competitively procured via sam.gov website, with three proposals received. NAVFAC Southwest, San Diego, California, is the contracting activity (N6247325D3220).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "SLSCO Ltd., Galveston, Texas, was awarded a $220,173,280 modification to a firm-fixed-price contract (N62742-25-C-1308) for the construction of a maintenance support facility building, armory building, an aircraft maintenance hangar, telecommunications facility, and required site improvements at the Royal Australian Air Force Base, Darwin, Australia. The total cumulative face value of the contract is $459,825,472. Work will be performed in Darwin, Australia, and is expected to be completed by May 2028. Fiscal 2025 military construction (Marine Corps) funds in the amount of $147,000,000 are obligated at time of award and will not expire at the end of the current fiscal year. Naval Facilities Engineering Systems Command Pacific, Joint Base Pearl Harbor-Hickam, Hawaii, is the contracting activity (N62742-25-C-1308).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Nan Inc., Honolulu, Hawaii is awarded a $211,436,801 firm-fixed-price contract for construction of a communications center at Joint Region Marianas, Guam. Work will be performed at Andersen Air Force Base, Guam, and is expected to be completed by March 2030. The project is incrementally funded. Fiscal 2024 military construction (Navy) funds in the amount of $91,295,000 will be obligated at time of award and will not expire at the end of the current fiscal year. This contract was competitively procured via the sam.gov website, with four proposals received. The Naval Facilities Engineering Systems Command Pacific, Joint Base Pearl Harbor-Hickam, Hawaii, is the contracting activity (N62742-25-C-1302).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Huntington Ingalls Inc. Newport News Shipbuilding, Newport News, Virginia, is awarded a $98,459,990 cost-plus-incentive fee modification to previously awarded Contract (N00024-21-C-2106) for USS John C. Stennis (CVN 74) Refueling Complex Overhaul for supplemental work and special incentives for improved facilities at Newport News Shipyard. This modification includes options which, if exercised, would bring the cumulative value of this modification to $110,959,990. Work will be performed in Newport News, Virginia, and is expected to be completed by October 2026. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $15,000,000 (55%); and fiscal 2025 operations and maintenance (Navy) funds in the amount of $12,500,000 (45%), will be obligated at time of award and funds in the amount of $27,500,000 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Raytheon Technologies, Raytheon Missiles and Defense, Tucson, Arizona, is awarded a $57,464,883 cost-plus-fixed-fee order (N0001925F0977) against a previously issued basic ordering agreement (N0001920G0007). This order provides non-recurring engineering, to include detailed design work, integration, qualification, and verification of the redesigned Digital Scene Matching Area Correlator (DSMAC) within the DSMAC subsystem and missile assembly for the Navy and Foreign Military Sales (FMS) customers. Work will be performed in Tucson, Arizona (85%); and McKinney, Texas (15%), and is expected to be completed in December 2028. Fiscal 2024 weapons procurement (Navy) funds in the amount of $21,322,045; and FMS customer funds in the amount of $36,142,838, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This order was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "BAE Systems Information and Electronic Systems Integration Inc., Greenlawn, New York, is awarded a $37,123,252 firm-fixed-price order against a previously issued basic ordering agreement (N0016425GJW77) for combat system mission crew workstations and mission crew workstation conversion kits to support the Maritime Patrol and Reconnaissance Aircraft. Work will be performed in Greenlawn, New York, and is expected to be completed by August 2028. Fiscal 2025 aircraft procurement (Navy) funds in the amount of $20,798,908 (56%); and Foreign Cooperative Projects (Navy) funds in the amount of $16,324,344 (44%), will be obligated at time of award. This contract was not competitively procured via the SAM.gov website, with one offer received. This is a sole source action in accordance with Federal Acquisition Regulation 6.302-1, only one responsible source. BAE Systems Information and Electronic Systems Integration Inc. is the original equipment manufacturer of the combat system mission crew workstations. No other supplies or services will satisfy agency requirements. Naval Surface Warfare Center, Crane Division in Crane, Indiana, is the contracting activity (N0016425FJ634).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "General Dynamics Mission Systems, Pittsfield, Massachusetts, is awarded a $34,957,203 cost-plus-incentive-fee and cost only modification to a previously awarded contract (N00024-20-C-5603) to exercise options for the sustainment of the Littoral Combat Ship integrated combat management system and associated combat system elements. Work will be performed in Pittsfield, Massachusetts (85%); and San Diego, California (15%), and is expected to be completed by August 2029. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $1,717.916 (33%); other customer funds (Navy) in the amount of $1,623,449 (31%); fiscal 2025 other procurement (Navy) funds in the amount of $1,171,152 (23%); and fiscal 2025 operations and maintenance (Navy) funds in the amount of $670,745 (13%), will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Technautix, Corp.,* Houston, Texas, is awarded a $22,098,896 firm-fixed-price contract (N3220524C4135) to provide financial management support services for Military Sealift Command's N8 Financial Directorate. The period of performance will commence on Sept. 1, 2025, and end on Feb. 28, 2031, if all options are exercised, and will be performed at the contractor's facility. Fiscal 2025 working capital funds (Navy) in the amount of $3,801,056 will be obligated at the time of the award, none of which will expire at the end of the current fiscal year. This contract will have a 12-month base period, four one-year option periods, and an option to extend services for up to six months. This contract was a competitive 8(a) procurement with proposals solicited via the Government Point of Entry website and 15 proposals were received in response to the solicitation. Military Sealift Command, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "KBR Wyle Services LLC, Lexington Park, Maryland, is awarded a $21,745,437 cost-plus-fixed-fee contract to provide program management, engineering, financial, and logistics support for the F/A-18 air vehicle, subsystems, armament, engine, and airborne weapons for the Navy and Foreign Military Sales (FMS) customers, as well as provides custodian support services for the government of Switzerland. Work will be performed in Patuxent River, Maryland (83%); Whidbey Island, Washington (6%); Philadelphia, Pennsylvania (3%); North Island, California (3%); Amberley, Australia (1%); and various locations outside the continental U.S. (4%), and is expected to be completed in August 2030. FMS customer funds in the amount of $14,692,067 will be obligated at the time of the award, none of which will expire at the end of the current fiscal year. This contract was not competed. Naval Air Warfare Center Aircraft Division, Patuxent River, Maryland, is the contracting activity (N0042125C1001).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Raytheon Co., Tucson, Arizona, is awarded a $13,541,848 firm-fixed-price order (N0001925F0983) against a previously issued basic ordering agreement (N0001920G0007). This order procures various components that are going obsolete in support of future Tomahawk missile production for the Navy and Marine Corps. Work will be performed in Tucson, Arizona and is expected to be completed in April 2028. Fiscal 2024 weapons procurement (Navy) funds in the amount of $2,788,798; fiscal 2023 weapons procurement (Navy) funds in the amount of $9,096,725; and fiscal 2023 procurement (Marine Corps) Funds in the amount of $1,656,325, will be obligated at the time of award, $10,753,050 of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Detyens Shipyards Inc.,* North Charleston, South Carolina, is awarded an $11,048,892 firm-fixed-price contract (N3220525C4150) for a 50-calendar day shipyard availability for the mid-term availability of Military Sealift Command's fleet replenishment ship USNS Robert E. Peary (T-AKE 5). This contract includes a base work package and two unexercised options for additional work and time which, if exercised, would increase the cumulative value of this contract to $11,230,060. Work will be performed in North Charleston, South Carolina, beginning Sept. 2, 2025, and is expected to be completed by Oct. 21, 2025. Working capital funds (Navy) in the amount of $11,048,892 are obligated for fiscal 2025 and will not expire at the end of the fiscal year. This contract was a small business set-aside solicited via the Governmentwide Point of Entry website and four offers received. Military Sealift Command, Norfolk, Virginia, is the contracting activity (N3220525C4150).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "General Dynamics Mission Systems, Pittsfield, Massachusetts, is being awarded a $10,013,674 cost-plus-incentive-fee contract modification (P00013) to exercise optional lines items under a previously awarded contract (N0003022C1005), for fiscal 2022-2025 U.S. and the United Kingdom Trident II (D-5) SSBN fire control system and SSGN attack weapon control system support. Work will be performed in Pittsfield, Massachusetts. Work is expected to be completed Sept. 30, 2025. Fiscal 2025 weapons procurement (Navy) funds in the amount of $10,013,674 are being obligated on this award. No funds will expire at the end of the current fiscal year. This contract was awarded as a sole source acquisition in accordance with the authority of 10 U.S. Code 3204(a)(1). Strategic Systems Programs, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Vectrus Systems Corp., Colorado Springs, Colorado, is awarded a $7,853,996 modification (P00003) to a cost-plus-fixed-fee, cost-reimbursable contract (N0042123C0036). This modification exercises an option to provide continued project, program, financial management, engineering, and technical support for the MH-60R multi-mission helicopter, subsystems, armament, engines, airborne weapons, spares, and support equipment for the government of Australia. Work will be performed in Patuxent River, Maryland, and is expected to be completed in September 2026. Foreign Military Sales customer funds in the amount of $7,853,996 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Warfare Center Aircraft Division, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "WPC Technologies,* Fenton, Missouri, is awarded a cost-plus-fixed-fee contract for the conductive polymer-enhanced cathode active material for lithium-ion batteries effort. The total cumulative value of this contract, including a 36-month base period with no options, is $7,800,000. This project addresses the Naval Strategy Power and Energy Focus Area. This contract provides for the development of cost-effective battery materials free of critical minerals with enhanced performance and comparable safety to state-of-the-art lithium-ion battery materials to support enhanced mission capability and endurance. The proposed materials synthesis processes that are compatible with existing U.S. manufacturing capabilities would enhance Department of Defense battery materials supply chain security. Work will be performed in Fenton, Missouri, and is expected to be completed in August 2028. Fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $7,800,000 are obligated at the time of award and will expire at the end of the current fiscal year. This contract was competitively procured under long range broad agency announcement (BAA) (N0001425SB001) entitled \"Long Range Broad Agency Announcement (BAA) for Navy and Marine Corps Science and Technology.\" Since proposals will be received throughout the year under the Long-Range BAA, the number of proposals received in response to the solicitation is unknown. The Office of Naval Research, Arlington, Virginia, is the contracting activity (N0001425C1322).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "US Foods Inc., doing business as US Foods Lexington, Lexington, South Carolina, has been awarded a maximum $99,554,294 fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for full-line food and beverage items. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a 168-day bridge contract. The ordering period end date is Feb. 14, 2026. Using customers are Army, Navy, Air Force, Marine Corps, and Coast Guard. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE300-25-D-3023).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Wulco Inc., Cincinnati, Ohio, has been awarded a minimum $25,259,500 firm-fixed-price delivery order (SPRRA2-25-F-0177) against a three-year long-term, indefinite-delivery/indefinite-quantity contract (SPRRA2-25-D-0021) under solicitation SPRRA2-25-R-0016 for the Objective Commander's Weapon Station. This was a competitive acquisition with ten responses received. This is a three-year contract with no option periods. The delivery order completion date is Sept. 30, 2026. Using customers are Army and federal civilian agencies. Type of appropriation is fiscal 2025 Army procurement funds. The contracting activity is the Defense Logistics Agency Aviation, Redstone Arsenal, Alabama.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Carter Enterprises LLC,** Brooklyn, New York, has been awarded a maximum $11,254,960 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for Forest Service shirts. This was a competitive acquisition with four responses received. This is a four-year contract with no option periods. The ordering period end date is Aug. 29, 2029. Using military service is Air Force. Type of appropriation is fiscal 2025 through 2029 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-0053).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "AM General LLC, South Bend, Indiana, was awarded a $96,100,282 firm-fixed-price delivery order for vehicles, shelters, and installation services. This action brings the total cumulative face value to $608,023,680. Work locations and funding will be determined with each order, with an estimated completion date of March 30, 2029. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W912CH-25-F-0404).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "South Carolina Commission for the Blind, Columbia, South Carolina, was awarded a $95,148,556 firm-fixed-price contract for full-food service operations at 11 dining facilities at Fort Jackson, South Carolina. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 31, 2026. The 419th Contracting Support Brigade, Fort Jackson, South Carolina, is the contracting activity (W9124C-25-D-A003).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Pond & Co., Peachtree Corners, Georgia (W9133L-25-D-A024); Burns & McDonnell Engineering Co. Inc., Kansas City, Missouri (W9133L-25-D-A025); HDR Engineering Inc., Omaha, Nebraska (W9133L-25-D-A026); Tetra Tech M&H, Ann Arbor, Michigan (W9133L-25-D-A027); and MJ Engineering,* Halfmoon, New York (W9133L-25-D-A028), will compete for each order of the $45,000,000 firm-fixed-price contract for non-personal architect-engineer services to support horizontal design services for the Air National Guard and the Army National Guard. Bids were solicited via the web with 11 received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 28, 2030. The National Guard Bureau, Arlington, Virginia, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "INK Arch LLC,* Honolulu, Hawaii (W912J6-25-D-A001); Okahara & Associates Inc.,* Hilo, Hawaii (W912J6-25-D-A002); and Bowers + Kubota Consulting Inc., Waipahu, Hawaii (W912J6-25-D-A003), will compete for each order of the $40,000,000 firm-fixed-price contract for architect-engineer services to support Air National Guard and Army National Guard. Bids were solicited via the web with 15 received. Work locations and funding will be determined with each order, with an estimated completion date of Feb. 28, 2031. The National Guard Bureau, Honolulu, Hawaii, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Sumaria Systems LLC, Peabody, Massachusetts, was awarded a $43,197,044 cost-plus-fixed-fee and cost-reimbursement contract. This contract provides the F-16 program office with a broad range of professional acquisition, engineering, scientific, research, test, intelligence, security management, and administrative capabilities to execute effective and responsive cyber resiliency for research, development, and life cycle acquisition and sustainment performance-based service activities. Work will be performed at Wright Patterson Air Force Base, Ohio; Hill AFB, Utah; Davis Monthan AFB, Arizona; Eglin AFB, Florida; and Tyndall AFB, Florida, and is expected to be completed by Jan. 31, 2026. This contract involves Foreign Military sales to Pakistan, Iraq, Oman, Morocco, Korea, Bahrain, Taiwan, Bulgaria, Slovakia, Taiwan, Singapore, Greece, Jordan, Indonesia, Chile, Argentina, and Türkiye. This contract was a sole source acquisition. Fiscal 2025 research, development, test and evaluation funds in the amount of $43,000,000 are being obligated at time of award. The Air Force Life Cycle Management Center, Wright Patterson AFB, Ohio, is the contracting activity (FA8622-25-C-B001).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Utah State University Space Dynamics Laboratory, North Logan, Utah, was awarded a $25,825,112 firm-fixed-price contract for the Republic of Korea Air Force (ROKAF) global hawk high-altitude unmanned aircraft system and the Tasking, Collection, Processing, Exploitation, and Dissemination system (TCPED). This contract provides for sustainment support services to include system maintenance, administration, and management of the contract field service representative supporting ground system maintenance while conducting missions; and associated operational support for the ROKAF TCPED program. Work will be performed at various locations in the Republic of Korea; and North Logan, Utah, and is expected to be completed by February 29, 2028. This contract involves Foreign Military Sales (FMS) to the Republic of Korea. This contract was a source directed acquisition. FMS funds in the amount of $25,825,112 are being obligated at time of award. The Air Force Life Cycle Management Center, Robins Air Force Base, Georgia is the contracting activity (FA8527-25-C-B001).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "STS Systems Defense LLC, San Antonio, Texas, was awarded a $20,327,902 firm-fixed-price task order for F-22 Reversion Paint Booth. This contract provides for a new paint booth for low observable coatings application. Work will be performed at Hill Air Force Base, Utah, and is expected to be completed by May 26, 2027. This contract was a non-competitive task order against contract FA8224-23-D-0007. Fiscal 2023 procurement funds in the amount of $13,586,059; and Air Force working capital funds in the amount of $8,853,683, are being obligated at the time of award. The Air Force Sustainment Center, Hill AFB, Utah, is the contracting activity (FA8224-23-D-0007-FA8228-25-F-0014).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Infinity Technology Services LLC, Colorado Springs, Colorado, has been awarded a $7,541,278 firm-fixed-price, cost-plus-fixed-fee, cost delivery contract for 24/7 operations support. This contract provides 24/7 product support such as operational dashboard monitoring, call tree notifications, and general tier 1 support. Work will be performed at Vandenburg Space Force Base, California, and is expected to be completed by Aug. 28, 2029. This contract was a competitive acquisition and nine offers were received. Fiscal 2025 research, development, test and evaluation funds in the amount of $111,000 are being obligated at time of award. Space Systems Command, El Segundo, California, is the contracting activity (FA8806-25-F-B012).",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Technology Service Corp., Arlington, Virginia, was awarded a Small Business Innovative Research Phase III indefinite-delivery/indefinite-quantity contract (H9240825DE001) with a maximum ceiling value of $400,000,000 for intelligence, surveillance, and reconnaissance services and supplies. The ordering period is Sept. 1, 2025, through Aug. 31, 2030. The work is expected to be completed by Aug. 31, 2030. U.S. Special Operations Command, MacDill Air Force Base, Florida, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "Fincantieri Marine Group LLC, Washington, D.C., was awarded an option of contract (H9240524C0006) with a value of $22,065,582 to produce the Combatant Craft Heavy V and associated equipment. The work will be performed in Green Bay, Wisconsin, and is expected to be completed by Nov. 14, 2027. U.S. Special Operations Command, MacDill Air Force Base, Florida, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "HRL Laboratories LLC, Malibu, California, has been awarded a $7,800,520 modification (P00007) to cost-plus-fixed-fee contract HR001124C0305 to exercise the Phase Two option of the Miniature Integrated Thermal Management Systems for 3D Heterogeneous Integration program. The modification brings the total cumulative face value of the contract to $14,713,329 from $6,912,809. Work will be performed in Malibu, California (77%); West Lafayette, Indiana (5%); Stanford, California (7%); and College Park, Maryland (11%), with an estimated completion date of August 2027. Fiscal 2025 research and development funds in the amount of $1,950,130 are being obligated at time of award. The Defense Advanced Research Projects Agency, Arlington, Virginia, is the contracting activity.",
    "contract_date": "2025-08-29"
  },
  {
    "text": "*Small business**Small business in historically underutilized business zones",
    "contract_date": "2025-08-29"
  }
]