[
  {
    "text": "CACI Inc., Chantilly, Virginia (HTC71125DE120), has been awarded an indefinite-delivery/indefinite-quantity contract with a total cumulative face value of $1,640,000,000. Funds will be allocated on individual task orders. The contract provides technical support services to field and sustain the Joint Transportation Management System at Scott Air Force Base, Illinois. The base period of performance is from Aug. 12, 2025, through Aug. 11, 2035. The U.S. Transportation Command, Directorate of Acquisition, Scott AFB, Illinois, is the contracting activity.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "General Dynamics Electric Boat Corp., Groton, Connecticut, was awarded a $322,593,238 cost-plus-fixed-fee modification to a previously awarded contract (N00024-24-C-2124) for engineering, technical, design agent, and planning yard support for operational strategic and attack submarines. Work will be performed in Groton, Connecticut (70%); Kings Bay, Georgia (13%); Bangor, Washington (10%); Pearl Harbor, Hawaii (3%); North Kingston, Rhode Island (2%); and Newport, Rhode Island (2%), and is expected to be completed by September 2025. Fiscal 2025 other procurement (Navy) funds in the amount of $16,527,923 (53%); fiscal 2025 operations and maintenance (Navy) funds in the amount of $14,275,119 (46%); and fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $367,000 (1%), will be obligated at time of award, of which $14,275,119 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "Delphinus,* Newton Square, Pennsylvania (N00104-25-D-B501); Epsilon, Portsmouth, Virginia (N00104-25-D-B601); and Oceaneering, Chesapeake, Virginia (N00104-25-D-B701), are being awarded a $86,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity, multiple award contract for the repair of valves and actuators within the corporate component repair program for Virginia-class and Los Angeles-class submarines. Each contract contains a provision for three option years. Work will be completed by August 2027. All work will be performed in various contractor facilities identified at task order level that cannot be determined at this time. Working capital funds (Navy) in the amount of $1,500 will be obligated ($500 on each of the three contracts) to fund the contracts’ minimum amount, and funds will not expire at the end of the fiscal year. These contracts were procured through full and open competition with five offers received. Naval Supply Systems Command Weapon Systems Support, Mechanicsburg, Pennsylvania, is the contracting activity.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "General Atomics Aeronautical Systems Inc., Poway, California, is awarded a $35,114,050 cost-plus-fixed-fee order (N0001925F0024) against a previously issued basic ordering agreement (N0001922G0006). This order provides engineering and logistics support to include program management, spares analyst, non-standard maintenance, engineering investigation, mishap investigation support, configuration change management support, production and sustainment diminishing manufacturing supply and material shortage support, airworthiness certification support, cybersecurity and network support, software modification and maintenance support, mission system and sensor payload modification integration solutions and support, reliability and maintainability analysis, trade studies and data management services in support of the successful operational capability for the MQ-9A Reaper Marine Air Ground Task Force Expeditionary Medium Altitude Long Endurance Unmanned Aerial System. Work will be performed in Poway, California (42%); Yuma, Arizona (13%); Kaneohe Bay, Hawaii (11%); Patuxent River, Maryland (7%); Cherry Point, North Carolina (7%); and various locations outside the continental U.S. (20%), and is expected to be completed in August 2026. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $17,211,330; and fiscal 2025 aircraft procurement (Navy) funds in the amount of $3,478,700, will be obligated at the time of award, $17,211,330 of which will expire at the end of the current fiscal year. This order was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "Lockheed Martin Rotary and Mission Systems, Moorestown, New Jersey, is awarded a $16,182,918 cost-plus-award-fee modification to previously awarded contract (N00024-23-C-5117) to exercise option items supporting systems engineering and software integration for the integrated combat system across the surface force portfolio of the Navy and Coast Guard. Work will be performed in Moorestown, New Jersey (41%); Columbia, Maryland (30%); Norfolk, Virginia (7%); Middletown, Rhode Island (6%); College Park, Maryland (5%); Mount Laurel, New Jersey (4%); Huntsville, Alabama (3%); Wallops Island, Virginia (1%); Arlington, Virginia (1%); San Diego, California (1%); and Herndon, Virginia (1%), and is expected to be completed by September, 2025. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $10,751,464 (77%); fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $1,416,615 (10%); fiscal 2025 weapon procurement (Navy) funds in the amount of $1,350,000 (10%); fiscal 2024 weapon procurement (Navy) funds in the amount of $166,102 (1%); fiscal 2024 other procurement (Navy) funds in the amount of $115,156 (1%); fiscal 2023 weapon procurement (Navy) funds in the amount of $50,195 (<1%); and fiscal 2023 other procurement (Navy) funds in the amount of $29,527 (<1%), will be obligated at time of award and funds in the amount of $29,527 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "Pacific Maritime Industries Corp.,* San Diego, California (N0018925D0027); Quality Metal Works Inc.,* New Orleans, Louisiana (N0018925D0028); and Atlantic Fabrication & Boiler Services,* Portsmouth, Virginia (N0018925D0033), are being awarded a $13,000,000 multiple award, fixed-fee, indefinite-delivery/indefinite-quantity contract that will include terms and conditions for the placement of firm-fixed-price task orders, to provide commander, Mid-Atlantic Regional Maintenance Command lightweight modular berth, related material, and replacement parts in support of the Shipboard Habitability Improvement Program. Each of the three contracts will run concurrently and will include a 60-month base ordering period with a six-month option period. The ordering period is expected to begin August 2025 and be completed by August 2030; if the option is exercised, work will be completed by February 2031. Work will be performed in San Diego, California; New Orleans, Louisiana; and Portsmouth, Virginia, and percentage of work cannot be determined at this time. Fiscal 2025 operation and maintenance (Navy) funds in the amount of $1,500 will be obligated ($500 on each of the three contracts) to fund the contracts’ minimum amount, and funds will expire at the end of the fiscal year. Individual task orders will be subsequently funded with appropriate fiscal year appropriations at the time of their issuance. The requirement was competitively procured under a small business set-aside pursuant to Federal Acquisition Regulation 16.504 with one offer received. Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "CORRECTION: The $21,629,891 cost-plus-fixed-fee, firm-fixed-price order awarded to Sikorsky Aircraft Corp. a Lockheed Martin Co., Stratford, Connecticut, on July 24, 2025, was announced with the incorrect order number. The correct number is N0001925F2157.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "Defense Engineering Corp., Beavercreek, Ohio, was awarded a shared ceiling $94,975,000 multiple award fair opportunity indefinite-quantity/indefinite-delivery for Science and Technology Applied Radio Frequency (RF) Systems (STARS). This contract provides for the STARS Program with RF sensing on all-weather intelligence, surveillance, and reconnaissance missions using nontraditional modes for persistent surveillance across multiple environments from multiple environments to improve the ability of the Air Force and Tri-Service Community programs. Work will be performed at Beavercreek, Ohio, and is expected to be completed by Aug. 11, 2031. This contract was a competitive acquisition and 12 offers were received. Fiscal 2025 research, development, test and evaluation funds in the amount of $365,959 are being obligated at time of award. The Air Force Research Laboratory, Wright-Patterson Air Force Base, Ohio, is the contracting activity (FA2377-25-D-B002 - FA2377-25-F-B004).",
    "contract_date": "2025-08-11"
  },
  {
    "text": "The Boeing Co., Defense, Space & Security, Oklahoma City, Oklahoma, was awarded an indefinite-delivery/indefinite-quantity contract for $79,737,087 E-4B Programmed Depot Maintenance #8. This contract provides for E-4B maintenance, repair and engineering issues. Work will be performed in Oklahoma City, Oklahoma; Offutt Air Force Base, Nebraska; and San Antonio, Texas, with an expected completion date of Dec. 21, 2026. This contract was a sole source acquisition. Fiscal 2025 operations and maintenance funds in the approximate amount of $79,737,087 are obligated at time of award. Air Force Life Cycle Management Center, Tinker AFB, Oklahoma, is the contracting activity (FA8134-25-F-0001). (Awarded Aug. 8, 2025)",
    "contract_date": "2025-08-11"
  },
  {
    "text": "SpendSmart Group LLC, Park Ridge, Illinois, was awarded a $15,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for the Contractor Operated Civil Engineer Supply Store Base Supply Store. This contract provides for non-personal services to support a simplified method for Civil Engineer Squadron personnel and facility managers to purchase quality materials, tools, and equipment used for work tasks, construction, recurring preventive maintenance, repairs, and the base U-Fix-It program. Work will be performed at Hurlburt Field, Florida, and is expected to be completed by Sept. 30, 2030. This contract was a small business set-aside acquisition, and one offer was received. Fiscal 2025 operations and maintenance appropriations funds in the amount of $3,000 are being obligated at time of award. The 1st Special Operations Contracting Squadron, Hurlburt Field, Florida, is the contracting activity (FA4417-25-D-0002).",
    "contract_date": "2025-08-11"
  },
  {
    "text": "Florida Department of Education, Division of Blind Services, Tallahassee, Florida, was awarded a $9,626,120 firm-fixed-price contract for mess attendant services at Hurlburt Field, Florida. This contract provides for non-personal services to support dining operations at the Reef-2-Go and Riptide Dining Facilities. Work will be performed at Hurlburt Field, Florida, and is expected to be completed by Jan. 15, 2030. This contract was a competitive acquisition, and five offers were received. Fiscal 2025 operations and maintenance appropriation funds in the amount of $9,626,120 are being obligated at the time of award. The 1st Special Operations Contracting Squadron, Hurlburt Field, Florida, is the contracting activity (FA4417-25-C-0009).",
    "contract_date": "2025-08-11"
  },
  {
    "text": "CORRECTION: The $43,202,330 firm-fixed-price, cost-plus-fixed fee, and cost-reimbursable no fee, indefinite-delivery/indefinite-quantity contract awarded to CACI NSS LLC, Reston, Virginia (FA8555-25-D-B001), announced on Aug. 7, 2025, was announced with the wrong award date. The correct award date is Aug. 11, 2025.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "Accenture Federal Services LLC, Arlington, Virginia, was awarded a $35,484,050 modification (P00062) to contract W52P1J-21-C-0025 to exercise Option Year Four of the Enterprise Task Management Software Solution. The modification brings the total cumulative face value of the contract to $250,804,312. Work will be performed in Fort Belvoir, Virginia, with an estimated completion date of Aug. 14, 2026. Fiscal 2025 operation and maintenance, Army funds in the amount of $35,484,050 were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity.",
    "contract_date": "2025-08-11"
  },
  {
    "text": "ACME General Corp., Morgantown, West Virginia, was awarded a $9,553,268 firm-fixed-price contract for research and development for data analysis to support a technology transition framework. The total cumulative face value of the contract is $31,477,958. Bids were solicited via the internet with one received. Work will be performed in Morgantown, West Virginia, with an estimated completion date of Aug. 11, 2028. Fiscal 2025 research, development, test, and evaluation, Army funds in the amount of $2,460,251 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W911QX-25-C-A004).",
    "contract_date": "2025-08-11"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-11"
  }
]