[
  {
    "text": "Airborne Tactical Advantage Co. LLC, Newport News, Virginia, is awarded a $199,067,376 firm-fixed-price, indefinite-delivery/indefinite-quantity contract that provides for contractor-owned and operated Contracted Air Services Type VI, highly modified business jet aircraft, to Navy fleet customers in support of a wide variety of airborne threat simulation capabilities to train, test and evaluate shipboard and aircraft squadron weapon systems, operators and aircrew on how to counter potential enemy stand-off jamming operations in today's electronic combat environment. Work will be performed in San Deigo, California (50%); and Virginia Capes, Virginia (50%), and is expected to be completed in October 2030. No funds will be obligated at the time of the award; funds will be obligated on individual orders as they are issued. This contract was competed; two offers were received. Naval Air Warfare Center, Aircraft Division, Patuxent River, Maryland, is the contracting activity (N0042125D0202).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "General Dynamics Information Technology, Falls Church, Virginia, is awarded a $98,500,000 indefinite-delivery/indefinite-quantity contract (N00039-25-D-7800) to accomplish the following: to continue providing service desk as a service as the managed service provider using a knowledge-based solution, employing artificial intelligence, machine learning, and natural language processing; to continue consolidating all remaining disparate Tier zero and one IT help desks and transition them under the Naval Enterprise Service Desk (NESD) infrastructure; and to continue building out capabilities to enhance the NESD solution. Fiscal 2025 operations and maintenance (Navy) funds; and other procurement (Navy) funds, will be used for obligations at the task order level. Concurrent with the award, the first task order will be issued in order to satisfy the minimum guarantee of $5,000 per the terms and conditions of the contract. This funding will expire at the end of the fiscal year. Work will be performed in Bossier City, Louisiana (50%); and New Orleans, Louisiana (50%). Performance is expected to be completed by August 2026. If all options are exercised, performance will continue until August 2028. This contract includes a one-year base ordering period and two one-year optional ordering periods, which if exercised, would bring the estimated cumulative value to $98,500,000 million. Pursuant to the Other Transactions Authority (OTA) of 10 U.S. Code 4022(f), this contract is not competitively procured because this is a follow-on production contract following the successful completion of the OTA prototype effort that originated in 2019. The Naval Information Warfare Systems Command, San Diego, California, is the contracting activity.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Charles Stark Draper Laboratories Inc., Cambridge, Massachusetts, is being awarded a $68,429,699 hybrid fixed-price-incentive-fee and cost-plus-incentive-fee modification (P00004) under a previously awarded and announced contract (N0003023C6008) to exercise optional line items for production of the Trident (D5) Guidance Subsystem. This requirement includes design analysis, testing, procurement, and manufacturing of interferometric fiber optic gyros repairs and associated material. This modification also benefits a foreign military sale to the United Kingdom. Work will be performed in Cambridge, Massachusetts (15%); Pittsfield, Massachusetts (65%); East Aurora, New York (10%); and Clearwater, Florida (10%). Work is expected to be completed Feb. 28, 2029. Fiscal 2025 weapons procurement (Navy) in the amount of $62,006,868 will be obligated at time of award. The remaining amounts will be incrementally funded. No funds will expire at the end of the current fiscal year. This contract was awarded as a sole-source acquisition pursuant to 10 U.S. Code 3204(a)(1) and was previously synopsized on the System for Award Management (SAM.gov) online portal. Strategic Systems Programs, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "South Texas Lighthouse for the Blind, Corpus Christi, Texas, is being awarded a $27,459,229 modification (P00007) under a previously awarded contract (N00604-24-D-4001) to exercise Option Year One for the acquisition of miscellaneous items for the Navy Exchange Service Command Ship Store Program. The exercise of this option will bring the estimated cumulative value of the total contract to date to $54,118,675. The original contract included a 12-month base period, four 12-month options, and a six-month extension option in accordance with Federal Acquisition Regulation 52.217-8 which if exercised, the total value of this contract will be $156,541,340. Work will be performed in Norfolk, Virginia (37%); San Diego, California (24%); Oahu, Hawaii (11%); Mayport, Florida (10%); Seattle, Washington (9%); and Diego Garcia (9%). Work is expected to be completed by September 2026; if all options are exercised, work will be completed by March 2030. No funds will be obligated at time of award. Appropriate fiscal year working capital funds (Navy) will be used as individual orders are issued. This sole-source requirement was authorized or required by statute in accordance with Federal Acquisition Regulation Part 8.7 Javits-Wagner-O'Day Act (41 U.S. Code 46-48c), and the rules of the Committee for Purchase from People Who Are Blind or Severely Disabled (41 Code of Federal Regulations, chapter 51) which implements the AbilityOne Program. Naval Supply Systems Command Fleet Logistics Center Pearl Harbor, Hawaii, is the contracting activity.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $22,662,794 cost-plus-fixed-fee order (N0001925F0264) against a previously issued basic ordering agreement (N0001924G0010). This order provides program management support to include technical, financial, and administrative data in support of identification of F-35 production and sustainment diminishing manufacturing sources and material shortages events for the Air Force, Marine Corps, Navy, and non-Department of Defense (DOD) participants. Work will be performed in Fort Worth, Texas, and is expected to be completed in December 2025. Fiscal 2023 aircraft procurement (Air Force) funds in the amount of $9,298,433; fiscal 2023 aircraft procurement (Navy) funds in the amount of $9,298,432; and non-DOD participant funds in the amount of $4,065,929, will be obligated at the time of award, $18,596,865 of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Parker Hannifin Corp., Irvine, California, is being awarded $17,488,000 for a firm-fixed-price requirements contract for logistics, repair, and spare support covering H-53 components to include hydraulic systems and landing gear wheel assemblies. This contract includes a five-year base period with no options. Work will be performed in Cherry Point, North Carolina (65%); Kalamazoo, Michigan (20%); and Irvine, California (15%). The contract will expire Aug. 31, 2030. Fiscal 2025 working capital funds (Navy) in the full amount of $4,250,000 will be obligated at the time of award and funds will not expire at the end of the current fiscal year. Working capital funds (Navy) will be obligated to fund subsequent delivery orders. One company was solicited for this sole-source requirement under authority 10 U.S. Code 2304 (a)(1) with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity (N00383-25-D-P301).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Raytheon Co., Indianapolis, Indiana, is awarded a $9,490,815 cost-plus-fixed-fee order (N0001925F0056) against a previously issued basic ordering agreement (N0001920G0007).  This order provides for a fleet software update release for the MV-22 for the Marine Corps, the CMV-22 for the Navy, and the CV-22 for the Air Force, to include qualification testing and integration into the air vehicle, airworthiness substantiation, flight test demonstration and validation/verification. Work will be performed in Indianapolis, Indiana, and is expected to be completed in June 2028. Fiscal 2025 operation and maintenance (Navy) funds in the amount of $3,423,967; fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $3,076,468; and fiscal 2025 operation and maintenance (Air Force) funds in the amount of $2,990,380, will be obligated at the time of award, $6,500,435 of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "ECS Riptide Ventures LLC,* Orlando, Florida, was awarded a $127,000,000 cost-no-fee, cost-plus-fixed-fee, firm-fixed-price contract for One-Semi Automated Forces (OneSAF) software, which supports modeling and simulation of force modernization and transformation from weapons systems to brigade and below-level combat. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 4, 2031. Army Contracting Command, Orlando, Florida, is the contracting activity (W900KK-25-D-0047).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Marinex Construction Inc., Charleston, South Carolina, was awarded a firm-fixed-price contract for fiscal 2025 Savannah Inner Harbor Maintenance Dredging in Savannah, Georgia. The amount of this action is $27,466,000, with a total cumulative face value of $33,456,000. Bids were solicited via the internet with one received. Work will be performed in Savannah, Georgia, with an estimated completion date of Nov. 25, 2026. Fiscal 2025 construction, Corps of Engineers, civil funds in the amount of $27,466,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Savannah, Georgia, is the contracting activity (W912HN-25-C-5006).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "TKTMJ Inc.,* Natchitoches, Louisiana, was awarded a $26,332,740 firm-fixed-price contract for constructing longitudinal peaked stone toe dikes with stone tiebacks and fill revetment for Public Law 84-99 Ouachita River Levee Bank Stabilization at five sites along the Ouachita River in Northeast Louisiana, south of Monroe, Louisiana. The work includes mobilization and demobilization, clearing and grubbing, and bank stabilization work consisting of tiebacks, excavation and backfill of graded C stone, and stormwater pollution prevention. Bids were solicited via the internet with seven received. Work will be performed in Monroe, Louisiana, with an estimated completion date of Aug. 26, 2027. Fiscal 2025 construction, Corps of Engineers, civil funds in the amount of $26,332,740 were obligated at the time of the award. U.S. Army Corps of Engineers, Vicksburg, Mississippi, is the contracting activity (W912EE-25-C-0004).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "JG&A-TSG JV,* Marietta, Georgia, was awarded a firm-fixed-price contract for a single award task order contract providing architect/engineer indefinite-delivery/indefinite-quantity contract for master planning and related services supporting Tobyhanna Army Depot. The amount of this action is $20,000,000. Bids were solicited via the internet with eight received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 24, 2030. U.S. Army Corps of Engineers, Philadelphia, Pennsylvania, is the contracting activity (W912BU-25-D-A001).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "General Dynamics Land Systems Inc., Sterling Heights, Michigan, was awarded a $10,417,075 modification (P00110) to contract W56HZV-22-C-0012 for Abrams system technical support. The modification brings the total cumulative face value of the contract to $1,036,945,452. Work will be performed in Sterling Heights, Michigan, with an estimated completion date of Feb. 27, 2027. Fiscal 2010 Foreign Military Sales funds, research, development, test, and evaluation, Army funds, and procurement, defense-wide funds in the amount of $10,417,075 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "The Dutra Group, San Rafael, California, was awarded a firm-fixed-price contract for fiscal year 2025 Petaluma River Channel Maintenance Dredging Project. The amount of this action is $9,165,400. Bids were solicited via the internet with two received. Work will be performed in Petaluma, California, with an estimated completion date of Nov. 29, 2025. Fiscal 2025 military construction, Army funds in the amount of $9,165,400 were obligated at the time of the award. U.S. Army Corps of Engineers, San Francisco, California, is the contracting activity (W912P7-25-C-A016).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Butt Construction Co. Inc., Dayton, Ohio, was awarded a firm-fixed-price contract for the construction of an addition and renovation to Building 321 at Niagara Falls Air Reserve Station, New York, which will house a Boom Operator Weapons System Trainer. The amount of this action is $8,958,700, with a total cumulative face value of $9,115,630. Bids were solicited via the internet with five received. Work will be performed in Niagara Falls, New York, with an estimated completion date of Sept. 11, 2027. Fiscal 2023 military construction, Air Force Reserve funds in the amount of $6,326,300; and fiscal 2025 operation and maintenance, Air Force Reserve funds in the amount of $2,632,400, were obligated at the time of the award. U.S. Army Corps of Engineers, Louisville, Kentucky, is the contracting activity (W912QR-25-C-A021).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Donjon Marine Co. Inc., Hillside, New Jersey, was awarded a firm-fixed-price contract for maintenance dredging of the Bronx River, New York, Federal Navigation Project. The amount of this action is $8,152,170, with a total cumulative face value of $9,687,790. Bids were solicited via the internet with three received. Work will be performed in Bronx, New York, with an estimated completion date of Jan. 14, 2026. Fiscal 2025 operation and maintenance, Army funds in the amount of $8,152,170 were obligated at the time of the award. U.S. Army Corps of Engineers, U.S. Army Corps of Engineers, New York, New York, is the contracting activity (W912DS-25-C-A009).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Calca Solutions LLC, Westlake, Louisiana, has been awarded an estimated $82,030,263 fixed-price, requirements type contract for propellant hydrazine supplies. This was a competitive acquisition with one response received. This is a five-year contract with no option periods. The performance completion date is Sept. 19, 2030. Using customers are Air Force and various federal civilian agencies. Type of appropriations is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Energy, Joint Base San Antonio, Texas (SPE601-25-D-1517).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Mount Rogers Community Services,* Atkins, Virginia (SPE1C1-25-D-N016, $76,202,871); and National Industries for the Blind,* Alexandria, Virginia (SPE1C1-25-D-B015, $76,202,871), have each been awarded a firm-fixed-price, indefinite-delivery/indefinite-quantity contract under solicitation SPE1C1-24-R-0046 for combat flame resistant type II and type III shirts. These are three-year contracts with no option periods. The ordering period end date is Aug. 26, 2028. Using military service is Army. Type of appropriation is fiscal 2025 through 2028 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Emerald Coast Utility Services Inc., Eglin Air Force Base, Florida, has been awarded an estimated $35,289,576 modification (P00085) to a 50-year contract (SP0600-16-C-8311) with no option periods incorporating both the economic-price-adjustment agreement and an adjustment to the utility service charge as a result of the water and wastewater inventory changes. This is a fixed-price with economic-price-adjustment contract. The performance completion date is June 14, 2067. Using military service is Air Force. Type of appropriation is fiscal 2025 through 2067 Air Force operations and maintenance funds. The contracting activity is the Defense Logistics Agency Energy, Fort Belvoir, Virginia.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Ranco Construction, Southampton, New Jersey (FA4484-25-D-0013); Paving Plus, Glassboro, New Jersey (FA4484-25-D-0014); The Oak Group, Camden, New Jersey (FA4484-25-D-0015); Kyle Conti Construction LLC (FA4484-25-D-0016); and Robert Nogueras Construction, Clementon, New Jersey (FA4484-25-D-0017), were awarded a ceiling $49,500,000 firm-fixed-price, indefinite-delivery/indefinite-quantity, multiple award contract for concrete and paving. This contract provides for labor, materials, equipment, transportation, fuel, supervision, and permits required for concrete and paving services. Work will be performed at Joint Base McGuire-Dix-Lakehurst, New Jersey, and is expected to be completed by Aug. 26, 2030. These contracts were competitive acquisitions, and 13 offers were received. No funds are being obligated at the time of award. The 87th Contracting Squadron, Joint Base McGuire-Dix-Lakehurst, New Jersey, is the contracting activity.",
    "contract_date": "2025-08-27"
  },
  {
    "text": "Tom Hammonds Enterprises, Valparaiso, Florida, was awarded a $24,221,869 firm fixed price contract for the upgrade of facility heating ventilation air conditioning in the guided weapons evaluation facility. This contract provides for a complete replacement of the chiller plant system and main test chamber computer room air conditioning unit system. Work will be performed at Eglin Air Force Base, Florida, and is expected to be completed by Aug. 31, 2026. This contract was a competitive acquisition and two offers were received. Fiscal 2024 research, development, test, and engineering funds in the amount of $ 9,776,328 are being obligated at time of award. The Air Force Test Center, Eglin Air Force Base, Florida, is the contracting activity (FA2823-25-C0045).",
    "contract_date": "2025-08-27"
  },
  {
    "text": "*Small business**Mandatory source",
    "contract_date": "2025-08-27"
  }
]