[
  {
    "text": "Deloitte Consulting LLP, Arlington, Virginia, was awarded a ceiling $115,000,000 firm-fixed-price indefinite-delivery/indefinite-quantity contract for the Department of Defense (DOD) Cyber Crime Center Cyber Training Academy follow-on. This contract provides for cyber training to Air Force and other DOD entities and personnel whose duties include defending DOD information systems from illegal, unauthorized, or counter-intelligence activities. Work will be performed at the National Capital Region and is expected to be completed by Aug. 5, 2030. This contract was a competitive acquisition and ten offers were received. The Air Force District of Washington, Enterprise Support Division, Joint Base Andrews, Maryland, is the contracting activity (FA7014-25-D-0007).",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Azimuth Corp., Beavercreek, Ohio, has been awarded a ceiling $98,716,370 modification (P00002) to a previously awarded contract (FA8650-22-D-5406) for research and development on the Materials Research and Survivability Studies II Program. The modification brings the total cumulative face value of the contract to $196,000,000. Work will be performed at Wright-Patterson Air Force Base, Ohio, and is expected to be completed by May 16, 2031. Fiscal 2024 research, development, test and evaluation funds in the amount of $215,002 are being obligated at time of award. The Air Force Research Laboratory, Wright-Patterson AFB, Ohio, is the contracting activity.",
    "contract_date": "2025-08-06"
  },
  {
    "text": "BAE Systems Australia Ltd., Edinburgh, Australia, was awarded $9,024,705 undefinitized contract action for continued High Frequency system digital receive chain sub-system sustainment services. This contract provides for engineering and programmatic services, hardware and software procurement, repair actions as part of sustainment activities, system integration, system testing, and drafting and updating technical documentation. Work will be performed in Edinburgh, Australia, and is expected to be complete by Aug. 5, 2025. This contract was a sole source acquisition. Fiscal 2025 operations and maintenance appropriations funds in the amount of $457,929; fiscal 2024 other procurement funds in the amount of $338,688; and fiscal 2024 research, development, test and evaluation funds in the amount of $2,619,443, are being obligated at the time of award. The Air Force Life Cycle Management Center, Robins Air Force Base, Georgia, is the contracting activity (FA8507-25-C-0001).",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Weeks Marine Inc., Covington, Louisiana, was awarded a $38,387,500 firm-fixed-price contract, with a total cumulative face value of $41,151,250, for maintenance dredging. Bids were solicited via the internet with one received. Work will be performed in Savannah, Georgia; Charleston, South Carolina; and Wilmington, North Carolina; with an estimated completion date of April 15, 2026. Fiscal 2025 civil operation and maintenance funds in the amount of $38,387,500 were obligated at the time of the award. U.S. Army Corps of Engineers, Wilmington, North Carolina, is the contracting activity (W912PM-25-C-A008).",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Rolls-Royce Solutions America Inc., Novi, Michigan, was awarded a $38,356,010 modification (P00009) to contract W56HZV-23-C-0054 for Eitan Power Packs. The modification brings the total cumulative face value of the contract to $119,780,051. Work will be performed in Novi, Michigan, with an estimated completion date of Dec. 31, 2027. Fiscal 2025 Foreign Military Sales (Israel) funds in the amount of $38,356,010 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Sol Engineering Services LLC,* Jackson, Mississippi, was awarded a $20,000,000 firm-fixed-price contract for laboratory support services. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 5, 2030. U.S. Army Corps of Engineers' Engineer Research and Development Center, Vicksburg, Mississippi, is the contracting activity (W912HZ-25-D-A003).",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Manson Construction Co., Seattle, Washington, was awarded a firm-fixed-price contract for cutterhead dredging with a total cumulative face value of $14,013,300. Bids were solicited via the internet with four received. Work will be performed in Morgan City, Louisiana, with an estimated completion date of Dec. 3, 2025. Fiscal 2025 civil construction funds in the amount of $14,013,300 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans, Louisiana, is the contracting activity (W912P8-25-F-0102).",
    "contract_date": "2025-08-06"
  },
  {
    "text": "AM General LLC, South Bend, Indiana, was awarded a $9,410,380 firm-fixed-price contract, with a total cumulative face value of $9,410,380, for radiator and oil cooler assemblies. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 6, 2028. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W912CH-25-D-0070).",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Tetra Tech, Inc., San Diego, California, was awarded a $9,318,617 modification (P00002) to contract W912DY-24-F-0049 for recurring maintenance and minor repairs services for petroleum facilities. The modification brings the total cumulative face value of the contract to $52,434,095. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2026. U.S. Army Corps of Engineers' Engineer Research and Development Center, Huntsville, Alabama, is the contracting activity.",
    "contract_date": "2025-08-06"
  },
  {
    "text": "CORRECTION: The $726,894,788 contract (W51EW7-25-D-A002) announced on Aug. 5, 2025, to TRAX International Corp., Las Vegas, Nevada, for test center support services was announced with an incorrect estimated completion date. The correct estimated completion date is Aug. 24, 2032.",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Joseph J. Henderson & Son Inc., Gurnee, Illinois, was awarded a $25,339,799 firm-fixed-price contract for water treatment plant repair and replacement at Naval Station Great Lakes, Great Lakes, Illinois. Work is expected to be completed by August 2028. Fiscal 2025 operation and maintenance, Navy funds in the amount of $25,339,799 are obligated on this award and will expire at the end of the current fiscal year. This contract was competitively procured via the www.sam.gov website with three offers received. The Naval Facilities Engineering Systems Command, Mid-Atlantic, Norfolk, Virginia, is the contracting activity (N4008525C0005). (Awarded Aug. 4, 2025)",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $12,893,223 modification (P00006) to a previously awarded cost-plus-incentive-fee contract (N0001922C0015). This modification increases the contract value to provide continued engineering and other related activities in support of the design and development of a Joint Strike Fighter aircraft variant tailored for an unspecified Foreign Military Sales (FMS) customer. Work will be performed in El Segundo, California (56%); Fort Worth, Texas (43%); and Tempe, Arizona (1%), and is expected to be completed in December 2028. FMS customer funds in the amount $12,893,223 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-06"
  },
  {
    "text": "Derco Aerospace Inc., Milwaukee, Wisconsin, has been awarded a maximum $17,427,073 firm-fixed-price with price-pending, requirements subsumable contract (SPE4AX-25-D-P003) issued under a five-year base contract (SPE4AX-22-D-9000) with one-five-year option period for various H-60 Navy Seahawk helicopter platform electrical parts. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. The performance completion date is Aug. 7, 2030. Using customer is the Navy. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation at Richmond, Virginia.",
    "contract_date": "2025-08-06"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-06"
  }
]