[
  {
    "text": "Northrop Grumman Systems Corp., El Segundo, California, is awarded a $99,128,262 cost-plus-fixed-fee (N0042125F7048) against a previously issued basic ordering agreement (N0001925G0003). This order is to support the Department of Defense's (DOD) Combined Joint All-Domain Command and Control vision by leveraging commercial technologies to provide resilient, interoperable and secure information dominance solutions that take advantage of higher bandwidth and low-latency data rates. Initial Providence Distributed Battle Management Command and Control System Minimum Viable Products will support the DOD use cases. The capability will be hosted in various manned and unmanned systems. Work will be performed in Patuxent River, Maryland (15%); Melbourne, Florida (15%); Fallon, California (15%); Shreveport, Louisiana (10%); Guam (10%); Washington, DC (8%);Abilene, Texas (5%); China Lake, California (5%); Hickman, Hawaii (5%); Anchorage, Alaska (3%); Oklahoma City, Oklahoma (3%); Oceanside, California (3%); and Point Mugu, California (3%), and is expected to be completed in March 2028. Fiscal 2025 research, development, test and evaluation funds in the amount of $7,471,923; and fiscal 2025 Navy working capital funds in the amount of $575,000, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This order was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Advanced Technology Systems Co.,* McLean, Virginia (N0003925DE004); Blue Ridge Tech Solutions,* Maryville, Tennessee (N0003925DE005); Global C2 Integration Technologies LLC*, Las Vegas, Nevada (N0003925DE006); Geodesicx Inc.,* Chesapeake, Virginia (N0003925DE008); INTECON LLC,* Fredericksburg, Virginia (N0003925DE009); ITC Defense,* Arlington, Virginia (N0003925DE010); and NewSat North America LLC,* Indian Harbour Beach, Florida (N0003925DE012), are each being awarded a hybrid, firm-fixed-price, cost-plus fixed-fee, cost-reimbursable, indefinite-delivery/indefinite-quantity, multiple award contract for command, control, communications, computers and intelligence integrated international support services in support of U.S. security assistance and security cooperation programs. No contract funds will be obligated on the basic awards. Funds in the amount of $2,000 per awardee will be obligated at the time of award on the first task order under each contract. This contract will utilize Foreign Military Sales funding from various security cooperation partners that will be identified as individual task orders are issued. Work will be performed in various overseas locations based on the requirement for each task order placed. The ordering period for each contract is five years. Throughout the duration of the awarded contracts, the total obligated amount on orders for all of the awarded contracts combined will not exceed $76,756,000. These contracts were competitively procured with small business proposals solicited with 10 offers received via SAM.gov and Naval Information Warfare Systems Command E-Commerce site. The Naval Information Warfare Systems Command, San Diego, California, is the contracting activity (N00039).",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Jacobs Technology Inc., Tullahoma, Tennessee, is awarded a cost-plus-fixed-fee, cost, $50,519,533 contract for the continuation of efforts for the upgrade, redesign, and operation of the current air launch test capability and associated special test equipment, as well as provides for the conceptual design, development and operation of an underwater launch test capability in support of in-air and underwater launch testing for the new generation of weapons for the Navy. Work will be performed China Lake, California, and is expected to be completed August 2027. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $2,000,000 will be obligated at the time of award, none of which expire at the end of the current fiscal year. This contract was not competed. Naval Air Warfare Center Weapons Division, Chiba Lake, California, is the contracting activity (N6893625C0034).",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Platform Systems Inc.,* Hollywood, Maryland, is being awarded a $29,607,487 firm-fixed-price, Job Order (N0016425FJ608) under the previously awarded basic ordering agreement (N0016425GJR96) for Vanilla Long Endurance Unmanned Aircraft Systems, supporting hardware, spare parts, engineering support, and logistics support. This job order includes options which, if exercised, would bring the cumulative value to $29,903,917. Work will be performed in Hollywood, Maryland, and is expected to be completed by August 2026. This contract action was not competitively procured in accordance with 15 U.S. Code 638(r)(4) Small Business Innovation Research (SBIR) Phase III derived from SBIR Phase II. Fiscal 2025 procurement (Department of Defense) funds in the amount of $29,370,487 (99%); and fiscal 2025 research, development, test and evaluation (Office of the Under Secretary of Defense) funds in the amount of $237,000 (1%), for a total of $29,607,487, will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Surface Warfare Center, Crane Division, Crane, Indiana, is the contracting activity (N0016425FJ608).",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Triumph Gear Systems Inc., Park City, Utah, is being awarded an $11,659,494 undefinitized contract action (N00383-25-F-S809), under previously awarded contract N00383-22-G-S801 for the repair of 42 pylon conversion actuators in support of V-22 aircraft. All work will be performed in Park City, Utah, and will be completed by January 2027. Fiscal 2025 annual working capital (Navy) funds in the amount of $8,744,620 will be obligated at time of award and funds will not expire at the end of the current fiscal year. One source was solicited for this non-competitive, sole-source requirement in accordance with 10 U.S. Code 2304(c)(1) with one offer received. Naval Supply Systems Command, Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Sikorsky Aircraft Corp., Stratford, Connecticut, is awarded an $8,090,761 firm-fixed-price, cost-plus-fixed-fee order (N6833525F0376) against a previously issued basic ordering agreement (N0001923G0002). This order procures peculiar support equipment (PSE) end items and associated technical data packages (TDP) and technical support for the CH-53K Program. The TDPs consist of all two-dimensional drawings, field sheets, parts lists, application lists, and any other associated lists for the PSE procured under this effort. This procurement will allow for delivery and acceptance of the final depot level maintenance PSE TDPs and hardware, which includes the conversion of the TDP into an acceptable format for the government to use in future competitive procurements for production of the PSE. In addition, this effort will include technical support to resolve any government questions on the validated content, drawings, and Sikorsky specifications or standards referenced within the TDP. Work will be performed in Stratford, Connecticut, and is expected to be completed in August 2030. Fiscal 2024 aircraft procurement (Navy) funds in the amount of $8,090,761 will be obligated at time of award, none of which will expire at the end of the current fiscal year. Naval Air Warfare Center Aircraft Division, Lakehurst, New Jersey, is the contracting activity.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Ducks Unlimited Inc., Ridgeland, Mississippi, was awarded a $98,500,000 firm-fixed-price contract (W912EE-25-D-A013) for the purchase of mitigation credits representing up to 27,706 Average Annual Functional Units located in the Yazoo basin watersheds to compensate for unavoidable habitat losses caused by the construction and operation of the Yazoo Backwater Pumping Plant Project. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 24, 2030. U.S. Army Corps of Engineers, Vicksburg District, is the contracting activity.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Great Lakes Dredge & Dock Co. LLC, Houston, Texas, was awarded a firm-fixed-price contract (W912PM-25-C-A011) for maintenance dredging. The amount of this action is $26,852,500, with a total cumulative face value of $27,649,750. Bids were solicited via the internet with one received. Work will be performed in Brunswick, Georgia; and Morehead City, North Carolina, with an estimated completion date of April 15, 2026. Fiscal 2021, 2022, 2023, 2024, and 2025 civil operation and maintenance funds in the amount of $26,852,500, were obligated at the time of the award. U.S. Army Corps of Engineers, Wilmington District, is the contracting activity.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Total Computer Solutions Inc.,* Burke, Virginia, was awarded a $14,539,626 modification (P00016) to contract W31P4Q-23-F-D001 for programmatic support services for the Utility Helicopters Project Office. The modification brings the total cumulative face value of the contract to $14,539,626. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 30, 2026. The Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "HDR Engineering Inc., Omaha, Nebraska, was awarded a $10,000,000 firm-fixed-price contract (W9127N-25-D-A002) for architect-engineer indefinite-delivery, indefinite-quantity pile dike services. This contract will provide survey, inspection, engineering, analysis, contract development, design, and design review services for Civil Works projects. Bids were solicited via the internet with three received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 24, 2030. The U.S. Army Corps of Engineers, Portland District, Oregon, is the contracting activity.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Radial Research and Development Ltd., Fairborn, Ohio, was awarded a ceiling $94,975,000 indefinite-delivery/indefinite-quantity task order for Science and Technology Applied RF Systems (STARS). This contract provides the STARS Program with RF Sensing on all-weather intelligence, surveillance, and reconnaissance using non-traditional modes for persistent surveillance across multiple environments from multiple environments to improve the ability of the Air Force and Tri-Service community programs. Work will be performed in Fairborn, Ohio, and is expected to be completed by Aug. 25, 2031. This contract was a competitive acquisition and 12 offers were received. Fiscal 2025 research, development, test and evaluation funds in the amount of $356,790 are being obligated at time of award. The Air Force Research Laboratory, Wright Patterson Air Force Base, Ohio is the contracting activity (FA2377-25-DB003 – FA2377-25-FB006).",
    "contract_date": "2025-08-25"
  },
  {
    "text": "The University of Dayton Research Institute, Dayton, Ohio, was awarded a $43,959,963 cost-plus-fixed-fee contract for Hybrid AI and Autonomy Research and Development Considered Operationally Relevant and Explainable. This contract provides for further development and maturation of Artificial Intelligence software, for crewed and uncrewed systems through advancements utilizing existing Air Force frameworks. Work will be performed at Dayton, Ohio, and is expected to be completed by Nov. 24, 2029. This award was a sole source acquisition. Fiscal 2025 research, development, test and evaluation funds in the amount of $1,668,161 are being obligated at the time of the award. The Air Force Research Laboratory, Wright Patterson Air Force Base, Ohio, is the contracting activity (FA2391-25-C-B010).",
    "contract_date": "2025-08-25"
  },
  {
    "text": "Sea Pac Engineering Inc., Los Angeles, California, was awarded a $34,325,690 firm-fixed-price contract for the design and repair of the Rota dormitory, B25017. Work will be performed at Andersen Air Force Base, Guam, and is expected to be completed by Jan. 7, 2028. This contract was a competitive acquisition, and five offers were received. Fiscal 2025 operations and maintenance appropriations funds in the amount of $34,325,690 are being obligated at the time of award. The 36th Contracting Squadron, Andersen Air Force Base, Guam is the contracting activity (FA5240-25-C-0006).",
    "contract_date": "2025-08-25"
  },
  {
    "text": "SeaCube Container Leasing International Inc., Woodcliff Lake, New Jersey (HTC71124DW028/P0005); Textainer Equipment Management (U.S.) Ltd., San Francisco, California (HTC71124DW029/P0004); and Triton Container International Ltd., Hamilton, Bermuda (HTC71124DW030/P0004), have been awarded modifications to an indefinite-delivery/indefinite-quantity, fixed-price contract, with an estimated value of $45,700,000. This brings the total cumulative face value of the program to $91,492,873. This contract is to obtain intermodal equipment leasing and transportation services, information technology management in support of leasing operations, and related container support functions to meet the government missions and exercises for peacetime, contingency, disaster, and humanitarian operations on a global basis, to include maintenance, repair, inspection, leasing, and acquisition of intermodal equipment. The option period of performance is from Sept. 1, 2025, to Aug. 31, 2026. Operations and maintenance funds will be obligated for fiscal 2025 and 2026. The U.S. Transportation Command, Directorate of Acquisition, Scott Air Force Base, Illinois, is the contracting activity.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "UPDATE: McRae Industries Inc.,* Mount Gilead, North Carolina (SPE1C1-25-D-0079, $28,807,472), has been added as an awardee to the multiple award contract for hot weather combat improved boots, issued against solicitation SPE1C1‐24‐R‐0090 and awarded June 27, 2025. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "UPDATE: Metrex Research LLC, Madison, Wisconsin (SPE2DH-25-D-0024, $24,900,000), has been added as an awardee to the multiple award contract for medical equipment and accessories for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DH-21-R-0002 and awarded Feb. 10, 2022. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-08-25"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-25"
  }
]