[
  {
    "text": "Dynetics Inc., Huntsville, Alabama, was awarded a cost-plus-fixed-fee, firm-fixed-price contract for Indirect Fire Protection Capability weapon system requirements. The amount of this action is $264,594,352. Bids were solicited via the internet with one received. Work will be performed in Huntsville, Alabama; Dallastown, Pennsylvania; and Chanhassen, Minnesota with an estimated completion date of July 30, 2026. Fiscal 2025 research, development, test and evaluation, Army funds in the amount of $127,875,297 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity (W31P4Q-25-F-0222).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Computable Insights LLC, Herndon, Virginia, was awarded a firm-fixed-price contract for an Enterprise License Agreement with computable Insights/Salesforce for Salesforce Software Licenses. The amount of this action is $99,697,753. Bids were solicited via the internet with one received. Work will be performed on Fort Belvoir, Virginia, with an estimated completion date of June 26, 2030. Fiscal 2025 operation and maintenance, Army funds in the amount of $9,071,430 were obligated at the time of the award. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity (W519TC-25-C-0037).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Amentum Services Inc., Chantilly, Virginia, was awarded a $31,742,028 modification (P00127) to contract W58RGZ23-C-0029 to increase contract ceiling. The modification brings the total cumulative face value of the contract to $978,296,891. Work will be performed in Chantilly, Virginia, with an estimated completion date of Jan. 15, 2030. Fiscal 2010 operation and maintenance, Army funds in the amount of $31,742,028 were obligated at the time of the award. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Day & Zimmermann Lone Star LLC, Texarkana, Texas, was awarded a firm-fixed-price contract for Production of M82A1 Percussion Primers. The amount of this action is $30,912,513. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of April 30, 2028. Army Contracting Command, Rock Island Arsenal is the contracting activity (W519TC250-F-0323).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "FSCX Inc., Lawton, Oklahoma, was awarded a $13,570,300 modification (P00007) to contract W9124G-24-C-0001 for Survival, Evasion, Resistance and Escape (SERE) Instruction and Support Services. The modification brings the total cumulative face value of the contract to $25,266,709. Work will be performed on Fort Rucker, Alabama, with an estimated completion date of Aug. 25, 2029. Fiscal 2025 operation and maintenance, Army funds in the amount of $3,387,020 were obligated at the time of the award. Army Field Directorate Office, Fort Eustis, Virginia, is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Security Signals Inc., Cordova, Tennessee, was awarded a $10,654,852 firm-fixed-price contract for production of the M82A1 Percussion Primer. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of Feb. 28, 2029. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity (W519TC-25-F-0325).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "DigiFlight Inc., Columbia, Maryland, was awarded a $9,493,651 modification (P00091) to contract W31P4Q-19-F-E002 for Apache Attack Helicopter Project Office logistics support services. Work will be performed in Huntsville, Alabama, with an estimated completion date of Oct. 31, 2025. Fiscal 2025 other procurement, Army; and Foreign Military Sales funds, in the amount of $9,493,651, were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Loc Performance Products LLC, St. Marys, Ohio, was awarded a firm-fixed-price contract for track pad repair kit. The amount of this action is $9,247,996. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 29, 2030. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W912CH-25-D-0037).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "US Facilities Inc., Philadelphia, Pennsylvania, was awarded a $7,721,940 modification (P00002) to contract W91236-24-C-5000 to conduct all services for the Atlantic Intracoastal Waterway bridges, structures, and facilities. The modification brings the total cumulative face value of the contract to $20,898,995. Work will be performed in Norfolk, Virginia, with an estimated completion date of Sept. 29, 2026. Fiscal 2025 civil operation and maintenance funds in the amount of $7,721,940 were obligated at the time of the award. U.S. Army Corps of Engineers, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Sysco Seattle Inc., Kent, Washington, has been awarded a maximum $175,625,908 firm-fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for full-line food and beverage items. This was a competitive acquisition with two responses received. This is a five-year contract with no option periods. The ordering period end date is Sept. 28, 2030. Using military services are Army, Navy, Air Force, and Marine Corps. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE300-25-D-3018).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Sysco Montana Inc., Billings, Montana, has been awarded a maximum $13,695,844 fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for full-line food and beverage items. This was a competitive acquisition with one response received. This is a five-year contract with no option periods. The ordering period end date is July 27, 2030. Using military services are Army and Air Force. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE300-25-D-3019).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "LOC Performance Products LLC, Saint Marys, Ohio, has been awarded a maximum $9,553,677 firm-fixed-price delivery order (SPRDL1-25-F-0177) against a five-year indefinite-delivery/indefinite-quantity contract (SPRDL1-24-D-0009) for Vehicular Track Shoe units. This was a competitive acquisition with three responses received. The ordering period end date is Feb. 24, 2029. Using military service is Army. Type of appropriation is fiscal 2029 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "AM General LLC, South Bend, Indiana, has been awarded a maximum $8,645,046 firm-fixed-price delivery order (SPRDL1-25-F-0162) against a three-year firm-fixed-price requirements contract (SPRDL1-24-D-0034) for A2 and Up Armored High Mobility Multi-Purpose Wheeled Vehicle hydraulic transmission units. This was a sole-source acquisition using justification 10 U.S. Code 3204 (2)(1), as stated in Federal Acquisition Regulation 6.302-1. The ordering period end date is May 1, 2027. Using military service is Army. Type of appropriation is fiscal 2025 through 2026 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Pomp's Tire Service Inc., New Berlin, Wisconsin, has been awarded a maximum $8,095,156 firm-fixed-price delivery order (SPRDL1-25-F-0146) against a three-year basic ordering agreement (SPRDL1-22-D-0051) contract for M1076 load handling system wheel and tire assembly units. This was a competitive acquisition with three responses received. The ordering period end date is Sept. 1, 2025. Using military service is Army. Type of appropriation is fiscal 2025 through 2026 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "CORRECTION: The contract announced on July 18, 2025, for Northrop Grumman Systems Corp., Annapolis, Maryland (SPE4A5-25-C-0040), for $14,027,974 was announced with an incorrect award date.  The correct award date is July 25, 2025. The contracting activity is the Defense Logistics Agency Aviation at Richmond, Virginia.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Teledyne Brown Engineering Inc., Huntsville, Alabama, is being awarded $126,687,633 indefinite-delivery/indefinite-quantity contract with cost-plus-fixed-fee and firm-fixed-price ordering provisions for support services to include designing and developing IT applications, developing medical manpower analytical methodologies, implementing algorithms, mapping capabilities, optimizing simulation engines, migration of tools to a cloud environment, delivering training and providing help-desk services in support of the medical modeling, simulation and mission support department at the Naval Health Research Center. The contract will include a five-year ordering period with no options. The ordering period is expected to begin August 2025 and be completed by August 2030. Work will be performed in Huntsville, Alabama (80%); and San Diego, California (20%). Fiscal 2025 research, development, test and evaluation (RDT&E) (Navy) funds in the amount of $1,000 will be obligated to fund the contract's minimum amount and funds will not expire at the end of the current fiscal year. Subsequent task orders will be funded with appropriate fiscal year operations and maintenance (Navy) or RDT&E (Navy) funds. The contract was competitively procured electronically through the Navy Electronic Commerce Online and the System for Award Management (sam.gov) websites with three offers received. Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department, Philadelphia, Pennsylvania, is the contracting activity (N00189-25-D-Z018).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Lockheed Martin Rotary and Mission Systems, Manassas, Virginia, is awarded a $21,681,442 cost-plus-incentive-fee modification to a previously awarded contract (N00024-20-C-6117) to exercise options for Foreign Military Sales (FMS) engineering design and development in support of sound navigation and ranging systems. Work will be performed in Manassas, Virginia (65%); Clearwater, Florida (32%); Syracuse, New York (2%); and Marion, Florida (1%), and is expected to be completed by September 2026. FMS funds in the amount of $3,716,552 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "L3Harris Corp., Millersville, Maryland, is awarded a $16,000,000 firm-fixed-price modification to a previously awarded contract N00024-16-C-6251. This modification is to procure spares parts and components. Work will be performed in Ashaway, Rhode Island (85%); and Syracuse, New York (15%), and is expected to be completed by January 2029. Fiscal 2025 other procurement (Navy) spares funds in the amount of $5,910,105 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "SyQwest Inc.,* Cranston, Rhode Island, is awarded an undefinitized contract action with a not-to-exceed amount of $7,925,190 for source and sensor kits. This is an eight-month contract with no option periods. Work will be performed in Cranston, Rhode Island, and is expected to be completed by January 2026. Fiscal 2024 weapons procurement (Navy) funds in the amount of $3,883,343 (49%) will be obligated on the award and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S.C. 3204(a)(7). Naval Undersea Warfare Center Division, Newport, Newport, Rhode Island, is the contracting activity (N66604-25-C-0562).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Mercury Mission Systems, LLC, Gulf Breeze, Florida, has been issued a ceiling $25,000,000 value increase modification (P00004) to previously awarded (FA8615-20-D-6070) for F-16 cockpit communications control panel organizer units and associated support. The modification brings the total cumulative face value of the contract to $70,000,000. Work will be performed in Gulf Breeze, Florida, and is expected to be completed on Sept. 29, 2032. No funds are being obligated at the time of award. The Air Force Life Cycle Management Center, Wright-Patterson Air Force Base, Ohio, is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "L3Harris Technologies, Integrated Systems L.P, Greenville, Texas, was awarded an $11,017,782 firm-fixed-price contract for the procurement of contractor management services. This contract provides for program management and project engineering support for the Tactical Airborne Surveillance System program. Work will be performed at Greenville, Texas, and is expected to be completed by July 30, 2026. This contract involves foreign military sales. This contract was a sole source acquisition. Foreign Military Sales funds in the amount of $11,017,782 are being obligated at the time of award. The 645th Aeronautical Systems Group, Wright-Patterson Air Force Base, Ohio, is the contracting activity (FA8620-25-F-B051).",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Open X Education Inc., Layton, Utah, was awarded a $9,000,000 ceiling firm-fixed-price modification (P00002) to a previously awarded contract (FA3020-21-A-0007) for Innovation Sherpas. This modification brings the total cumulative face value of the contract to $9,000,000 from $1,900,000. Work will be performed throughout the Department of Defense based on individual calls and is expected to be completed by August 31, 2026. No funds are being obligated at the time of award. The 82nd contracting squadron, Sheppard Air Force Base, Texas, is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Lockheed Martin, Littleton, Colorado, has been awarded a $8,133,823 modification (P00805) to a previously awarded contract (FA8807‐08‐C‐0010) for Global Positioning System III non-flight single board computers. The modification brings the total cumulative face value of the contract to $4,696,831,149. Work will be performed at Littleton, Colorado, and is expected to be completed by January 2028. Fiscal 2025 missile procurement funds in the amount of $8,133,823 are being obligated at time of award. The Space Systems Command, Military Communication and Positioning, Los Angeles Air Force Base, California, is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "Vane Line Bunkering LLC, Baltimore, Maryland (HTC71125CE120), has been awarded a firm-fixed-price contract with a face value of $11,863,942. This contract is to obtain transportation fuel by tug and barge between all ordered U.S. ports and points on the Atlantic and Gulf Coasts, and their connecting, inland, and coastal waterways and tributaries. The base period of performance is from Sep. 1, 2025, through Aug. 31, 2026. Working capital funds (Defense) will be obligated for fiscal 2025. The U.S. Transportation Command, Directorate of Acquisition, Scott Air Force Base, Illinois, is the contracting activity.",
    "contract_date": "2025-07-30"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-30"
  }
]