[
  {
    "text": "TRAX International Corp., Las Vegas, Nevada, was awarded a cost-plus-fixed-fee contract for test center support services. The amount of this action is $726,894,788. Bids were solicited via the internet with four received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 4, 2032. Army Mission and Installation Contracting Command, Fort Sam Houston, Texas, is the contracting activity (W51EW7-25-D-A002).",
    "contract_date": "2025-08-05"
  },
  {
    "text": "Atherton Construction LLC,* Henderson, Nevada, was awarded a firm-fixed-price contract for construction of a new qualification training range. The amount of this action is $15,604,564. Bids were solicited via the internet with two received. Work will be performed in Hawthorne, Nevada, with an estimated completion date of Dec. 8, 2026. Fiscal 2025 military construction, Army National Guard funds in the amount of $15,604,564 were obligated at the time of the award. U.S. Property and Fiscal Office, Nevada, is the contracting activity (W9124X-25-C-A001).",
    "contract_date": "2025-08-05"
  },
  {
    "text": "Great Lakes Dredge & Dock Corp. LLC, Houston, Texas, was awarded a firm-fixed-price contract for beach renourishment. The amount of this action is $8,712,500. Bids were solicited via the internet with three received. Work will be performed in Rehoboth Beach, Delaware, with an estimated completion date of Dec. 13, 2025. Fiscal 2022 civil construction funds in the amount of $8,712,500 were obligated at the time of the award. U.S. Army Corps of Engineers, Philadelphia, Pennsylvania, is the contracting activity (W912BU-25-C-A014).",
    "contract_date": "2025-08-05"
  },
  {
    "text": "The Dutra Group, San Rafael, California, was awarded a firm-fixed-price contract for berm construction and dredging. The amount of this action is $8,069,000. Bids were solicited via the internet with four received. Work will be performed in Concord, California, with an estimated completion date of Jan. 5, 2026. Fiscal 2025 military construction, Army funds in the amount of $8,069,000 were obligated at the time of the award. U.S. Army Corps of Engineers, San Francisco, California, is the contracting activity (W912P7-25-C-A015).",
    "contract_date": "2025-08-05"
  },
  {
    "text": "The county of Grand Forks, North Dakota, was awarded a modification to an existing indefinite-delivery/indefinite-quantity contract (HQ003424D009). The amount of this action is $102,873,404. No amount is being obligated at this time. The cumulative total of the contract is $121,979,717. The purpose of this contract is to provide Unmanned Aerial Systems (UAS) airspace operations technology and concept development support for the Office of the Under Secretary of Defense for Acquisition and Sustainment Unmanned Systems Office. This contract will execute simulated and/or live UAS events to address the technical, operational, and regulatory challenges associated with normalizing Department of Defense UAS operations. The work will be performed in Grand Forks, North Dakota. The estimated contract completion date is May 19, 2029. Washington Headquarter Services, Arlington, Virginia, is the contracting activity.",
    "contract_date": "2025-08-05"
  },
  {
    "text": "Seemann Composites LLC, Gulfport, Mississippi, is awarded a $62,000,000 cost-plus-fixed-fee indefinite-delivery/indefinite-quantity contract (N00167-25-D-0008) for the multi-material propellor prototype requirement. Work will be performed in Gulfport, Mississippi, with an ordering period up to five years. Fiscal 2025 research and development test and evaluation (Navy) funds in the amount of $32,090 will be obligated at time of award. The contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1). Federal Acquisition Regulation 6.302-1(a)(ii)(B). Naval Surface Warfare Center Carderock Division, West Bethesda, Maryland, is the contracting activity.",
    "contract_date": "2025-08-05"
  },
  {
    "text": "Huntington Ingalls Inc., Pascagoula, Mississippi, is awarded a $20,000,000 cost-plus-incentive-fee modification to previously awarded contract N00024-23-C-2324 for work associated with the DDG 1000 modernization period execution. Of this amount, $10,000,000 is currently committed for future execution by the Supervisor of Shipbuilding Gulf Coast Administrative Contracting Officer. Work will be performed in Pascagoula, Mississippi (95%); and other locations below 1% (collectively totaling 5%), and is expected to be completed by September 2025. No funding will be obligated at the time of award. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-05"
  },
  {
    "text": "CORRECTION: The $199,000,000 firm-fixed-price, cost-plus-fixed fee, indefinite-delivery/indefinite-quantity contract for the sustainment and refurbishment of waterborne security barriers, moorings, and marine facilities announced on July 23, 2025, had the wrong locations listed. The correction locations are: GPA Technologies Inc., Ventura, California (N00024-25-D-4141); Oceanetics Inc., Annapolis, Maryland (N00024-25-D-4142); PCCI Inc., Alexandria, Virginia (N00024-25-D-4143); and Virtual Computing Technology Inc., Solana Beach, California (N00024-25-D-4144).",
    "contract_date": "2025-08-05"
  },
  {
    "text": "Lockheed Martin Corp. Missiles and Fire Control, Dallas, Texas, is being awarded a $23,564,873 modification (P00106) to a previously awarded contract (HQ0147-17-C-0032) for the acquisition of the Terminal High Altitude Area Defense (THAAD) Configuration 3.1 Part B1 Ground Modernization equipment to support the U.S. government. The THAAD Configuration 3.1 Part B1, and associated labor, will be procured under a firm-fixed-price contract line item. The total value of this contract is increased from $10,416,783,858 to $10,440,348,731. The work will be performed in Dallas, Texas; Sunnyvale, California; Troy, Alabama; Huntsville, Alabama; and Camden, Arkansas, with an expected completion date Nov. 30, 2028. Fiscal 2025 procurement funds in the amount of $23,564,873 are being obligated at time of award. The Missile Defense Agency, Huntsville, Alabama, is the contracting activity.",
    "contract_date": "2025-08-05"
  },
  {
    "text": "MCP Computer Products Inc.,** San Marcos, California, is being awarded a delivery order (H9241524FE054) to a contract (47QTCA19D00ML) for Dell laptops, and associated equipment, with a delivery of 75 days after the date of the order. This is a firm-fixed-price order from blanket purchase agreement (BPA) 47QTCA22A000C with a value of $15,910,864 in support of U.S. Special Operations Command (USSOCOM). The BPA was solicited and issued using full and open after exclusion of sources, brand name or equal acquisition strategy; consideration was not restricted to any one vendor or brand. Fiscal 2025 operations and maintenance funds are being obligated at time of award. USSOCOM, MacDill Air Force Base, Florida, is the contracting activity.",
    "contract_date": "2025-08-05"
  },
  {
    "text": "CORRECTION: The contract announced on Aug. 1, 2025, to SJ Technologies Inc., Sugar Hill, Georgia (FA7014-25-F-0232), was announced with the incorrect award amount and completion date. The correct award amount is $8,797,214 with fiscal 2025 operations and maintenance appropriations in the amount of $1,529,408 obligated at the time of award. The correct completion date is Feb. 4, 2031 (includes a six-month extension).",
    "contract_date": "2025-08-05"
  },
  {
    "text": "*Small business** Woman-Owned Small Business",
    "contract_date": "2025-08-05"
  }
]