[
  {
    "text": "Acts Group Inc., Virginia Beach, Virginia (FA4419-25-D-0002); New Dominion Construction LLC, Dumfries, Virginia (FA4419-25-D-0003); COHO Construction Management LLC, Anchorage, Alaska (FA4419-25-D-0004); Marrero, Couvillion & Associates LLC, Baton Rouge, Louisiana (FA4419-25-D-0005); Gideon Red JV LLC, Kenner, Louisiana (FA4419-25-D-0006); and PAM WCI JV LLC, Midwest City, Oklahoma (FA4419-25-D-0007), were awarded a multi-year $95,000,000 indefinite-delivery/indefinite-quantity construction contract. This contract provides for a broad range of maintenance, repair, and minor construction projects on real property at Altus Air Force Base, Oklahoma; Vance AFB, Oklahoma; Sheppard AFB, Texas; and Ebbing Air National Guard Base, Arkansas, and is expected to be completed August 2030. This contract was a competitive acquisition with 14 offers received. Fiscal 2025 military construction funds in the total amount of $7,603,102 will be obligated at the time of award. The 97th Contracting Flight, Altus AFB, Oklahoma, is the contracting activity.",
    "contract_date": "2025-08-19"
  },
  {
    "text": "JE DUNN Construction Co., Kansas City, Missouri, has been awarded a $88,105,334 firm-fixed-price modification (P00018) to previously awarded (FA8903-19-C-0021) for repair of the Cadet Chapel at the Air Force Academy in Colorado Springs, Colorado.  The modification brings the total cumulative face value of the contract from $246,620,551 to $334,725,885. Work will be performed at the U.S. Air Force Academy, Colorado Springs, Colorado, and is expected to be completed by Nov. 13, 2028. Fiscal 2025 operations and maintenance appropriations funds in the amount of $88,105,334 are being obligated at the time of award. The 772nd Enterprise Sourcing Squadron, San Antonio, Texas, is the contracting activity.",
    "contract_date": "2025-08-19"
  },
  {
    "text": "Techni-Con Inc., Mangilao, Guam, was awarded a $7,995,000 firm-fixed-price contract to repair underground power. This contract provides for replacement of the underground electrical feeders, duct banks, switches, and transformers for the Munitions Storage Area, Andersen AFB, Guam. Work will be performed at Andersen Air Force Base, Guam, and is expected to be completed by March 22, 2027. This contract was a competitive acquisition, and nine offers were received. Fiscal 2025 operations and maintenance appropriation funds in the amount of $7,995,000 are being obligated at the time of award. The 36th Contracting Squadron, Andersen AFB, Guam, is the contracting activity (FA5240-24-D-0009 - FA5240-25-F-0112).",
    "contract_date": "2025-08-19"
  },
  {
    "text": "The Boeing Co., St. Louis, Missouri, is awarded a $22,319,015 firm-fixed-price order (N6134025F0004) against a previously issued basic ordering agreement (N0001921G0006). This order is to modify aircrew training devices and deliver the P-8A technical refresh digital video recording system solution. Work will be performed in Jacksonville, Florida (50%); Oak Harbor, Washington (30%); Edinburgh, Australia (15%); and Richardson, Texas (5%), and is expected to be completed in November 2027. Fiscal 2025 aircraft procurement (Navy) funds in the amount of $17,637,076 and Royal Australian Air Force funds in the amount of $4,681,939 will be obligated at the time of award, $17,637,076 of which will expire at the end of the current fiscal year. This order was not competed. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity.",
    "contract_date": "2025-08-19"
  },
  {
    "text": "General Dynamics Mission Systems, Manassas, Virginia, is awarded a $15,331,729 cost-plus-incentive fee, cost-plus-fixed fee, and cost only contract for shipset production, engineering, and installation support to perform software and hardware systems development, production, and platform installations. This contract includes options which, if exercised, would bring the cumulative value to $91,140,416. Work will be performed in Manassas, Virginia (30%); Groton, Connecticut (25%); Las Vegas, Nevada (25%); Port Orchard, Washington (10%); Chesapeake, Virginia (4%); Pearl Harbor, Hawaii (2%); San Diego, California (2%); and Kings Bay, Georgia (2%), and is expected to be completed by August 2026. If all options are exercised, work will continue through August 2030. Fiscal 2025 other procurement (Navy) funds in the amount of $999,715 (83%); and fiscal 2020 shipbuilding and conversion (Navy) funds in the amount of $208,306 (17%), will be obligated at time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured pursuant to 10 U.S. Code 3204(a)(5). Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-6260).",
    "contract_date": "2025-08-19"
  },
  {
    "text": "Orion Marine Construction, Tampa, Florida, was awarded a firm-fixed-price contract for maintenance dredging in the Galveston International Waterway. The amount of this action is $13,771,750, with a total cumulative face value of $21,992,750. Bids were solicited via the internet with four received. Work will be performed in Calhoun, Texas, with an estimated completion date of Jan. 19, 2026. Fiscal 2025 operation and maintenance, Army National Guard funds in the amount of $13,771,750 were obligated at the time of the award. U.S. Army Corps of Engineers, Galveston, Texas, is the contracting activity (W912HY-25-C-A001).",
    "contract_date": "2025-08-19"
  },
  {
    "text": "ACM Elite, Stevensville, Montana, has been awarded a maximum $9,999,999 firm-fixed-price, indefinite-quantity contract for B-52 aircraft engine hanger beams. This award is replacing contract SPE4A7-25-D-0297, which was previously announced as awarded July 18, 2025, to Infinity Fabrication. This was a competitive acquisition with two responses received. This is a five-year contract with no option periods. The performance completion date is Aug. 18, 2030. Using military service is Air Force. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation, Richmond, Virginia (SPE4A7-25-D-0333).",
    "contract_date": "2025-08-19"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-19"
  }
]