[
  {
    "text": "Active Deployment Systems, San Marcos, Texas (N00023-25-D-0091); Acuity International LLC, Reston, Virginia (N00023-25-D-0092); Apex Site Services,* Waxahachie, Texas (N00023-25-D-0093); Aspen Medical USA,* Washington, D.C. (N00023-25-D-0094); Aspetto Inc. ,* Fredericksburg, Virginia (N00023-25-D-0095); Asset Protection & Security Services LP, Corpus Christi, Texas (N00023-25-D-0096); ATCO Frontec USA, Houston, Texas (N00023-25-D-0097); Beachview Logistics US Inc., Brunswick, Georgia (N00023-25-D-0098); Big Jet LLC ,* Pittsburgh, Pennsylvania (N00023-25-D-0099); Bluewater Management Group, Chesapeake, Virginia (N00023-25-D-0100); CFK Services,* Milton, Florida (N00023-25-D-0101); Cherokee Nation Government Solutions LLC ,* Tulsa, Oklahoma (N00023-25-D-0102); Continuity Global Solutions, Port St. Joe, Florida (N00023-25-D-0103); CoreCivic Inc., Brentwood, Tennessee (N00023-25-D-0104); Cotton Commercial USA Inc., Katy, Texas (N00023-25-D-0105); Crisis Response Co. LLC, Southlake, Texas (N00023-25-D-0106); Critical Contingency Solutions LLC,* Wimberley, Texas (N00023-25-D-0107); Disaster Management Group LLC, Jupiter, Florida (N00023-25-D-0108); DKW Communications Inc.,* Washington, D.C. (N00023-25-D-0109); Dynamik Inc.,* San Diego, California (N00023-25-D-0110); Ecology Mir Group LLC,* Fairfax, Virginia (N00023-25-D-0111); EDS Holdco LLC, Lexington, Kentucky (N00023-25-D-0112); EEC-Lukos JV LLC,* Haines City, Florida (N00023-25-D-0113); EFS Ebrex Inc.,* Vienna, Virginia (N00023-25-D-0114); EGA Associates LLC,* Jeannette, Pennsylvania (N00023-25-D-0115); Environmental Chemical Corp., Burlingame, California (N00023-25-D-0116); Environmental Earth-Wise Inc.,* Baytown, Texas (N00023-25-D-0117); GenStrong LLC, Wilmington, North Carolina (N00023-25-D-0118); Gothams LLC, Austin, Texas (N00023-25-D-0119); Hikina 2 Komohana Consulting Inc. ,* Boulder, Colorado (N00023-25-D-0120); Industrial Tent Systems LLC, Houston, Texas (N00023-25-D-0121); InnoVis JV LLC,* Washington, D.C. (N00023-25-D-0122); Kastel Enterprises MK LLC,* Mobile, Alabama (N00023-25-D-0123); KPB Services LLC,* Holton, Kansas (N00023-25-D-0124); KTC Solutions LLC, Houston, Texas (N00023-25-D-0125); LEMOINE Disaster Recovery LLC, Lafayette, Louisiana (N00023-25-D-0126); MCS Government Services LLC, Lewisville, Texas (N00023-25-D-0127); Monmouth Solutions Inc.,* Lowell, Massachusetts (N00023-25-D-0128); Octagon Industries, Inc.,* San Antonio, Texas (N00023-25-D-0129); Parker Tide LLC,* Washington, D.C. (N00023-25-D-0130); Parsons Government Services Inc., Centreville, Virginia (N00023-25-D-0131); Pegasus Support Services LLC, Woodstock, Georgia (N00023-25-D-0132); Rapid Deployment Inc., Mobile, Alabama (N00023-25-D-0133); Recana Solutions LLC, Houston, Texas (N00023-25-D-0134); Responsive Deployment, LLC,* Mckinney, Texas (N00023-25-D-0135); Rockwell American Services Ltd.,* Terrebonne, Oregon (N00023-25-D-0136); Safety & Security International, Greensboro, North Carolina (N00023-25-D-0137); SAKOM Services WI LLC,* Shawano, Wisconsin (N00023-25-D-0138); SK2 LLC,* San Juan, Puerto Rico (N00023-25-D-0139); SLSCO Ltd., Galveston, Texas (N00023-25-D-0140); SOC LLC, Chantilly, Virginia (N00023-25-D-0141); SOS International LLC, Reston, Virginia (N00023-25-D-0142); Target Logistics Management LLC, The Woodlands, Texas (N00023-25-D-0143); Taylors International Services Inc., Lafayette, Louisiana (N00023-25-D-0144); Team Housing Solutions, New Braunfels, Texas (N00023-25-D-0145); Trigent Solutions Inc.,* Chantilly, Virginia (N00023-25-D-0146); Universal Protection Service LP, Conshohocken, Pennsylvania (N00023-25-D-0147); USA Up Star LLC, Greenwood, Indiana (N00023-25-D-0148); and Vision Quest Solutions Inc.,* Hot Springs, South Dakota (N00023-25-D-0149), are being awarded a $10,000,000,000 multiple award, firm-fixed-price, indefinite-delivery/indefinite-quantity, Worldwide Expeditionary Multiple Award Contract (WEXMAC), Territorial Integrity of the U.S. (TITUS) contract, that will provide supplies and services in support of, but not limited to, supporting the six phases of the continuum of military operations in support of the geographic Combatant Command's joint operations, coalition partners, and other U.S. federal agencies in setting and sustaining the theater through the following requirements: theater opening (includes reception, staging, onward-movement, and integration support; sustainment; theater distribution; and stability operations and Defense Support of Civil Authorities support. The WEXMAC TITUS description of contractual scope provides that services and supplies provided through the performance of this contract include, but are not limited to, humanitarian assistance/disaster relief, contingency, exercise, lodging, logistics, water-based, and land-based support. The contracts will run concurrently and will include a base performance period with one five-year option with individual requirements performed under task orders when specific dates and locations are identified. The base period will begin October 2025 and is expected to be completed by December 2029; if the option is exercised, the performance period will be completed by December 2034. Fiscal 2026 operations and funds in the amount of $29,500 will be obligated ($500 on each of the 59 contracts to fund the contracts' minimum amounts) and funds will not expire at the end of the current fiscal year. Additional funds will be obligated at the task order level with the appropriate fiscal year funding as issued by the customers for each area of responsibility. If the option period is exercised, the total estimated contract maximum for each contractor could be up to $20,000,000,000. Work will be performed in the U.S. and outlying territories outlined in the original contract. Due to the fact that the specific requirements cannot be predicted at this time, more specific information about the percentage and where the work will be performed cannot be currently provided. The requirement was competitively procured as full and open competition with 109 offers received; 59 new offerors, and 37 incumbent offerors, were found compliant and responsible and will receive modifications to their existing contracts. Naval Supply Systems Command, Mechanicsburg, Pennsylvania, is the contracting activity.",
    "contract_date": "2025-09-04"
  },
  {
    "text": "Acquisition Logistics LLC,* Clint, Texas (N00023-25-D-0004); Amentum Services Inc., Chantilly, Virginia (N00023-25-D-0009); Amstability LLC,* Alexandria, Virginia (N00023-25-D-0011); Anglicotech LLC,* Arlington, Virginia (N00023-25-D-0012); Atlantic Diving Supply Inc., Virginia Beach, Virginia (N00023-25-D-0013); Centerra Group LLC, Herndon, Virginia (N00023-25-D-0016); Culmen International LLC, Alexandria, Virginia (N00023-25-D-0019); Da Defense Logistics HQ,* El Paso, Texas (N00023-25-D-0020); Delta Vector USA LLC,* Texas City, Texas (N00023-25-D-0023); Deployed Resources LLC, Rome, New York (N00023-25-D-0025); GardaWorld Federal Services, LLC, Arlington, Virginia (N00023-25-D-0032); Gemini Tech Services,* Willow Park, Texas (N00023-25-D-0034); Greenlight Group LLC,* Destin, Florida (N00023-25-D-0036); CBRE Government & Defense Services, McLean, Virginia (N00023-25-D-0044); KBR Services, LLC, Houston, Texas (N00023-25-D-0046); KUOG Corp.,* Huntsville, Alabama (N00023-25-D-0047); KVG LLC, Gettysburg, Pennsylvania (N00023-25-D-0048); Lee Eng & Construction Inc.,* Houston, Texas (N00023-25-D-0049); Loyal Source Government Services LLC, Orlando, Florida (N00023-25-D-0052); Lukos LLC, Tampa, Florida (N00023-25-D-0053); Maginot Support Services,* Flower Mound, Texas (N00023-25-D-0054); MLSUSA Corp., East Longmeadow, Massachusetts (N00023-25-D-0058); Noble Supply & Logistics LLC, Boston, Massachusetts (N00023-25-D-0064); Obera LLC,* Herndon, Virginia (N00023-25-D-0065); Pacific Defense Contracting LLC,* Bangor, Maine (N00023-25-D-0068); Palladium International LLC, Washington, D.C. (N00023-25-D-0069); Red Orange North America Inc. ,* Fort Washington, Pennsylvania (N00023-25-D-0073); Relyant Global LLC, Maryville, Tennessee (N00023-25-D-0074); Response AI Solutions LLC,* Great Falls, Virginia (N00023-25-D-0075); RMGS-Berger, a JV LLC, Virginia Beach, Virginia (N00023-25-D-0077); TechTrans International Inc., Houston, Texas (N00023-25-D-0081); Terrestris LLC,* Dumfries, Virginia (N00023-25-D-0082); Trailer Bridge Inc., Jacksonville, Florida (N00023-25-D-0084); US21 Inc., Fairfax, Virginia (N00023-25-D-0085); Vectrus Systems LLC, also known as V2X, Colorado Springs, Colorado (N00023-25-D-0086); Waypoint LLC,* Lead, South Dakota (N00023-25-D-0087); and Weston Trolley Co. LLC,* Dearborn, Missouri (N00023-25-D-0088), contracts are being modified to increase their base period contract ceiling in the amount of $10,000,000,000 to support Worldwide Expeditionary Multiple Award Contract (WEXMAC) Territorial Integrity of the U.S. (TITUS). WEXMAC TITUS will provide supplies and services in support of but not limited to supporting the six phases of the continuum of military operations in support of the geographic Combatant Command's joint operations, coalition partners, and other U.S. federal agencies in setting and sustaining the theater through the following requirements: theater opening (includes reception, staging, onward-movement, and integration support; sustainment; theater distribution; and stability operations and Defense Support of Civil Authorities support. The WEXMAC TITUS description of contractual scope provides that services and supplies provided through the performance of this contract include but are not limited to humanitarian assistance/disaster relief, contingency, exercise, lodging, logistics, water-based, and land-based support. The base period began in January 2025 and is expected to be completed by December 2029; if all options are exercised, the performance period will be completed by December 2034. The increased contract ceiling modifications will be incorporated into the contractors' existing base performance period with one five-year option with individual requirements performed under task orders when specific dates and locations are identified. If the option period is exercised, the total estimated contract maximum for each contractor could be $20,000,000,000. Work will be performed in the U.S. and outlying territories outlined in the original contract. Due to the fact that the specific requirements cannot be predicted at this time, more specific information about the percentage and where the work will be performed cannot be currently provided. Due to the minimum guarantee already being fulfilled, no funding will be obligated for these modifications. Additional funds will be obligated at the task order level with the appropriate fiscal year funding as issued by the customers for each area of responsibility. The requirement was competitively procured as full and open competition with 109 offers received; 59 new offerors, and 37 incumbent offerors, were found compliant and responsible, and will receive modifications to their existing contracts. Naval Supply Systems Command, Mechanicsburg, Pennsylvania, is the contracting activity.",
    "contract_date": "2025-09-04"
  },
  {
    "text": "Paradigm Mechanical Corp.,** Santee, California, is awarded a $99,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for commercial and institutional building construction projects at various locations within the Marine Corps Base Camp Pendleton and Naval Weapons Station Seal Beach areas of responsibility. The work to be performed provides for the construction, renovation, and repair of commercial and institutional building construction projects. All work will be performed in California and is expected to be completed by Sept. 3, 2033. Fiscal 2025 operation and maintenance, Navy funds in the amount of $5,000 will be obligated at the time of award to satisfy the minimum guarantee, and funds in the amount of $5,000 will expire at the end of the current fiscal year. This contract was competitively procured via the SAM.gov Contract Opportunities website as a Small Business set-aside with six offers received. The Naval Facilities Engineering Systems Command, Southwest, San Diego, California, is the contracting activity (N62473-25-D-2701).",
    "contract_date": "2025-09-04"
  },
  {
    "text": "Raytheon Technologies, Raytheon Missiles and Defense, Tucson, Arizona, is awarded a not-to exceed $95,709,783 firm-fixed-price undefinitized contract modification (P00004) for the procurement of 382 navigation and communications antenna hardware kits for tactical Tomahawk all up round recertification and 350 units for production. The procurement includes 344 for the Navy; 55 for the Army; 43 for the Marine Corps and 290 for various Foreign Military Sales (FMS) countries. Work will be performed in Boulder, Colorado (68%); Tucson, Arizona (25%); Carrollton, Texas (3%); Ontario, Canada (1%); Rocky Hill, Connecticut (1%); Valencia, California (1%); and Longmont, Colorado (1%), and is expected to be completed in April 2029. Fiscal 2024 missile procurement (Army) funds in the amount of $248,024; fiscal 2024 procurement (Marine Corps) funds in the amount of $204,428; fiscal 2024 weapon procurement (Navy) funds in the amount of $2,281,417; fiscal 2025 missile procurement (Army) funds in the amount of $206,687; fiscal 2025 procurement (Marine Corps) funds in the amount of $147,188; fiscal 2025 weapon procurement (Navy) funds in the amount of $1,005,786; and FMS funds in the amount of $2,371,366 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity (N0001925C0071).",
    "contract_date": "2025-09-04"
  },
  {
    "text": "FITT Scientific LLC, Colonial Heights, Virginia, was awarded a $35,000,000 indefinite-delivery/indefinite-quantity contract for professional support services supporting expeditionary operations and programs. Work will be performed in Naval Facilities Engineering Systems Command (NAVFAC) Atlantic and NAVFAC Pacific area of responsibility. The contract is for one base year and four one-year option periods, not to exceed a total of 60 months. The maximum dollar value, including the base period and four option years, is $35,000,000. Fiscal 2025 funds in the amount of $687,444. This contract was a competitively procured, small business set-aside solicited via the sam.gov website, with four offers received. The Naval Facilities Engineering Systems Command, Atlantic Norfolk, Virginia, is the contracting activity (N6247025D0009).",
    "contract_date": "2025-09-04"
  },
  {
    "text": "Epsilon Systems Solutions Inc., Portsmouth, Virginia; and PCCI Inc. Alexandria, Virginia, are awarded a combined $25,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity, multiple-award contract for services in support of hyperbaric unmanned testing facilities. Work will be performed at various shore-based locations worldwide and is expected to be completed by March 2031. The maximum dollar value, including the base period and one option period, is $25,000,000. A minimum guarantee of $10,000 will be funded for each contract with fiscal 2025 Navy working capital funds as the first task on each of the basic contracts until the first actual task order is awarded. Future task orders will be primarily funded by other procurement, Navy funds. Based on specific requirements of the task order, some requirements may also be funded with operations and maintenance; Navy; or research, development, test, and evaluation funds. This contract was competitively procured via SAM.gov website with two offers received. These two contractors may compete for task orders under the terms and conditions of the awarded contract. Naval Facilities Engineering and Expeditionary Warfare Center, Port Hueneme, California, is the contracting activity (N39430-25-D-2036 and N39430-25-D-2037).",
    "contract_date": "2025-09-04"
  },
  {
    "text": "BAE Systems Norfolk Ship Repair Inc., Norfolk, Virginia, is awarded a $24,361,392 cost-plus-award-fee contract for the accomplishment of a Post Shakedown Availability for USS Harvey Barnum Jr. (DDG 124), with option for the accomplishment of a PSA for USS Patrick Gallagher (DDG 127). This contract includes options which, if exercised, would bring the cumulative value of this contract to $48,722,784. Work will be performed in Norfolk, Virginia, and is expected to be completed by January 2027. If all options are exercised, work will continue through September 2027. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $13,503,570 (59%); fiscal 2016 shipbuilding and conversion (Navy) funds in the amount of $6,606,284 (29%); and fiscal 2024 shipbuilding and conversion (Navy) funds in the amount of $2,710,866 (12%), will be obligated at time of award and will not expire at the end of the current fiscal year. This contract was competitively procured via the sam.gov website, with one offer received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-2301).",
    "contract_date": "2025-09-04"
  },
  {
    "text": "Huntington-Ingalls Industries-Ingalls Shipbuilding, Pascagoula, Mississippi, is awarded a not-to-exceed $15,286,013 fixed-price incentive, un-definitized change order modification to a previously awarded contract (N00024-20-C-2437) to update consolidated afloat networks and enterprise services baseline to HW2.0 AN/USQ-208C(V)7 and other associated Command, Control, Communications, Computers, and Intelligence system updates in support of Engineering Change Proposal 9AN007 on the future USS Fallujah (LHA 9). Work will be performed in Pascagoula, Mississippi, and is expected to be completed by September 2029. Fiscal 2023 shipbuilding and conversion (Navy) funds in the amount of $6,716,119 (50%) will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-04"
  },
  {
    "text": "General Atomics Aeronautical Systems Inc., Poway, California, is awarded a $7,894,266 modification (P00003) to a firm-fixed-price, cost-plus-fixed-fee order (N0001924F5559) against a previously issued basic ordering agreement (N0001922G0006). This modification exercises options to procure additional three electronic warfare aircraft a-kits, as well as to provide systems engineering support in support of the Marine Air Ground Task Force Unmanned Expeditionary Medium Altitude Long Endurance program for the Navy and Marine Corps. Work will be performed in Poway, California (50%); and Greenville, Texas (50%), and is expected to be completed by September 2027. Fiscal 2025 aircraft procurement (Navy) funds in the amount of $7,894,266 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-04"
  },
  {
    "text": "The Boeing Co., Mesa, Arizona, was awarded a $44,892,264 modification (P00030) to contract W58RGZ-21-C-0015 for the remanufacture of Apache AH-64E aircraft and a Longbow Crew Trainer. The modification brings the total cumulative face value of the contract to $3,110,603,313. Work will be performed in Mesa, Arizona, with an estimated completion date of Dec. 31, 2028. Fiscal 2025 Foreign Military Sales (Egypt) funds in the amount of $44,892,264 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-09-04"
  },
  {
    "text": "Range Generation Next LLC, Sterling, Virginia, was awarded a $13,829,951 modification (P00028) to contract W9113M-23-C-0062 for Reagan Test Site Engineering and Technical Services. The modification brings the total cumulative face value of the contract to $546,696,690. Work will be performed in Huntsville, Alabama, with an estimated completion date of Oct. 1, 2028. Fiscal 2010 research, development, test, and evaluation, Army funds in the amount of $13,829,951 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-09-04"
  },
  {
    "text": "CORRECTION: The $14,853,953 modification (P00007) to contract W911W6-21-C-0041 announced on Sept. 3, 2025, to Fulcrum Concepts LLC, Mattaponi, Virginia, for the Modular Effects Launcher Phase III, was announced with the incorrect funding information and award date. Fiscal 2025 research, development, test, and evaluation, Army funds were obligated at the time of the award, and it was actually awarded Sept. 4, 2025.",
    "contract_date": "2025-09-04"
  },
  {
    "text": "CORRECTION: The $9,009,859 firm-fixed-price contract (W912DY-25-F-0323) announced on Sept. 3, 2025, to Dickson Furniture Manufacturers LLC, Houston, Texas, for the procurement and installation of replacement case goods under the Centralized Furnishings Program, was announced with the incorrect funding information. Fiscal 2025 procurement, defense-wide funds in the amount of $9,009,859 were actually obligated at the time of the award.",
    "contract_date": "2025-09-04"
  },
  {
    "text": "Tutulu LLC,*** Centennial, Colorado, has been awarded a time-and-materials contract in the amount of $22,875,102 for advisory and assistance services. This contract provides for contracting and functional support associated with the entire acquisition lifecycle framework for the Space Rapid Capabilities Office. Work will be performed primarily in Albuquerque, New Mexico, with an expected completion date of Oct. 14, 2030. This award is the result of a competitive 8(a) acquisition, and 13 offers were received in response to the solicitation. Fiscal 2025 research, development, test and evaluation funds in the amount of $13,000,000 are being obligated at the time of award. The Space Rapid Capabilities Office, Kirtland Air Force Base, New Mexico, is the contracting activity (FA254825CB002).",
    "contract_date": "2025-09-04"
  },
  {
    "text": "Atec Inc., Stafford, Texas, has been awarded a $11,850,749 for the upgrade to the Royal Jordanian Air Force F100 Test Cell. This contract provides the upgrade of the current RJAF F100 Test Cell to have a dual capability to test the F100-PW-220E and the F110-GE-129 engines. The location of performance is at Muwaffaq Salti Air Base, Azraq, Jordan. The work is expected to be complete by Sept. 1, 2027. This contract involves foreign military sales to Jordan. This award is the result of a sole source acquisition and only one offer was received. Fiscal 2025 Foreign Military Sales funds in the amount of $11,850,749 are being obligated at the time of award. The Propulsion Sustainment Section, Tinker Air Force Base, Oklahoma, is the contracting activity (FA812425CB004).",
    "contract_date": "2025-09-04"
  },
  {
    "text": "*Small business** Women-Owned Small Business***8(a) Program Participant",
    "contract_date": "2025-09-04"
  }
]