[
  {
    "text": "TOTE Services Inc., Jacksonville, Florida, is being awarded a $311,412,239 firm-fixed-price contract (N3220525C4020) inclusive of pass-through elements for the operation and maintenance of Sea-Based X-Band Radar Platform (SBX-1). The vessel is operated for the Missile Defense Agency to provide limited test support services and is a contingency component of the Ground Based Mid-Course Defense element of the Ballistic Missile Defense System for the U.S. Strategic Command. This contract contains a 12-month base period with four 12-month option periods and one 6-month option period under Federal Acquisition Regulation 52.217-8. The contract will be performed on a worldwide basis beginning Oct. 1, 2025, and will conclude March 31, 2031, if all options are exercised. This contract was solicited using full and open competition, via the Government Point of Entry website and one proposal was received. Military Sealift Command, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Huntington Ingalls Inc., Newport News, Virginia, is awarded a $276,131,707 cost-plus- incentive-fee and cost-plus-fixed-fee modification to a previously awarded contract (N00024-24-C-2106) for additional advance planning effort and long-lead-time material required for the accomplishment of the USS Harry S. Truman (CVN 75) Refueling Complex Overhaul. Work will be performed in Newport News, Virginia, and is expected to be completed by September 2026. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $65,000,000 will be obligated at the time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Galvion Technologies LLC,* Portsmouth, New Hampshire, was awarded a $131,396,295 firm-fixed-price indefinite-delivery/indefinite-quantity contract for the Integrated Helmet System. This contract provides for the procurement of Integrated Helmet System with associated components and accessories. The ordering period will be a maximum of five years and is expected to be completed in August 2030. Work will be performed in Portsmouth, New Hampshire. No funds will be obligated at time of award. Funds will be obligated on individual task/delivery orders as they are issued. The requirement was procured under the authority of 10 U.S. Code 4022(f) as a follow-on agreement to the prototype agreement (M67854-20-9-1001). Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-D-5300).",
    "contract_date": "2025-08-08"
  },
  {
    "text": "BAE Systems – San Diego Ship Repair, San Diego, California, was awarded a $64,116,819 firm-fixed-price contract action for maintenance, modernization and repair of USS O'Kane (DDG 77) fiscal 2026 docking selected restricted availability. The scope of this acquisition includes all labor, supervision, equipment, production, testing, facilities, and quality assurance necessary to prepare for and accomplish the Chief of Naval Operations Availability for critical modernization, maintenance, and repair programs. This contract includes options, which, if exercised, would bring the cumulative value of this contract to $68,483,520. Work will be performed in San Diego, California, and is expected to be completed by January 2027. Fiscal 2025 other procurement (Navy) funds in the amount of $64,322,679; and fiscal 2025 operation and maintenance (Navy) funds in the amount of $11,442, will be obligated at the time of award, of which $11,442 will expire at the end of the current fiscal year. This contract was competitively solicited using full and open competition via the System for Award Management website, with four offers received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N0002425C4406). (Awarded on Aug. 7, 2025)",
    "contract_date": "2025-08-08"
  },
  {
    "text": "CACI, Inc. – Federal, Chantilly, Virginia, is being awarded a $62,490,208 modification (P00020) to a previously awarded indefinite delivery/indefinite-quantity contract (M67854-19-D-7614). This modification will increase the contract ceiling amount by $62,490,208 from $249,960,831 to $312,451,039. This increase will allow continued Post Deployment System support services including service management, service operations; production and pre-production system sustainment; solution development environment; enterprise training and training devices; product lifecycle support; and service transition for change requests, engineering change proposals, and reduction of reports, interfaces, customizations, and extensions; and potential tasks to support Global Combat Support System – Marine Corps future initiatives under the existing contract. The current ordering period of the contract ends Dec. 25, 2026. Work will be performed in Stafford, Virginia (90%); Kansas City, Missouri (5%); and other locations (5%), and is expected to be complete in December 2026. No funds will be obligated at time of award. Funds will be obligated on individual task orders as they are issued. This action was not competitively procured pursuant to Federal Acquisition Regulation 6.302-1. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-19-D-7614).",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Bristol Design Build Services LLC, Anchorage, Alaska (N69450-21-D-0064); HGL Construction Inc., Oklahoma City, Oklahoma (N69450-21-D-0065); Klutina River Contractors, Irvine, California (N69450-21-D-0066); PacWest-Korte JV, Temecula, California (N69450-21-D-0067); The Clement Group LLC, Montgomery, Alabama (N69450-21-D-0068); VHB LLC, Boyds, Maryland (N69450-21-D-0069); Walga Ross Group 3 JV, Joplin, Missouri (N69450-21-D-0070); EMR Inc., Niceville, Florida (N69450-22-D-0025); and Tybe-Garney Federal JV LLC, Newbern, Tennessee (N69450-22-D-0026), are awarded a combined-maximum-value $58,000,000 firm-fixed-price modification to increase the capacity of their respective, previously-awarded contracts for general building type projects. Award of this modification brings the total cumulative value for all nine contracts combined to $307,000,000. Work will be performed in Florida (67%) and Tennessee (33%) and is expected to be completed by September 2026. No funds will be obligated at time of award. The Naval Facilities Engineering Systems Command Southeast, Jacksonville, Florida, is the contracting activity.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Marinette Marine Corp., Marinette, Wisconsin, is awarded a $43,114,274 cost-plus-fixed-fee and cost-only modification to previously awarded contract (N00024-20-C-2300) to exercise the option and provide funding for engineering and class design support for the Constellation-class Guided Missile Frigate. Work will be performed in Camden, New Jersey (42%); Arlington, Virginia (30%); Millersville, Maryland (9%); Marinette, Wisconsin (5%); Annapolis, Maryland (2%); Hanover, Maryland (2%); Walpole, Massachusetts (1%); Mobile, Alabama (1%); Evans, Georgia (1%); Segrate, Italy (1%); Rome, Italy (1%); Mathews, Louisiana (1%); Hauppauge, New York (1%); Columbus, Ohio (1%); Allentown, Pennsylvania (1%); and Arvonia, Virginia (1%), and is expected to be completed by August 2026. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $2,500,000 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Innovatus Technology Consulting,* San Diego, California, is awarded a $20,257,747 cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity modification to a previously issued contract (N6600122D0009). This modification provides for software and system engineering, design, development, configuration, integration, testing and life-cycle support services that are needed to support the Business Management Corporation Remedy Information Technology Service Management Enterprise System at Naval Information Warfare Center (NIWC) Pacific. Place of performance will be determined at task order level. Work is expected to be completed in August 2030. No funds will be obligated at the time of award. Funds will be obligated on individual task orders as they are issued. NIWC Pacific, San Diego, California, is the contracting activity.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Northrop Grumman Systems Corp., Mission Systems Sector, Linthicum Heights, Maryland, is awarded a $18,537,253 cost-plus-fixed-fee modification to the previously awarded contract (N00024-22-C-5520) to exercise an option for design agent engineering of Surface Electronic Warfare Improvement Program Block 3 systems. Work will be performed in Baltimore, Maryland (55%); Tampa, Florida (6%); Andover, Massachusetts (5%); Chelmsford, Massachusetts (4%); Rochester, New York (3%); San Diego, California (3%); Los Angeles, California (2%); Winona, Minnesota (2%); Stafford Springs, Connecticut (2%); Glendale, Arizona (1%); Nashua, New Hampshire (1%); Elk Grove Village, Illinois (1%); White Marsh, Maryland (1%); Tucson, Arizona (1%); Chandler, Arizona (1%); Washington, North Carolina (1%); Woodridge, Illinois (1%); Richardson, Texas (1%); Minneapolis, Minnesota (1%); El Cajon, California (1%); Hiawatha, Iowa (1%); Littleton, Colorado (1%); Glendale, California (1%); and miscellaneous locations - each less than 1% (4%), and is expected to be completed by August 2026. Fiscal 2025 other procurement (Navy) funds in the amount of $1,725,263 (36%); fiscal 2025 operations and maintenance (Navy) funds in the amount of $3,080,909 (64%); and fiscal 2025 research, development, testing and evaluation funds in the amount of $14,029 (<1%), will be obligated at time of award. The $3,080,909 (64%), fiscal 2025 operations and maintenance (Navy) funds are expiring funds and will be invoking the 10 U.S. Code 3133 Authority. The Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Lockheed Martin, Rotary and Mission Systems, Moorestown, New Jersey, is awarded a $18,601,447 cost-plus-incentive-fee and cost type modification to a previously awarded contract (N00024-23-C-5101) to integrate and test one Engineering Development Model of fully functional AN/SPY-7(v)3 radar system. This contract involves Foreign Military Sales (FMS) to the government of Canada. Work will be performed in Moorestown, New Jersey and is expected to be completed by December 2027. FMS (Canada) funds in the amount of $18,601,447 will be obligated at the time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "M.C. Dean Inc., Tysons, Virginia, is awarded a $15,566,212 firm-fixed-price contract for the construction of a secure working area in the renovated P-8A operations & fleet support facilities at Keflavik Air Station, Iceland. Work will be performed in Keflavik, Iceland and is expected to be completed by October 2027. Fiscal 2025 operations and maintenance (Navy) contract funds in the amount of $15,566,212 are obligated on this award and will expire at the end of the current fiscal year. This contract was competitively procured via the Solicitation Module in the Procurement Integrated Enterprise Environment, with four proposals received. The Naval Facilities Engineering Systems Command, Europe Africa Central, Naples, Italy, is the contracting activity (N33191-25-C-6008).",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Continental Maritime of San Diego LLC, San Diego, California, was awarded a $573,412 firm-fixed-price contract action for maintenance, modernization and repair of USS Pearl Harbor (LSD 52) fiscal 2026 Docking Selected Restricted Availability. This contract includes options, which, if exercised, would bring the cumulative value of this contract to $112,669,566. The scope of this acquisition includes all labor, supervision, equipment, production, testing, and quality assurance necessary to prepare for and accomplish the Chief of Naval Operations Availability for critical modernization, maintenance, and repair programs. Work will be performed in San Diego, California, and is expected to be completed by June 2027. Fiscal 2025 other procurement, (Navy) funds in the amount of $573,412 will be obligated at the time of award, of which none of the funding will expire at the end of the current fiscal year. This contract was competitively procured using full and open competition via the System for Award Management website, with four offers received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N0002425C4419). (Awarded on Aug. 7, 2025)",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Ameriqual Group LLC, doing business as Ameriqual Packaging, Evansville, Indiana (SPE3S1-25-D-Z205, $221,062,100); and Baxters North America Inc., doing business as The Wornick Co., Cincinnati, Ohio (SPE3S1-25-D-Z206, $25,308,625), have each been awarded a fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract under solicitation SPE3S1-22-R-0012 for unitized group ration-A modules. This was a competitive acquisition with three responses received. These are five-year contracts with no option periods. The ordering period end date is Aug. 7, 2030. Using military service is Army. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "CORRECTION: The contract announced on Aug. 1, 2025, for The Source Group Inc., Signal Hill, California (SPE603-25-D-5003), for $26,513,566 was announced with an incorrect award date. The correct award date is Aug. 6, 2025. The contracting activity is the Defense Logistics Agency Energy, Fort Belvoir, Virginia.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Intellisense Systems Inc., Torrance, California, was awarded a $58,000,000 indefinite-delivery/indefinite-quantity, firm-fixed-price contract, for the sustainment and procurement for the Advanced Micro Weather Station (AMWS) and Integrated Weather Observation System (IWOS) for the Expeditionary Weather Program. This contract provides contractor logistics support and procurement of the IWOS and AMWS to sustain the currently fielded ExMet systems, observation, forecast, modeling, imagery, and computational solutioned developed and fielded for the ExMet Program. Work will be performed at Torrance, California, and is expected to be completed by Aug. 12, 2030. This contract was a Small Business Innovation Research Phase III sole source acquisition. Fiscal 2025 operations and maintenance appropriations funds in the amount of $1,942,941 will be obligated on the first task order. The Air Force Life Cycle Management Center, Hanscom Air Force Base, Massachusetts, is the contracting activity (FA2330-25-D-B001).",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Razor Consulting Solutions Inc., Watford City, North Dakota (FA4600-25-D-0002); MCL-MRK VII LLC, La Vista, Nebraska (FA4600-25-D-0003); Matai Services LLC, Kansas City, Missouri (FA4600-25-D-0004); Infinite Energy Construction Inc., Kansas City, Missouri (FA4600-25-D-0005); Shekar Engineering P.L.C., Des Moines, Iowa (FA4600-25-D-0006); Elkhorn West Construction Inc., Omaha, Nebraska (FA4600-25-D-0007); MDM Construction LLC, West Fargo, North Dakota (FA4600-25-D-0008); and Leisnoi Professional Services LLC, Kodiak, Alaska (FA4600-25-D-0009), were awarded ceiling $49,999,999 firm-fixed-price, multiple award, construction contract. This provides for general construction projects. Work will be performed at Offutt Air Force Base, Nebraska, as is expected to be completed on July 30, 2030. These contracts were competitive acquisitions and 24 offers were received. Fiscal 2025 operational and maintenance appropriations funds in the amount of $478,298 are being obligated at time of award. The 55th Contracting Squadron, Offutt AFB, Nebraska, is the contracting activity. (Awarded Aug. 1, 2025)",
    "contract_date": "2025-08-08"
  },
  {
    "text": "City Light and Power JBLM LLC, Greenwood Village, Colorado, was awarded a $33,506,686 firm-fixed-price contract with a cumulative total face value of $34,860,907 for construction of a microgrid. Bids were solicited via the internet with one received. Work will be performed at Joint Base Lewis-McChord, Washington, with an estimated completion date of Aug. 27, 2029. Fiscal 2025 military construction, defense-wide funds in the amount of $33,506,686 were obligated at the time of the award. U.S. Army Corps of Engineers, Louisville, Kentucky, is the contracting activity (W912QR-25-C-A018).",
    "contract_date": "2025-08-08"
  },
  {
    "text": "Carbon 9 Defense LLC, Annapolis Junction, Maryland, was awarded a $9,654,861 firm-fixed price order for Splunk products (N6600120A0022) for a period of 12 months. U.S. Special Operations Command, MacDill Air Force Base, Florida, is the contracting activity.",
    "contract_date": "2025-08-08"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-08"
  }
]