[
  {
    "text": "Vertex Aerospace LLC, Madison Mississippi, was awarded a maximum $4,322,844,989 value, indefinite-delivery/indefinite-quantity contract for the contractor operated and maintained supply service contract for the T-6 aircraft. This contract provides support for safe flyable aircraft to meet users' daily flight schedule and depot requirements consistent with Department of Defense and commercial sector best practices in procuring, producing, and delivering products and services to customers. Work will be performed at a variety of military bases across the continental U.S., and is expected to be completed by July 31, 2034. This contract was a competitive source selection with three offers received. Fiscal 2025 operation and maintenance funds in the amount of $5,324,080 are being obligated at the time of award. The Air Force Life Cycle Management Center, Tinker Air Force Base, Oklahoma, is the contracting activity (FA8106-25-D-B002).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Lockheed Martin Missiles and Fire Control, Orlando, Florida, has been awarded a $4,288,108,296 firm-fixed-price definitization modification (PZ0007) to a previously awarded contract (FA8682-24-C-B001) for the Joint Air-To-Surface Standoff Missile (JASSM) and Long-Range, Anti-Ship Missile (LRASM) large lot procurement for JASSM Lots 22-26 and LRASM Lots 9-12. This modification brings the total cumulative face value of the contract to $9,485,190,471. Work will be performed at Orlando, Florida; and Troy, Alabama, and is expected to be completed by Jan. 31, 2033. This contract action involves Foreign Military Sales (FMS) to Poland, Netherlands, Japan, and Finland. Fiscal 2023 (Air Force) missiles procurement funds in the amount $3,015,000; Fiscal 2024 (Air Force) missiles procurement funds in the amount of $634,523,930; fiscal 2025 (Air Force) missiles procurement funds in the amount of $418,007,325; fiscal 2025 (Air Force) research, development, test and evaluation funds in the amount of $7,944,999; fiscal 2024 (Navy) weapons procurement funds in the amount of $60,524,996; fiscal 2025 (Navy) weapons procurement funds in the amount of $44,349,985; and FMS funds in the amount of $238,899,984, are being obligated at time of award. The Air Force Life Cycle Management Center, Eglin Air Force Base, Florida, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Raytheon, Division of Raytheon Technologies Corp., Tucson, Arizona, was awarded a not-to-exceed $3,500,000,000 firm-fixed-price incentive, undefinitized contract action for Advanced Medium Range Air-to-Air Missile (AMRAAM) Production Lots 39 and 40. This contract provides for the production of AMRAAM missiles, AMRAAM Telemetry System, initial and field spares, and other production engineering support activities. This contract involves Foreign Military Sales (FMS) to: Denmark, Belgium, Japan, Netherlands, Canada, Finland, Germany, Hungary, Spain, Poland, Sweden, Taiwan, Lithuania, the United Kingdom, Australia, Switzerland, Ukraine, Isreal, and Kuwait. Work will be performed in Tucson, Arizona, and is expected to be completed in the third quarter of fiscal 2031. This contract was a sole source acquisition. Fiscal 2024 Navy weapons procurement funds in the amount of  $113,000,000; fiscal 2025 Navy weapons procurement funds in the amount of  $190,000,000; fiscal 2023 Air Force missile procurement funds in the amount of $1,300,000; fiscal 2024 Air Force missile procurement funds in the amount of $116,000,000; fiscal 2025 Air Force missile procurement funds in the amount of $472,000,000; fiscal 2025 Air Force research, development, test and evaluation funds in the amount of $507,000; fiscal 2024 Air Force operation and maintenance funds in the amount of $253,936; and FMS funds in the amount of  $621,000,000, are being obligated at the time of award. The Air Force Life Cycle Management Center, Air Dominance Division Contracting Office, Eglin Air Force Base, Florida, is the contracting activity. (FA8659-25-C-B003)",
    "contract_date": "2025-07-31"
  },
  {
    "text": "The University of Dayton Research Institute, Dayton, Ohio, was awarded a $98,500,000 cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract for counter-targeting enhancement research. This contract provides for the advancement and maturation of promising technologies for intelligence, surveillance and reconnaissance (ISR), and counter-targeting/counter-ISR. Work will be performed at Dayton, Ohio, and is expected to be completed July 31, 2030. This contract was a competitive acquisition and one offer was received. An initial task order totaling $22,700,000 will be awarded concurrently. Fiscal 2025 research, development, test and evaluation funds in the amount of are being obligated to the task order at the time of award. The Air Force Research Laboratory Wright Research Site, Wright-Patterson Air Force Base, Ohio, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "The Boeing Co., Oklahoma City, Oklahoma, has been awarded a $79,349,247 option modification (P00009) to a previously awarded contract (FA8105-23-D-0002) for KC-135 engineering sustainment support. The modification brings the total cumulative face value of the contract to $154,538,133. Work will be performed at Oklahoma City, Oklahoma; San Antonio, Texas; Huntsville, Alabama; Houston, Texas; Pleasanton, California; Long Beach, California; Mesa, Arizona; Tukwila, Washington; St. Louis, Missouri; Fort Walton Beach, Florida; and Vancouver, Canada, and is expected to be complete by June 30, 2033. This modification involves unclassified Foreign Military Sales to Chile, France, and Turkey. Fiscal 2025 operations and maintenance appropriation funds in the estimated amount of $21,200,000 are being obligated at the time of award. The Air Force Life Cycle Management Center, Tinker Air Force Base, Oklahoma, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Montana State University, Bozeman, Montana, was awarded a $31,518,010 cost-type contract for Expand Q-CORE. This contract provides for expanding the capabilities of applied quantum capacity, operational resilience, and regional equity test-bed facility to include heterogeneous entanglement capabilities, to further foster a collaborative industry-facing workforce development program, including a hands-on training facility, exploring fidelity definitions and processes, benchmarking in partnership with the Quantum Economic Development Consortium, and establishing an accelerator to facilitate regional economic development with industrial partners. Work will be performed in Bozeman, Montana, and is expected to be completed by July 30, 2028. This contract was a competitive acquisition and two offers were received. Fiscal 2025 research, development, test and evaluation funds in the amount of $15,752,203 are being obligated at time of award. The Air Force Research Laboratory, Rome, New York, is the contracting activity (FA8750-25-C-B027).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "L3Harris Technologies Integrated Systems L.P., Greenville, Texas, has been awarded a $9,306,234 firm-fixed-price, cost-plus-fixed-fee, and cost-reimbursement-no fee definitizing modification (PZ00001) to a previously awarded contract (FA8555-25-C-0001) for the Integrated Broadcast Service – Common Interactive Broadcast – Uplink Site Sustainment Program. Work will be performed in multiple locations in the contiguous U.S. and outside the contiguous U.S. and is expected to be completed Feb. 28, 2026, if all options are exercised. This contract was a sole source acquisition. Fiscal 2025 operation and maintenance funds in the amount of $336,757 will be obligated at time of award. The Air Force Life Cycle Management Center, Robins Air Force Base, Georgia, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "General Dynamics, Bath Iron Works, Bath, Maine, is awarded a fixed-price incentive (firm-target) modification to a previously awarded contract (N00024-23-C-2305) to exercise the fiscal 2025 option for construction of an Arleigh Burke-class ship (DDG 148). This modification also includes options for engineering change proposals, design budgeting requirements, and post-delivery availabilities. Work will be performed in Bath, Maine (69%); Cincinnati, Ohio (4%); Walpole, Massachusetts (4%); York, Pennsylvania (2%); South Portland, Maine (1%); Falls Church, Virginia (1%); and other locations (< 1% (totaling 19%), and is expected to be completed by August 2032. Fiscal 2025 shipbuilding and conversion (Navy) funds will be obligated at the time of award and will not expire at the end of the current fiscal year. The Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded an undefinitized contract action with a not-to-exceed value of $578,729,839, firm-fixed-price order (N0001925F0090) against a previously issued basic ordering agreement (N0001924G0010). This order procures fiscal 2025 F-35 air vehicle initial spares. The subject contract procures basic spares pool and global spares pool spares shared between the customers involved, customer specific afloat spares pool and deployable spares pool, and support labor. These initial spares are necessary to meet immediate maintenance needs and ensure the U.S. services, Collaborative Program Partner nations, and Foreign Military Sales (FMS) customers have mission capable aircraft.  Work will be performed in Fort Worth, Texas (100%), and is expected to be completed in June 2030. Fiscal 2025 aircraft procurement (Air Force) funds in the amount of $148,743,106; fiscal 2025 aircraft procurement (Marine Corps) funds in the amount of $58,473,883; fiscal 2025 aircraft procurement (Navy) funds in the amount of $21,551,619; fiscal 2024 aircraft procurement (Air Force) funds in the amount of $8,519,727; fiscal 2024 aircraft procurement (Marine Corps) funds in the amount of $3,495,556; fiscal 2024 aircraft procurement (Navy) funds in the amount of $1,876,609; fiscal 2023 aircraft procurement (Air Force) funds in the amount of $4,306,095; fiscal 2023 aircraft procurement (Navy) funds in the amount of $7,061,999; international partner funding in the amount of $43,292,470; and FMS funds in the amount of $241,095,906, will be obligated at the time of award, $11,360,000 of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "The Boeing Co., St. Louis, Missouri, is being awarded a not-to-exceed delivery of $65,060,600, (N00383-25-F-YY2E) under a previously awarded basic ordering agreement (N00383-22-G-YY01) for the manufacture of 54 spares; 27 of each on the left and right hand, outer wing panel used on the EA-18G aircraft. The delivery order does not include an option provision. Work will be performed in Hazelwood, Missouri (97%); and St. Louis, Missouri (3%), and is expected to be completed by December 2029. Working capital funds (Navy) funds in the amount of $31,879, 694 will be obligated at the time of the award as an undefinitized contract action, and funds will not expire at the end of the fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 3204 (a)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Lockheed Martin Rotary and Mission Systems, Syracuse, New York, is awarded a $57,258,872 cost-plus-fixed-fee and firm-fixed-price contract for engineering and technical support and production of submarine multifunction modular masts on new construction and in-service submarines. This contract includes options which, if exercised, would bring the cumulative value of this contract to $202,772,544. Work will be performed in Syracuse, New York, and is expected to be completed by July 2030. Fiscal 2024 shipbuilding and conversion (Navy) funds in the amount of $38,683,770 (71%); fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $15,490,815 (28%); and fiscal 2025 other procurement (Navy) funds in the amount of $100,000 (1%), will be obligated and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1). Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-6202).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "EA Engineering, Science, and Technology Inc. PBC, Hunt Valley, Maryland, is awarded a $45,000,000 indefinite-delivery/indefinite-quantity contract for environmental services. Work will be performed at various locations within the Naval Facilities Engineering Systems Command (NAVFAC) Northwest area of operations and is expected to be completed by January 2031. Fiscal 2025 Environmental Restoration, Navy (ERN) funds in the amount of $10,000 will be obligated at time of award and will expire at the end of the current fiscal year. Future task orders will be primarily funded by operation and maintenance, Navy, and ERN funds. This contract was competitively procured via SAM.gov with two proposals received. NAVFAC Northwest, Silverdale, Washington, is the contracting activity (N44255-25-D-0004).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Framaco-Bozdemir JV LLC, Rye Brook, New York, is awarded a $38,186,062 firm-fixed-price contract for renovations and upgrades to three existing facilities at Keflavik Air Station, Iceland. Work will be performed in Keflavik, Iceland, and is expected to be completed by February 2027.  Fiscal 2025 operations and maintenance (Navy) contract funds in the amount of $38,186,062 are obligated on this award and will expire at the end of the current fiscal year. This contract was competitively procured via the Solicitation Module in the Procurement Integrated Enterprise Environment, with three proposals received. The Naval Facilities Engineering Systems Command, Europe Africa Central, Naples, Italy, is the contracting activity (N33191-25-C-6007).Fighter Jet Metals Inc.,* Lake Worth Beach, Florida (N6893625D0017); Rache Corp.,* Camarillo, California (N6893625D0018); Rickard Metals Inc.,* Santa Fe Springs, California (N6893625D0019); and T & T Materials Inc.,* Rochester, New York (N6893625D0020), are awarded combined $19,300,000 firm-fixed-price, multiple-award, indefinite‐delivery/indefinite‐quantity contracts for the procurement of commercially available types of materials such as metals, alloys, acrylic, delrin, fiberglass, plastic, polyvinyl chloride, rubber, and fluoropolymer. Work will be performed at the listed contractor's locations and is expected to be completed by July 2030. These contracts were a competitive acquisition and five offers were received. Funding will be obligated as individual orders are placed. No funding is being obligated at the time of award. Naval Air Warfare Center Weapons Division, China Lake, California, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "L3Harris Corp., Millersville, Maryland, is awarded a $15,363,176 firm-fixed-price modification to a previously awarded contract (N00024-16-C-6239). This modification is to procure spares parts and components. Work will be performed in Ashaway, Rhode Island (85%); and Syracuse, New York (15%), and is expected to be completed by January 2029. Fiscal 2025 other procurement (Navy) spares funds in the amount of $7,725,875 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "StraCon Services Group LLC,* Fort Worth, Texas, is awarded a $12,185,713 cost-plus-fixed-fee order (N6134025F0094) against a previously awarded indefinite-delivery/indefinite-quantity contract (N6134020D0024). This order provides engineering, logistics, and program management support to the Navy and Foreign Military Sales (FMS) customers. Work will be performed in Orlando, Florida, and is expected to be completed in March 2026. Fiscal 2025 aircraft procurement (Navy) funding in the amount of $2,913,642; fiscal 2025 working capital (Navy) funds in the amount of $2,481,149; fiscal 2025 operations and maintenance (Navy) funds in the amount of $936,716; fiscal 2025 operations and maintenance (Air Force) funds in the amount of $137,602; fiscal 2025 other procurement (Navy) funds in the amount of $233,964; fiscal 2025 Royal Australian Air Force (unique) funds in the amount of $246,277; fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $598,668; and FMS customer funds in the amount of $1,650,810, will be obligated at award, $3,555,467 of which will expire at the end of the current fiscal year. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Countrywide Quality Services,* Pasadena, Texas, is awarded an $11,706,592 firm-fixed-price contract (N3904025C2937) for rental of single-occupancy efficiency lodging to accommodate members of a Portsmouth Naval Shipyard project team assigned to temporary duty to support the Docking Selected Restricted Availability of a Los Angeles-class submarine. Work will be performed in Groton, Connecticut, and is expected to be completed by July 2026. Fiscal 2025 operation and maintenance (Navy) funds in the amount of $11,706,592 will be obligated at the time of award. This contract was competitively procured via the SAM.gov website, with 17 offers received. Portsmouth Naval Shipyard, Kittery, Maine, is the contracting activity.DRS Laurel Technologies Inc., Johnstown, Pennsylvania, is awarded a not-to-exceed $11,526,652 firm-fixed-price contract modification to previously awarded contract (N00024-17-C-4109) for the procurement of AN/USQ-82(V) Gigabit Ethernet Data Multiplex System hardware and spare parts in support of Arleigh Burke-class destroyer new construction and modernization. Work will be performed in Johnstown, Pennsylvania, and is expected to be completed by March 2027. Fiscal 2020 shipbuilding and conversion (Navy) funds in the amount of $121,489 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Northrop Grumman Systems Corp., McLean Virginia, is awarded a $7,558,892 cost-plus-incentive-fee modification to a previously awarded contract (N00024-23-C-6110) to exercise year two options for operation of the progressive depot level repair facility and torpedo maintenance and support at the Navy Submarine Torpedo Facility in support of the MK48 Heavyweight Torpedo efforts. Work will be performed in Yorktown, Virginia, and is expected to be completed by July 2026. Fiscal 2025 operation and maintenance (Navy) funds in the amount of $3,745,750 will be obligated at the time of award and will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Conco Inc., Louisville, Kentucky, was awarded a $329,435,528 modification (P00015) to contract W15QKN-20-D-0003 to manufacture, inspect, test, and deliver metal containers and covers for the M231 and M232 series for the Modular Artillery Charge Systems. The modification brings the total cumulative face value of the contract to $628,655,767. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Dec. 12, 2026. Army Contracting Command, Newark, New Jersey, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "ACC Construction Co. Inc., Augusta, Georgia, was awarded a firm-fixed-price contract to construct a new standard design Automation-Aided Instructional area. The amount of this action is $165,948,726. Bids were solicited via the internet with three received. Work will be performed on Fort Gordon, Georgia with an estimated completion date of March 24, 2029. Fiscal 2024 military construction, Army funds in the amount of $165,948,726 were obligated at the time of the award. U.S. Army Corps of Engineers, Savannah, Georgia, is the contracting activity (W912HN-25-C-4002).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "A&H-Ambica JV LLC,* Livonia, Michigan (W912CH-25-D-A018); Angels General Construction,* Detroit, Michigan (W912CH-25-D-A019); B&B Industries,* Frasier, Michigan (W912CH-25-D-A023) CAVU Construction,* Virginia Beach, Virginia (W912CH-25-D-A024); DCR Services & Construction,* Detroit, Michigan (W912CH-25-D-A025); DMC Consultants,* Detroit, Michigan (W912CH-25-D-A026); Enfield Enterprises LLC,* Springfield, Massachusetts (W912CH-25-D-A027); Erie Affiliates,* Cleveland, Ohio (W912CH-25-D-A028); Nisou Enterprises,* Farmington Hills, Michigan (W912CH-25-D-A029); Pontiac Drywall Systems Inc.,* Pontiac, Michigan (W912CH-25-D-A031); RB Construction Co.,* Mt. Clemens, Michigan (W912CH-25-D-A032); and Sanalil Construction,* Fort Lauderdale, Florida (W912CH-25-D-A033), will compete for each order of the $96,200,000 firm-fixed-price contract for construction. The total combined face value of the contract is $96,200,000. Bids were solicited via the internet with 13 received. Work locations and funding will be determined with each order, with an estimated completion date of Aug 2, 2030. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Loc Performance Products LLC, Plymouth, Michigan, was awarded a $69,805,302 modification (P00033) to contract W15QKN-18-C-0073 for Improved Armored Cab production kits and IAC Integration Spares kits for the M270A2 Multiple Launcher Rocket System. The modification brings the total cumulative face value of the contract to $334,927,813. Work will be performed in Plymouth, Michigan, with an estimated completion date of Aug. 31, 2029. Fiscal 2024 M270 Cooperative Partner (Italy, United Kingdom); 2025 missile procurement, Army funds; and 2025 Foreign Military Sales (Finland) funds, in the amount of $69,805,302 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Conti Federal Services LLC, Orlando, Florida, was awarded a firm-fixed-price contract for construction. The amount of this action is $64,998,730. Bids were solicited via the internet with four received. Work will be performed in Israel with an estimated completion date of July 17, 2028. Fiscal 2025 Foreign Military Sales (Israel) funds in the amount of $64,998,730 were obligated at the time of the award. U.S. Army Corps of Engineers, Middle East District, is the contracting activity (W912ER-25-C-0007).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Donjon Marine Co. Inc., Hillside, New Jersey, was awarded a firm-fixed-price contract to perform maintenance dredging of portions of the Newark Bay, New Jersey, Federal Navigation Project. The amount of this action is $53,624,500. Bids were solicited via the internet with three received. Work will be performed in Newark Bay, New Jersey with an estimated completion date of Jan. 25, 2026. Fiscal 2025 civil operation and maintenance funds in the amount of $53,624,500 were obligated at the time of the award. U.S. Army Corps of Engineers, New York, New York, is the contracting activity (W912DS-25-C-A003).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Emerson Construction Co. Inc., Temple, Texas, was awarded a firm-fixed-price contract for construction. The amount of this action is $ $26,704,000. Bids were solicited via the internet with five received. Work will be performed in Abilene, Texas, with an estimated completion date of Feb. 1, 2027. Fiscal 2025 military construction, defense-wide funds in the amount of $26,704,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Fort Worth, Texas, is the contracting activity (W9126G-25-C-0010).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Precision Build Solutions, Gibsonton, Florida, was awarded a firm-fixed-price contract to fabricate and supply a Miter Gate to Greenup Lock and Dam. The amount of this action is $19,112,957. Bids were solicited via the internet with two received. Work will be performed in Greenup, Kentucky, with an estimated completion date of Aug. 31, 2028. Fiscal 2025 civil operation and maintenance funds in the amount of $19,112,957 were obligated at the time of the award. U.S. Army Corps of Engineers, Huntington, West Virginia, is the contracting activity (W91237-25-F-A074).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Direct Viz Solutions, Chantilly, Virginia, was awarded a $13,643,328 modification (P00054) to contract W91RUS-19-C-0014 for enterprise-level Command, Control, Communications, Computers, and Information Management common-user services. The modification brings the total cumulative face value of the contract to $242,465,411. Work will be performed on Fort Huachuca, Arizona, with an estimated completion date of Oct. 31, 2025. Fiscal 2025 operation and maintenance, Army funds in the amount of $13,643,328 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "General Dynamics Land Systems, Sterling Heights, Michigan, was awarded a $11,501,017 modification (P00108) to contract W56HZV-22-C-0012 to add labor hours and funding. The modification brings the total cumulative face value of the contract to $1,024,379,235. Work will be performed in Sterling Heights, Michigan, with an estimated completion date of Feb. 27, 2027. Fiscal 2010 Foreign Military Sales (Kuwait) funds; 2024 and 2025 other procurement, Army funds; and 2025 research, development, test, and evaluation Army funds, in the amount of $11,501,017 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Southwest Shipyard Lip, Channelview, Texas, was awarded a firm-fixed-price contract for welded steel revetment barges. The amount of this action is $7,800,000. Bids were solicited via the internet with three received. Work will be performed in Galveston, Texas with an estimated completion date of March 3, 2027. Fiscal 2025 revolving funds in the amount of $7,800,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Philadelphia, Pennsylvania, is the contracting activity (W912BU-25-C-A012).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "ASRC Federal Facilities Logistics LLC,** as successor-in-interest to Science Applications International Corp., Beltsville, Maryland, has been awarded a maximum $90,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for facilities maintenance, repair and operations supplies. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a 336-day bridge contract with no option periods. Locations of performance are Colorado, New Mexico, Oklahoma, Kansas, and Arkansas, with a July 2, 2026, ordering period end date. Using customers are Army, Navy, Air Force, Marine Corps and Coast Guard. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE8E3-25-D-0022).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Amsted Graphite Materials LLC, Anmoore, West Virginia, has been awarded a maximum $9,996,800 firm-fixed-price contract for Iso-statically Molded Synthetic Graphite. This was a competitive acquisition with three responses received. This is a three-year contract with no option years. The performance completion date is July 31, 2028. Using military services are Army, Marine Corps, Navy, Air Force, and Space Command. Type of appropriation is fiscal 2025 transaction funds. The contracting activity is the Defense Logistics Agency Contracting Services Office, Columbus Division #3, Columbus, Ohio (SP8000-25-C-0007)",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Pomp's Tire Service Inc., New Berlin, Wisconsin, has been awarded an estimated $8,448,334 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for wheel and tire assemblies. A delivery order (SPRDL1-25-F-0204) was also executed at the time of award. This was a competitive acquisition with three responses received. This is a five-year contract with no option periods. The ordering period end date is July 31, 2030. Using military service is Army. Type of appropriation is fiscal 2025 through 2030 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan (SPRDL1-25-D-0064).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "UPDATE: Combat Medical Systems LLC,** Huntersville, North Carolina (SPE2DH-25-D-0023, $20,000,000) has been added as an awardee to the multiple award contract for medical equipment and accessories for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DH-21-R-0002 and awarded Feb. 10, 2022. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Jadin Tech LLC,*** Anchorage, Alaska, is being awarded a single award, indefinite-delivery/indefinite-quantity contract for Tactical Local Area Network family of systems accessory cases and ancillary items with a five-year ordering period beginning July 31, 2025, and ending July 30, 2030.  This contract, with a ceiling value of $45,250,000, is in support of U.S. Special Operations Command (USSOCOM), Special Operations Forces Acquisition, Technology, and Logistics, Tactical Information Systems' Program Executive Office. Fiscal 2025 procurement funds are being obligated on the first delivery order at time of award. USSOCOM, MacDill Air Force Base, Florida, is the contracting activity (H9241525DE001).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "Enterprise Resource Planning International Inc., Laurel, Maryland, was awarded a non-competitive contract modification (P00016) to a single-award, indefinite-delivery/indefinite-quantity vehicle for a ceiling increase. The face value of this action is $20,000,000 and will be funded via orders made to the vehicle. The total cumulative face value of the contract is $85,000,000. Places of performance for this contract vary and are specified within each task order. Performance under this contract is expected to be completed Sept. 23, 2026. Proposals were not solicited, and a Notice of Intent to Sole Source was posted to SAM.gov on June 27, 2025. The Defense Information Technology Contracting Organization, Fort Meade, Maryland, is the contracting activity (HC104720D2045).",
    "contract_date": "2025-07-31"
  },
  {
    "text": "*Small business**Small-disadvantaged business***Alaska Native Corporation",
    "contract_date": "2025-07-31"
  }
]