[
  {
    "text": "RTX Corp., Pratt and Whitney Military Engines, East Hartford, Connecticut, is awarded a $670,219,031 modification (P00021) to a previously awarded firm-fixed-price, cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract (N0001920D0013). This modification adds scope to procure initial spares for the production and delivery of the F135 propulsion system including pares depot and common for the F-36 global spares pool, and country unique spares in support of the Joint Strike Fighter program for the Air Force, Marine Corps, Navy non-Department of War participants, F-35 Cooperative Program Partners, and Foreign Military Sales customers. Work will be performed in East Hartford, Connecticut (97%) (labor surplus area); North Berwick, Maine (2%); and South Windsor, Connecticut (1%), and is expected to be completed in December 2028. No funds will be obligated at the time of award, funds will be obligated on individual orders as they are issued. The contract that is being modified was not competed. The Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Black Construction/Mace International JV, Harmon, Guam (N40084-21-D-0079); ECC Diego Garcia LLC, Burlingame, California (N40084-21-D-0080); JSK Diego Services LLC, Fort Worth, Texas (N40084-21-D-0081); MVL Bromgrove JV LLC, Houston, Texas (N40084-21-D-0082); and PARSONS-COLAS UKP JV, Centreville, Virginia (N40084-21-D-0083), are awarded a combined maximum value $70,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity modification to their respective previously-awarded contracts for commercial and institutional building construction at U.S. Naval Support Facility (NSF) Diego Garcia. This award brings the total combined cumulative value of all five contracts to $518,000,000. This modification provides for additional capacity to order construction services until Sept. 2, 2026. Work will be performed at NSF Diego Garcia, British Indian Ocean Territory, and will be completed by September 2026. No funds will be obligated at time of award; funds will be obligated on individual task orders as they are awarded. Naval Facilities Engineering Systems Command Far East is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Robertson Fuel Systems LLC, Tempe, Arizona, is awarded a $35,361,246 firm-fixed-price modification (P00005) to a previously awarded contract (N0001924C0017). This modification adds scope to manufacture and deliver 14 Delta install kits, 44 Tactical Bulk Fuel Delivery System (TBFDS) Forward Area Refueling Equipment kit insert/portable fire extinguisher kits, nine fuel control panels, nine fuel control panel power harnesses, four TBFDS b-kits, 25 tanks and four tank power harnesses to support Marine Corps requirements of the CH-53K aircraft. Work will be performed in Tempe, Arizona (100%), and is expected to be completed in January 2028. Fiscal 2023 aircraft procurement (Navy) funds in the amount of $35,361,246 will be obligated at time of award, all of which will expire at the end of the fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Insitu Inc., Bingen, Washington, was awarded a $19,773,000 firm-fixed-price order (N0001925F0933) against a previously issued basic ordering agreement (N0001921G0007). This order procures pre-deployment, deployment support, post-deployment support, and associated data in support of intelligence surveillance and reconnaissance services on board three Naval Surfaces Forces Atlantic ships. Deployment support includes 175 sensor data hours per month and will not exceed 1700 sensor data hours for the Department of War and other government agencies. Work will be performed in Bingen, Washington (20%); and various undisclosed locations outside of the continental U.S. (80%), and is expected to be completed April 2027. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $19,773,000 will be obligated at the time of award, all of which will expire at the end of the current fiscal year. This order was competed as a limited source with two proposals received. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "CCI Prime Contractors LLC,* Niceville, Florida, is awarded a firm-fixed-price construction contract in the amount of $16,793,657 for the replacement of the roof of Building Two, Aircraft Maintenance Hangar, located at Naval Air Station Meridian, Mississippi. Work will be performed in Meridian, Mississippi, and is expected to be completed by June 2027. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $16,793,657 will be obligated at the time of award and will expire at the end of the current fiscal year. This contract was procured as a sole source in accordance with Federal Acquisition Regulation 6.302-5(b)(4). The Naval Facilities Engineering Systems Command, Southeast, Jacksonville, Florida, is the contracting activity (N69450-25-C-1059).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Stellant Systems Inc., Williamsport, Pennsylvania, is being awarded $9,647,872 for a firm-fixed-price contract for the procurement of 30 continuous flow adaptor electron tubes in support of the SPS-48 weapon system. All work will be performed in Williamsport, Pennsylvania, and work is expected to be completed by October 2030. Fiscal 2025 working capital funds (Navy) in the amount of $9,647,872 will be obligated at time of award and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 3204 (a)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Mechanicsburg, Pennsylvania, is the contracting activity (N00104-25-C-CA08).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Raytheon Missiles and Defense, Portsmouth, Rhode Island, is awarded a not-to-exceed amount $8,438,897 cost-plus-fixed-fee and firm-fixed-price undefinitized contract action for covered hardware evaluations and repairs of Universal Weapon Launcher system hardware and weapon launch console integrated enclosure hardware. This is a five-year indefinite-delivery/indefinite-quantity-type contract. Work will be performed in Portsmouth, Rhode Island, and is expected to be completed in September 2030. Working capital funds in the amount of $176,431 will be obligated on the first task order following award of the basic contract and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1) and 41 U.S. Code 3304(a)(1), as implemented by Federal Acquisition Regulation 6.302-1(a)(2)(iii). Naval Undersea Warfare Center Division Newport, Newport, Rhode Island, is the contracting activity (N66604-25-D-V500).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Lockheed Martin Aeronautics Co., Marietta, Georgia, was awarded a $211,291,638 cost-plus-fixed-fee, firm-fixed-price, and indefinite-delivery/indefinite-quantity contract action for technical and engineering services for the C-5M Super Galaxy fleet. The contract provides engineering investigations and analyses, formulating deficiency resolution concepts, designing proof-of-concepts, and laboratory and on-and-off aircraft testing. Work will be performed at Marietta, Georgia, and is expected to be completed by Sept. 14, 2030. This contract was a sole source acquisition. Fiscal 2025 appropriated funds in the amount of $34,861,827 are obligated at the time of the award. The C-5 contracting branch at Robins Air Force Base, Georgia, is the contracting activity (FA8525-25-D-B002).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "The Canadian Commercial Corp., Ottawa, Ontario, Canada, was awarded a $48,000,000 firm-fixed-price and indefinite-delivery/indefinite-quantity contract for rocket assisted take off. This contract provides for rocket-assisted takeoff rocket motors and initiators. Work will be performed at Stony Mountain, Manitoba, Canada, and is expected to be complete by July 30, 2032. The work will be done by Magellan Aerospace, Winnipeg, Manitoba Canada. This contract was a competitive acquisition, with one offer received. Fiscal 2023 procurement funds; and fiscal 2025 operations and management funds, in the amount of $8,373,282 are being obligated at the time of award. Air Force Life Cycle Management Center, Hill Air Force Base, Utah, is the contracting activity (FA8213-25-D-B004).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Boeing Space, El Segundo, California, was awarded a $40,526,103 cost-plus-fixed-fee modification (P00168) to previously awarded FA8808-10-C-0001 for Global SATCOM Configuration Control Element Modernization Special Study Phase Two. The modification brings the total cumulative face value of the contract to $3,141,977,569. Work will be performed at El Segundo, California, and is expected to be completed by Sept. 30, 2028. Fiscal 2024 Space Force research development test and evaluation funds in the amount of $32,291,257 are being obligated at the time of award. Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "PKL Services Inc., Poway, California, has been awarded a $23,634,832 modification (P00013) to a previously awarded contract (FA4897-22-C-0015) for Republic of Singapore Air Force flight operations and maintenance support training. The modification brings the total cumulative face value of the contract to $88,129,295. Work will be performed at Mountain Home Air Force Base, Idaho, and is expected to be completed by Sept. 30, 2027. This modification involves Foreign Military Sales (FMS) to the Republic of Singapore. FMS funds in the amount of $23,634,832 are being obligated at time of award. The 366th Contracting Squadron, Mountain Home Air Force Base, Idaho, is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Keystone Mission Solution, Keystone, Colorado; and Finegayan, Guam, was awarded a $14,850,000 firm-fixed-price contract for a VIASAT 9.1m SGLS/USB Antenna. This contract provides manufacturing, delivery, and installation of a VIASAT 9.1m SGLS/USB Antenna, including the repairs of the antenna installation site affected by Typhoon Mawar. Work will be performed at Finegayan, Guam, and is expected to be completed by Jan. 15, 2027. This contract was a competitive acquisition and three offers were received. Fiscal 2025 and procurement funds in the amount of $14,850,000 are being obligated at the time of award. Space Acquisition and Integration Office, Schriever Space Force Base, Colorado Springs, Colorado, is the contracting activity (FA2518-25-C-0006).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "EMC Corp., Irvine, California, was awarded a $14,805,000 firm-fixed-price and indefinite-delivery/indefinite-quantity contract for engineering services. This contract provides for comprehensive labor and instrumentation support for the Phase Two implementation of the Cloud Hybrid Edge to Enterprise Test and Analysis Site 3.0 data analytics and management solutions. Work will be performed at Edwards Air Force Base, California, and is expected to be completed by Feb. 27, 2026. This contract was a sole source acquisition. Fiscal 2025 research and development funds in the amount of $1,390,182 are being obligated at the time of award. The Air Force Test Center directorate of contracting, Edwards Air Force Base, California, is the contracting activity (FA9302-25-D-0003).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Trace Systems Inc., Tampa, Florida, was awarded a $12,987,196 modification (P00003) to a previously awarded contract (FA4890-25-F-0002) to exercise Option Year One for the U. S. Air Forces Central (AFCENT) Communications Engineering and Installation Support Program II. This modification brings the total cumulative face value of the contract $11,749,010 to $24,736,206. Work will be performed at Shaw Air Force Base, South Carolina; and the AFCENT area of responsibility, and is expected to be completed by March 31, 2030. Fiscal 2026 operation and maintenance funds in the amount of $10,087,196 are being obligated once available. The Air Combat Command, Acquisition Management and Integration Center, Langley Air Force Base, Virginia, is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Ecology Mir Group LLC, Fairfax, Virginia, was awarded a $11,993,274 requirements contract for explosion proof human lifts. This contract provides for procurement of explosion proof scissor and bool lifts, as well as spare batteries and chargers. Work will be performed at Fairfax, Virginia, and is expected to be completed by May 15, 2029. This contract was a competitive acquisition, and seven offers were received. No funds are being obligated at the time of award. The contracting activity is the Air Force Sustainment Center, Robins Air Force Base, Georgia (FA8571-25-D-0006) .",
    "contract_date": "2025-09-16"
  },
  {
    "text": "CORRECTION: A $525,831,923 cost-plus fixed-fee contract announced on Sept. 12, 2025, for ASRC Federal Data Network Technologies LLC, Beltsville, Maryland, to procure service and support for the Cyber Support Services 3 program was not awarded.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Olin Winchester LLC, Oxford, Mississippi, was awarded a $78,293,939 modification (P00036) to contract W52P1J-21-C-0016 for the manufacture of 5.56mm, 7.62mm, and Caliber .50 ammunition. The modification brings the total cumulative face value of the contract to $309,756,353. Work will be performed in Oxford, Mississippi, with an estimated completion date of Dec. 31, 2026. Fiscal 2023, 2024, and 2025 ammunition procurement, Army funds in the amount of $78,293,939 were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Precision Construction LLC,* Carencro, Louisiana, was awarded a $34,926,036 firm-fixed-price contract for flood control work on the Amite River and Tributaries, Comite River Basin. The total cumulative face value of the contract is $53,754,268. Bids were solicited via the internet with six received. Work will be performed in Baton Rouge, Louisiana, with an estimated completion date of June 25, 2028. Fiscal 2018 civil construction funds in the amount of $34,926,036 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans District, is the contracting activity (W912P8-25-C-0025).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Great Lakes Dredge and Dock Company LLC, Houston, Texas, was awarded a $27,902,501 firm-fixed-price contract for the removal and disposal of hopper dredge material. Bids were solicited via the internet with two received. Work will be performed in Venice, Louisiana, with an estimated completion date of April 7, 2026. Fiscal 2025 civil operation and maintenance funds in the amount of $27,902,501 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans District, is the contracting activity (W912P8-25-C-0023).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "J.F. Brennan Co. Inc., La Crosse, Wisconsin, was awarded a $21,967,500 firm-fixed-price contract for the replacement of dam nose pier and bulkhead recesses at Lock 19 in the Mississippi River Basin. Bids were solicited via the internet with five received. Work will be performed in Keokuk, Iowa, with an estimated completion date of June 9, 2027. Fiscal 2025 civil operation and maintenance funds in the amount of $21,967,500 were obligated at the time of the award. U.S. Army Corps of Engineers, Rock Island, Illinois, is the contracting activity (W912EK-25-C-A021).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Precision Construction LLC,* Carencro, Louisiana, was awarded a $13,549,362 firm-fixed-price contract for flood control work on the Amite River and Tributaries, Comite River Basin. The amount of this action is $13,549,362. Bids were solicited via the internet with eight received. Work will be performed in Baker, Louisiana, with an estimated completion date of Aug. 18, 2027. Fiscal 2018 civil construction funds in the amount of $13,549,362 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans District, is the contracting activity (W912P8-25-C-A005).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Hamilton Sundstrand Corp., Windsor Locks, Connecticut, was awarded a $9,157,747 firm-fixed-price contract for the maintenance and overhaul of flight control computers for the UH-60 Black Hawk. The amount of this action is $9,157,747. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 15, 2030. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity (W58RGZ-25-D-0021).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Southwind Construction Corp., Evansville, Indiana, was awarded a $8,494,482 firm-fixed-price contract for Atlantic Intracoastal Waterway maintenance dredging. The amount of this action is $8,494,482. Bids were solicited via the internet with two received. Work will be performed in Carolina Beach, Figure 8 Island, Holden Beach, Ocean Isle Beach, and Onslow Beach, North Carolina, with an estimated completion date of April 30, 2026. Fiscal 2022, 2023, 2024, and 2025 civil operation and maintenance funds in the amount of $8,494,482 were obligated at the time of the award. U.S. Army Corps of Engineers, Wilmington District, is the contracting activity (W912PM-25-C-A012).",
    "contract_date": "2025-09-16"
  },
  {
    "text": "HDR Architecture Inc., Arlington, Virginia, has been awarded an indefinite-delivery/indefinite-quantity contract (HQ003425DE004) with a maximum value of $66,000,000, if all options are exercised. The value of this award is $12,000,000. No funds are being obligated at the time of the award. The purpose of this contract is for the required architectural and engineering services to support design and construction activities related to planning, programming, execution, and closeout of projects. The anticipated projects include support in various engineering disciplines such as civil, structural, blast analyses, geotechnical, environmental engineering, mechanical, controls, plumbing, electrical, interior and landscape architecture, space planning, master planning, transportation infrastructure, transportation demand management and other technical disciplines. The work will be performed at the Pentagon Reservation, Arlington, Virginia; the Mark Center, Alexandria, Virginia; and Department of War facilities in Fairfield, Pennsylvania, and Frederick, Maryland. The estimated contract completion date is Sept. 16, 2030. Washington Headquarters Services, Arlington, Virginia, is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "The Boeing Co., St. Louis, Missouri has been awarded a maximum $41,801,543 modification (P00004) to an undefinitized delivery order (SPRPA1-24-F-0051) issued against a three-year requirements contract (SPRPA1-22-D-001U) to retroactively increase line items and establish additional funding to extend the existing undefinitized contract action. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. Location of performance is Missouri, with a performance completion date of Sept. 16, 2027. The military services are Air Force, Army, Navy, and Marine Corps. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "AvKare LLC, Pulaski, Tennessee, has been awarded an estimated $8,628,888 modification (P00009) exercising the third one-year option period of a one-year base contract (SPE2D2-23-D-0001) with four one-year option periods for estradiol tablets. This is a fixed-price, requirements contract. Locations of performance are Kentucky and New York, with an Oct. 3, 2026, performance completion date. Using customers are Army, Navy, Air Force, Marine Corps, Coast Guard, Department of Veterans Affairs, Indian Health Services, and Federal Bureau of Prisons. Type of appropriation is fiscal 2026 through 2027 defense working capital funds. The contracting agency is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "CORRECTION: The contract announced on Sept. 12, 2025, for NATI-Maytag Group LLC,** Lanham, Maryland (SPE603‐25‐C‐5009) for $25,850,058 was announced with an incorrect contract number. The correct contract number is SPE603-25-C-5010. The contracting activity is the Defense Logistics Agency Energy, Fort Belvoir, Virginia.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "UPDATE: Deere & Co., Cary, North Carolina (SPE8EC-25-D-0055, $86,000,000) has been added as an awardee to the multiple award contract for agricultural equipment, issued against solicitation SPE8EC-21-R-0006 and awarded July 29, 2022. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "Octapharma USA LLC, Paramus, New Jersey, is awarded a sole-source, firm-fixed-price, indefinite-quantity/indefinite-delivery contract (HT9425-25-D-E004) valued at $14,880,000 in support of the Defense Health Agency Program Executive Office Operational Medicine for the purchase of OctaplasLG Kits. All kits are to be delivered to either the Armed Services Whole Blood Processing Laboratory - East or Armed Services Whole Blood Processing Laboratory - West. The period of performance is Sept. 15, 2025, to Sept. 14, 2030. The place of performance is Fort Detrick, Maryland. Fiscal 2025 operation and maintenance funds are obligated at the time of award. The Defense Health Agency, U.S. Army Medical Research Acquisition Activity, Contracts Branch 7, Fort Detrick, Maryland, is the contracting activity.",
    "contract_date": "2025-09-16"
  },
  {
    "text": "*Small business**Service-disabled veteran-owned small business",
    "contract_date": "2025-09-16"
  }
]