[
  {
    "text": "Linquest Corp., Herndon, Virginia, has been awarded a Small Business Innovation Research Phase III Task Order, with a not-to-exceed price of $98,715,100, for the development of a collaborative digital engineering ecosystem. This contract provides for the collaborative digital engineering ecosystem known as the Integration Accelerator, as well as analytical and technical decision support to improve and enhance the methodologies, processes, and outcomes related to acquisition and deployment of future Space Force integrated testing and training. Work will be performed in Colorado Springs, Colorado, and is expected to be completed by Sept. 7, 2028. This contract was a sole source acquisition. Fiscal 2024 research, development, test and evaluation funds in the amount of $5,500,000 are being obligated at the time of award. The Space Systems Command, Peterson Space Force Base, Colorado, is the contracting activity (FA2553-25-F-B004).",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Aircraft Technologies Inc., San Antonio, Texas, was awarded a $12,295,955 indefinite-delivery/indefinite-quantity contract award for KC-135 increased capacity latrine. This contract provides for increased capacity latrines and spares for the KC-135 fleet. The location of performance is San Antonio, Texas, and the work is expected to be complete by Sept. 7, 2031. This award is the result of a competitive acquisition, and two offers received. Fiscal 2024 National Guard; and Reserve Equipment funds, in the amount of $66,804 are being obligated at the time of award. Tinker Air Force Base, Oklahoma City, Oklahoma, is the contracting activity (FA8105-25-D-B001).",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Viking Dredging LLC,* Houston, Texas (W912P9-25-D-0014); Dubuque Barge and Fleeting Service Co,* Dubuque, Iowa (W912P9-25-D-0015); Magruder Construction Co. Inc.,* Eolia, Missouri (W912P9-25-D-0016); Ahtna-Brennan JV LLC,* Irvine, California (W912P9-25-D-0017); Jackson D Summers,* Missouri Valley, Iowa (W912P9-25-D-0018); King Co. Inc.,* Holland, Michigan (W912P9-25-D-0019); Next Generation Logistics LLC,* New Orleans, Louisiana (W912P9-25-D-0020); and Davinroy Mechanical Contractor Inc.,* Belleville, Illinois (W912P9-25-D-0021), will compete for each order of the $50,000,000 firm-fixed-price contract for operations and maintenance dredging for the U.S. Army Corps of Engineers, St. Louis District. Bids were solicited via the internet with eight received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 7, 2030. U.S. Army Corps of Engineers, St. Louis District, is the contracting activity.",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Olgoonik General LLC, Anchorage, Alaska, was awarded a firm-fixed-price contract (W9127S-25-D-A004) for various minor construction projects. The amount of this action is $45,000,000. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 7, 2030. U.S. Army Corps of Engineers, Little Rock District, is the contracting activity.",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Red Bison Services LLC, Kenner, Louisiana, was awarded a $20,102,000 firm-fixed-price contract for flood control work as part of the Comite River Diversion Project in East Baton Rouge Parish, Louisiana. The amount of this action is $20,102,000. Bids were solicited via the internet with 11 received. Work will be performed in East Baton Rouge, Louisiana, with an estimated completion date of Oct. 30, 2027. Fiscal 2025 construction, Corps of Engineers, civil funds in the amount of $20,102,000 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans District, is the contracting activity (W912P825C0021).",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Dimco Inc.,* Vicksburg, Mississippi (W912EE-25-D-A009); EMC Inc.,* Grenada, Mississippi (W912EE-25-D-A010); and Prairie Engineers P.C.,* Columbia, Illinois (W912EE-25-D-A011), will compete for each order of the $15,000,000 firm-fixed-price contract to provide professional services for automated hydrographic and topographic surveying in support of maintenance dredging and mat sinking operations. Bids were solicited via the internet with six received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 30, 2030. U.S. Army Corps of Engineers, Vicksburg District, is the contracting activity.",
    "contract_date": "2025-09-08"
  },
  {
    "text": "KZF Design Inc., Cincinnati, Ohio, was awarded a $10,598,321 firm-fixed-price contract for architect-engineer, design, and support services for the new Antilles Middle/High School in Fort Buchanan, Puerto Rico. The total cumulative face value of the contract is $12,439,710. Work will be performed in Bayamon, Puerto Rico, with an estimated completion date of Oct. 17, 2029. Fiscal 2025 military construction, defense-wide funds in the amount of $10,598,321 were obligated at the time of the award. U.S. Army Corps of Engineers, Norfolk District, is the contracting activity (W9123624D6001).",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Sierra Nevada Co. (SNC) LLC, Sparks, Nevada, is awarded a $30,648,550 hybrid indefinite-delivery/indefinite-quantity contract in support of Multi-Function Electronic Warfare (MFEW) Family of Systems (FoS). This contract provides for MFEW maintenance and repair services, additional SNC produced MFEW systems, spare parts for the new and upgraded MFEW FoS inventory, and engineering support services for MFEW systems. Work will be performed in Sparks, Nevada, and is expected to be completed in September 2030. The maximum dollar value is $30,648,550. Fiscal 2025 operation and maintenance (Marine Corps) funds in the amount of $499,998 were obligated under an initial task order award at the time of this base contract award. This contract was not competitively procured pursuant to Federal Acquisition Regulation 6.302-1. The Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-D-2056).",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Raytheon Co., Tewksbury, Massachusetts, is awarded a $26,947,406 firm-fixed-price modification to previously awarded contract N00024-22-C-5501 for spare parts procurement in support of the Dual Band Radar systems installed aboard Gerald R. Ford-class and Zumwalt-class ships. Work will be performed in Andover, Massachusetts (40%); Tewksbury, Massachusetts (20%); Portsmouth, Massachusetts (20%); and Marlborough, Massachusetts (20%). Work is expected to be completed by September 2028. Fiscal 2025 other procurement (Navy) funds in the amount of $26,947,406 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-08"
  },
  {
    "text": "NCS Technologies Inc.,* Manassas, Virginia, is awarded a $25,551,907 firm-fixed-price delivery order issued against NASA Solutions for Enterprise-Wide procurement (SEWP) indefinite-delivery/indefinite-quantity contract NNG15SD85B. This procurement is for Phase Three of the fiscal 2025 enterprise-wide general purpose laptops (GPLs) with docking stations refresh for the Marine Corps. The order includes a total requirement for 37,754 GPLs, all options will be exercised with the base award. The GPLs will be delivered to Enterprise Staging and Delivery in Norfolk, Virginia. Delivery is expected to be completed by June 30, 2026.  Fiscal 2023 procurement (Marine Corps) (PMC) funds in the amount of $96,105; fiscal 2024 PMC funds in the amount of $13,536; and fiscal 2025 PMC funds in the amount of $25,442,265, will be obligated under this delivery order award. Fiscal 2023 PMC contract funds in the amount of $96,105 will expire at the end of the current fiscal year. This contract was competitively procured as a 100% set-aside for small business competition via the NASA SEWP website.  Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-F-4061).",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Kratos Technology and Training Solutions Inc., San Diego, California, was awarded a $22,542,537 firm-fixed-price contract for logistics, instructor, and integrated product support, as well as a comprehensive technical hardware and software refresh and upgrade for the Royal Saudi Naval Forces Naval Tactical Team Trainers in support of various air, ground, and weapons training systems and equipment. Work will be performed in Orlando, Florida (52%); Jeddah, Saudi Arabia (24%); and Jubail, Saudi Arabia (24%), and is expected to be completed July 2030. Foreign Military Sales customer funds in the amount of $22,542,537 will be obligated at the time of the award, none of which expire at the end of the current fiscal year. This contract was competed, one offer was received. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity (N6134025C0017). (Awarded on Sept. 4, 2025)",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Simulation Technologies Inc., Huntsville, Alabama, has been awarded a minimum $24,832,068 firm-fixed-price delivery order (SPRRA2-25-F-0179) against a two-year long-term, indefinite-delivery/indefinite-quantity contract (SPRRA2-25-D-0018) under solicitation SPRRA2-25-R-0083 for environmental control units and power control modules. This was a competitive acquisition with two responses received. This is a two-year contract with no option periods. The delivery order completion date is March. 31, 2027. Using customers are Army and federal civilian agencies. Type of appropriation is fiscal 2025 Army procurement funds. The contracting activity is the Defense Logistics Agency Aviation, Redstone Arsenal, Alabama.",
    "contract_date": "2025-09-08"
  },
  {
    "text": "Englobal Government Services Inc., Tulsa, Oklahoma, has been awarded a maximum $7,555,561 firm-fixed-price task order (SP4706-25-F-0052) against a five-year contract (SP4706-24-D-0003) for refresh and installation of an automated fuel handling system at Fleet Logistics Center, Yokosuka (Yokose), Japan. This was a competitive acquisition with four responses received. This is a two-year six-month task order with no option periods. The performance completion date is March 31, 2028. Using customers are Army, Navy, Air Force, Marine Corps, and Coast Guard. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Contracting Services Office, Columbus, Ohio.",
    "contract_date": "2025-09-08"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-09-08"
  }
]