[
  {
    "text": "B.L. Harbert International LLC, Birmingham, Alabama (W91278-25-D-0033); Brasfield & Gorrie LLC, Birmingham, Alabama (W91278-25-D-0034); Caddell Construction Co. LLC, Montgomery, Alabama (W91278-25-D-0035); Hensel Phelps, Orlando, Florida (W91278-25-D-0036); Korte Construction Co., St. Louis, Missouri (W91278-25-D-0037); and The Whiting-Turner Contracting Co., Baltimore, Maryland (W91278-25-D-0038), will compete for each order of the $245,000,000 firm-fixed-price contract for general repair and construction. The total cumulative face value is $245,000,000. Bids were solicited via the internet with 19 received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 3, 2030. Army Contracting Command, Mobile, Alabama, is the contracting activity.",
    "contract_date": "2025-08-04"
  },
  {
    "text": "Goodyear Tire & Rubber Co., Akron, Ohio, was awarded a $14,699,590 modification (P00010) to contract W91CRB-21-D-0003 for the purchase of tires. The modification brings the total cumulative face value of the contract to $77,758,247. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Dec. 20, 2025. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.",
    "contract_date": "2025-08-04"
  },
  {
    "text": "JJR Solutions LLC,* Dayton, Ohio, was awarded a $9,231,910 modification (P00004) to contract W519TC-25-F-0192 for Small Business Innovation Research Phase III. The modification brings the total cumulative face value of the contract to $38,486,892. Work will be performed in Newport News, Virginia, with an estimated completion date of Nov. 17, 2026. Fiscal 2023 and 2025 other procurement, Army funds; and 2025 research, development, test and evaluation, Army funds in the amount of $1,013,097, were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity.",
    "contract_date": "2025-08-04"
  },
  {
    "text": "Kongsberg Defence & Aerospace, Kongsberg, Norway, is awarded a $117,900,168 firm-fixed-price modification to the previously awarded undefinitized contract action (M67854-25-C-2023) for Amphibious Combat Vehicle (ACV) Medium Caliber Cannon Protector Remote Turret 20, hereafter referred to as the \"Turret\". The total value of the contract if all options are exercised is $271,476,370. This contract modification provides for the definitization of the contract and the exercise of the options for the procurement of 101 full rate production Turrets for the ACV Medium Caliber Cannon (ACV-30) vehicle, associated production costs, fielding and support costs, support & test equipment, and spares. Work will be performed in Johnstown, Pennsylvania (62%); and Kongsberg, Norway (38%), with an expected completion date of Sept. 30, 2027. Fiscal 2025 procurement (Marine Corps) funds in the amount of $117,900,168 will be obligated at the time of award and will not expire at the end of the fiscal year. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-C-0023).",
    "contract_date": "2025-08-04"
  },
  {
    "text": "BAE Systems Land & Armaments LP, Sterling Heights, Michigan, was awarded a $181,107,842 firm-fixed-price modification to a previously awarded contract (M67854-16-C-0006) for Amphibious Combat Vehicles (ACV). The total value of the contract, if all options are exercised, is $3,845,631,512. This contract modification provides for the exercise of options for the procurement of 31 full rate production ACV medium caliber cannon mission role variants and associated production, fielding and support costs, and spares. Work will be performed in York, Pennsylvania (60%); Aiken, South Carolina (15%); San Jose, California (15%); Sterling Heights, Michigan (5%); and Stafford, Virginia (5%) with an expected completion date of September 2027. Fiscal 2025 procurement (Marine Corps) funds in the amount of $181,107,842 will be obligated at the time of award and will not expire at the end of the current fiscal year. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-16-C-0006).",
    "contract_date": "2025-08-04"
  },
  {
    "text": "Moog Military Aircraft LLC, Elma, New York, is being awarded $96,646,355 for a firm-fixed-price contract for the repair or upgrade of various F/A-18E-G wingfold components. This is a five-year contract with no option periods. Work will be performed in Torrance, California (94%); North Island, California (4%); and East Aurora, New York (2%). Work is expected to be completed by July 31, 2031. No funding will be obligated at the time of award. Individual delivery orders will be funded with appropriate fiscal year working capital funds (Navy) at the time of their issuance and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 2304 (c)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity (N00383-25-D-P001).",
    "contract_date": "2025-08-04"
  },
  {
    "text": "General Atomics Aeronautical Systems Inc., Poway, California, is awarded a $19,274,696, firm-fixed-price and cost-plus-fixed-fee modification (P00002) to an order (N0001924F5559) against a previously issued basic ordering agreement (N0001922G0006). This order procures additional electronic warfare pods and ground control station spares in support of the marine air ground task force unmanned expeditionary medium altitude long endurance program for the Navy. Work will be performed in Greenville, Texas (50%); and Poway, California (50%), and is expected to be completed by September 2027. Fiscal 2025 aircraft procurement (Marine Corps) funds in the amount of $14,914,242; and fiscal 2024 aircraft procurement (Marine Corps) funds in the amount of $4,360,454, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-04"
  },
  {
    "text": "Lockheed Martin, Rotary and Mission Systems, Moorestown, New Jersey, was awarded a $18,753,155 cost-plus-incentive-fee modification to previously awarded contract (N00024-21-C-5127) for the development, implementation, and integration of a system security solution for the Australia Surface Combatant baseline configuration of the AEGIS combat system. This contract involves Foreign Military Sales (FMS) to the government of Australia. Work will be performed in Moorestown, New Jersey, and is expected to be completed by September 2031. FMS (Australia) funds in the amount of $11,000,000 (59%) will be obligated at the time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity. (Awarded Aug. 1, 2025)",
    "contract_date": "2025-08-04"
  },
  {
    "text": "Systems Planning & Analysis Inc., Alexandria, Virginia, was awarded a $11,866,132 firm-fixed-price modification to previously awarded contract (N00024-23-C-2103) for procurement of a supply chain improvement effort. Work will primarily be performed in Alexandria, Virginia and is expected to be completed by July 2026. Foreign partner funds in the amount of $11,866,132 will be obligated at time of award and will not expire at the end of the current fiscal year.  The Naval Sea Systems Command, Washington, D.C., is the contracting activity. (Awarded Aug. 1, 2025)",
    "contract_date": "2025-08-04"
  },
  {
    "text": "Raytheon Co., Tucson, Arizona, is awarded a $10,052,768 cost-plus-fixed-fee modification to a previously awarded contract (N00024-21-C-5434) for design agent engineering in support of the Evolved SeaSparrow Missile and NATO SeaSparrow Missile Systems programs. Work will be performed in Tucson, Arizona (73%); Portsmouth, Rhode Island (26%); and various other locations each less than 1% (1%), and is expected to be completed by December 2025. Fiscal 2025 other customer funds in the amount of $6,451,408 (33%); fiscal 2025 weapon procurement (Navy) funds in the amount of $5,494,239 (28%); fiscal 2024 other customer funds in the amount of $4, 652,283 (23%); fiscal 2025 operations and maintenance (Navy) funds in the amount of $1,372,113 (7%); fiscal 2023 other customer funds in the amount of $1,289,148 (7%);  fiscal 2025 research, development, test, and evaluation (Navy) funds in the amount of $275,000 (1%); fiscal 2021 other customer funds in the amount of $260,000 (1%); and Foreign Military Sales (Japan) funds in the amount of $16,814 (less than 1%), will be obligated at time of award and $1,372,113 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-04"
  },
  {
    "text": "Southwest Research Institute, San Antonio, Texas, has been awarded a $9,234,661 cost-plus-fixed-fee engineering change proposal contract modification (P00008) to a previously awarded contract (HR001123C0116) for the Cancun Phase Two Option One program. This contract modification provides for distributable nodes to measure the high frequency (HF) radio environment for improved warfighter situational awareness in the critical HF radio band. Work will be performed in San Antonio, Texas (66%); Utica, New York (14%); Seattle, Washington (15%); and Chapel Hill, North Carolina (5%), with an expected completion date of December 2027. Fiscal 2025 research, development, test, and engineering funds in the amount of $470,000 are being obligated at time of award. The base contract was a competitive acquisition under broad agency announcement HR001123S0014, and 10 offers were received. Defense Advanced Research Projects Agency, Arlington, Virginia, is the contracting activity",
    "contract_date": "2025-08-04"
  },
  {
    "text": "UPDATE: Wright & Wright Machinery Co. Inc.,* Monticello, Kentucky (SPE8EC-25-D-0054, $255,000,000), has been added as an awardee to the multiple award contract for material handling equipment, issued against solicitation SPE8EC-21-R-0001 and awarded July 22, 2022. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-08-04"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-04"
  }
]