[
  {
    "text": "Trust Automation Inc., San Luis Obispo, California, was awarded a maximum $490,000,000 ordering amount cost-plus-fixed-fee, completion, firm-fixed-price, indefinite-delivery/indefinite-quantity contract for software, hardware, and reports. This contract provides for rapid research, development, prototyping, demonstration, evaluation, production, and transition of unmanned aircraft system and counter-unmanned aircraft systems capabilities. Work will be performed at San Luis Obispo, California, and is expected to be completed by Aug. 20, 2030. This contract was a sole source acquisition. Fiscal 2025 procurement funds in the amount of $20,315,558 are being obligated under the first task order at time of award. The Air Force Research Laboratory, Rome, New York, is the contracting activity (FA8750-25-D-B002).",
    "contract_date": "2025-08-20"
  },
  {
    "text": "General Dynamics Information Technology, Falls Church, Virginia, was awarded a $40,394,279 Cost-Plus-Fixed-Fee contract for bioeffects research of directed energy exposures. This contract provides for research relevant to directed energy-based devices and systems to deliver accurate, evidence-based information to Department of Defense and industry stakeholders, national and international health and safety standards committees, and the public. Work will be performed at Joint Base San-Antonio, Texas, and is expected to be completed by Aug. 25, 2028, with two additional option years. Fiscal 2025 research, development, test and evaluation funds in the amount of $846,000 will be obligated at the time of award. The Air Force Research Laboratory, Warfighter Readiness and Interface Contracting Section, Wright-Patterson Air Force Base, Ohio is the contracting Activity (FA2384-25-C-B045).",
    "contract_date": "2025-08-20"
  },
  {
    "text": "BFBC LLC, Bozeman, Montana, was awarded a firm-fixed-price contract for design and construction of new protective barrier fencing, access gate installations, and roadway improvements. The amount of this action is $174,000,000 with a cumulative total face value of $230,895,000. Bids were solicited via the internet with four received. Work will be performed in San Luis, Arizona, with an estimated completion date of Aug. 18, 2026. Fiscal 2021 Section 2803 emergency military construction, Army funds; fiscal 2021 Section 2803 emergency military construction, Air Force funds; fiscal 2021 Section 2803 emergency military construction, Navy funds; fiscal 2021 Section 2803 emergency military construction; and fiscal 2021 Defense-wide funds in the amount of $174,000,000, were obligated at the time of the award. U.S. Army Corps of Engineers, San Francisco, California, is the contracting activity (W912PL-25-C-A004).  (Awarded on Aug. 15, 2025)",
    "contract_date": "2025-08-20"
  },
  {
    "text": "Vigor Works LLC, Vancouver, Washington, was awarded a cost-plus-fixed-fee contract for Maneuver Support Vessel Light systems technical support services. The amount of this action is $62,399,789. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 19, 2030. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W912CH-25-D-0063).",
    "contract_date": "2025-08-20"
  },
  {
    "text": "Automation Innovations LLC,* Tampa, Florida, was awarded a firm-fixed-price contract for field service representative support for Microwave Line of Sight. The amount of this action is $44,328,438. Bids were solicited via the internet with two received. Work will be performed in Kuwait, with an estimated completion date of Aug. 31, 2030. Fiscal 2010 operation and maintenance, Army funds in the amount of $44,328,438 were obligated at the time of the award. Army Contracting Command, Fort Huachuca, Arizona, is the contracting activity (W91RUS-25-C-A032).",
    "contract_date": "2025-08-20"
  },
  {
    "text": "Raytheon Intelligence & Space (Raytheon), McKenney, Texas, was awarded a $35,059,667 modification (P00017) to contract W909MY-23-C-0004 for manufacturing and delivery of B-Kits Thermal receiver units. The modification brings the total cumulative face value of the contract to $35,059,667. Work will be performed in McKenney, Texas, with an estimated completion date of May 30, 2028. Fiscal 2025 other procurement, Army funds in the amount of $35,059,667 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.",
    "contract_date": "2025-08-20"
  },
  {
    "text": "WisEngineering LLC,* Denville, New Jersey, was awarded a cost-plus-fixed-fee contract for program management, facility management, property management, administrative, logistics, security, software engineering, systems administration, and technical support. The amount of this action is $20,536,725. Bids were solicited via the internet with four received. Work will be performed at Picatinny Arsenal, New Jersey, with an estimated completion date of Aug. 19, 2028. Fiscal 2025 research, development, test and evaluation, Army funds in the amount of $443,811 were obligated at the time of the award. Army Contracting Command, Newark, New Jersey, is the contracting activity (W15QKN-25-F-A285).",
    "contract_date": "2025-08-20"
  },
  {
    "text": "Pond Constructors Inc., Peachtree Corners, Georgia, was awarded a $12,113,841 modification (P00002) to contract W912DY-24-F-0264 to perform recurring maintenance, and minor and emergency repairs at designated Defense Logistics Agency Energy fueling sites. The modification brings the total cumulative face value of the contract to $71,788,728. Work will be performed in Fort Smith, Little Rock Air Base, White Hall, and North Little Rock, Arkansas; Peachtree Corners, Georgia; Bossier Parish, and Pineville, Louisiana; Orogrande, New Mexico; Altus, Fort Sill, Braggs, Lexington, McAlester, Tulsa, Enid, and Oklahoma City, Oklahoma; Abilene, El Paso, Fort Sam Houston, Houston, Killeen, Laughlin Air Force Base, Randolph, Red River Army Depot, San Angelo, San Antonio, and Wichita Falls, Texas, with an estimated completion date of Sept. 9, 2025. Fiscal 2025 revolving funds in the amount of $12,113,841 were obligated at the time of the award. U.S. Army Corps of Engineers' Engineering and Support Center, Huntsville, Alabama, is the contracting activity.",
    "contract_date": "2025-08-20"
  },
  {
    "text": "Great Lakes Dredge & Dock Co. LLC, Houston, Texas, was awarded a $11,687,740 modification (P00004) to contract W9127S-22-D-0026 for station dredging. The modification brings the total cumulative face value of the contract to $46,859,160. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 19, 2006. U.S. Army Corps of Engineers, Little Rock, Arkansas, is the contracting activity.",
    "contract_date": "2025-08-20"
  },
  {
    "text": "Black Hills Ammunition Inc.,* Rapid City, South Dakota, is being awarded a $40,000,000 firm-fixed price, indefinite-delivery/indefinite-quantity contract for 6.5mm Creedmoor cartridge special ball long range ammunition, Department of Defense Identification Code AC58. This contract does not include options. Work will be performed in Rapid City, South Dakota, and is expected to be completed by August 2030. Fiscal 2025 procurement of ammunition (Navy and Marine Crops) funding in the amount of $968,348 (2%) will be obligated at the time of award, which will not expire at the end of the current fiscal year. This contract was competitively procured on the basis of 100% Small Business Set-Aside and six offers were received via the procurement integrated enterprise environment solicitation module. Naval Surface Warfare Center, Crane Division, Crane, Indiana, is the contract activity (N0016425DJN20).",
    "contract_date": "2025-08-20"
  },
  {
    "text": "General Dynamics Mission Systems, Manassas, Virginia, is awarded a $15,331,729 cost-plus-incentive fee, cost-plus-fixed fee, and cost only contract for shipset production, engineering, and installation support to perform software and hardware systems development, production, and platform installations. This contract includes options which, if exercised, would bring the cumulative value to $91,140,416. Work will be performed in Manassas, Virginia (30%); Groton, Connecticut (25%); Las Vegas, Nevada (25%); Port Orchard, Washington (10%); Chesapeake, Virginia (4%); Pearl Harbor, Hawaii (2%); San Diego, California (2%); and Kings Bay, Georgia (2%), and is expected to be completed by August 2026. If all options are exercised, work will continue through August 2030. Fiscal 2025 other procurement (Navy) funds in the amount of $999,715 (83%); and fiscal 2020 shipbuilding and conversion (Navy) funds in the amount of $208,306 (17%), will be obligated at time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured pursuant to 10 U.S. Code 3204(a)(5). Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-6260).",
    "contract_date": "2025-08-20"
  },
  {
    "text": "Clarke Power Services Inc., Henderson, Kentucky, has been awarded an estimated $30,595,255 firm-fixed-price indefinite-delivery/indefinite-quantity contract for Family of Medium Tactical Vehicle transmissions. A delivery order (SPRDL1-25-F-0172) was also executed at the time of award. This was a competitive acquisition with one response received. This is a three-year contract with no option periods. The ordering period end date is Aug. 18, 2028. Using military service is Army. Type of appropriation is fiscal 2025 through 2028 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan (SPRDL1-25-D-0050).",
    "contract_date": "2025-08-20"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-20"
  }
]