[
  {
    "text": "Advanced Integrated Technologies LLC,* Norfolk, Virginia (N00024-25-D-4325); Auxiliary Systems Inc.,* Norfolk, Virginia (N00024-25-D-4326); BAE Systems Norfolk Ship Repair Inc., Norfolk, Virginia (N00024-25-D-4328); Colonna's Shipyard Inc.,* Norfolk, Virginia (N00024-25-D-4329); Delphinus Engineering Inc.,* Newtown Square, Pennsylvania (N00024-25-D-4330); East Coast Repair & Fabrication LLC,* Newport News, Virginia (N00024-25-D-4331);  Epsilon System Solutions Inc.,* Portsmouth, Virginia (N00024-25-D-4332); General Dynamics Information Technology Inc., Falls Church, Virginia (N00024-25-D-4334); Metro Machine Corp., Norfolk, Virginia (N00024-25-D-4335); GI Industrial Marine LLC,* Portsmouth, Virginia (N00024-25-D-4336); HII Mission Technologies Corp., McLean, Virginia (N00024-25-D-4337); IMIA LLC, Spanish Fort, Alabama (N00024-25-D-4338); MIKEL Inc.,* Middletown, Rhode Island (N00024-25-D-4339); MOOG Military Aircraft LLC, Elma, New York (N00024-25-D-4340); Neal Technologies Innovation LLC,* Daphne, Alabama (N00024-25-D-4341);  Oceaneering International Inc., Chesapeake, Virginia (N00024-25-D-4342); Pacific Armada NW LLC,* San Diego, California (N00024-25-D-4344); Pacific Shipyards International LLC,* Honolulu, Hawaii (N00024-25-D-4345); Propulsion Controls Engineering LLC,* Everett, Washington (N00024-25-D-4346); QED Systems Inc.,* Virginia Beach, Virginia (N00024-25-D-4347); Riley Power Group LLC,* Rock Hill, South Carolina (N00024-25-D-4348); Southcoast Welding & Manufacturing LLC,* Chula Vista, California (N00024-25-D-4349); Standard Inspection Services,* National City, California (N00024-25-D-4350); Tecnico Corp.,* Chesapeake, Virginia (N00024-25-D-4351); and VT Milcom Inc., Virginia Beach, Virginia (N00024-25-D-4352), are awarded a combined $1,123,590,000 firm-fixed-price, cost-plus-fixed-fee, and cost-only, indefinite-delivery/indefinite-quantity, multiple award contract for discrete production, non-discrete production and other production work to support the public shipyards in accomplishing repair, maintenance, and modernization of nuclear-powered attack submarines undergoing scheduled Chief of Naval Operations maintenance availabilities. These contracts include options which, if exercised, would bring the cumulative value to $1,906,010,000 over an eight-year period to the 25 vendors combined. Work will be performed in Norfolk, Virginia (35%); Bremerton, Washington (25%); Kittery, Maine (20%); and Pearl Harbor, Hawaii (20%), and is expected to be completed by August 2030. If all options are exercised, work will continue through August 2033. No funds will be obligated at the time of the award; funds will be obligated at the delivery order level as contracting actions occur. This contract was competitively procured via the System for Award Management website, with 29 offers received. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Raytheon Missiles and Defense, Tucson, Arizona, is awarded a not-to-exceed $380,000,000 firm-fixed-price and cost-plus-fixed-fee undefinitized contract action modification to a previously awarded contract M67854-25-C-0111 for Medium Range Intercept Capability (MRIC). The total cumulative face value of the contract is $412,519,000. The contract modification is for the full rate production scope of the MRIC requirement. This work will be performed in Tucson, Arizona, with an expected completion date of Aug 28, 2028. Fiscal 2025 procurement (Marine Corps) funds in the amount of $70,000,000 are obligated at the time of award. Contract funds in the amount of $70,000,000 will not expire at the end of the current fiscal year. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Epsilon Systems Solutions Inc.,* San Diego, California, is awarded a $28,739,427 cost-plus-fixed fee contract to provide a full range of technical and repair support services for the Southwest Regional Maintenance Center's product family divisions. This contract includes options which, if exercised, would bring the cumulative value of this contract to $164,310,172 over a five-year period. Base year work will be performed in San Diego, California, and is expected to be completed by September 2026. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $2,394,907 will be obligated at the time of award and will expire at the end of the current fiscal year. This contract was a competitive acquisition, and one offer was received following a solicitation posted to SAM.gov. Southwest Regional Maintenance Center, San Diego, California, is the contracting activity (N55236-25-C-0007).",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Aviation Systems Engineering Co. Inc., Lexington Park, Maryland, is awarded a $26,957,807 modification (P00011) to a previously awarded cost-plus-fixed-fee, cost reimbursable, indefinite-delivery/indefinite-quantity contract (N0042120D0123). This modification exercises an option to provide continued program management support for airborne anti-submarine warfare legacy, new acoustic and non-acoustic sensors, systems, and subsystems for naval air platforms in support of improving existing maritime patrol and reconnaissance mission systems for the Navy. Work will be performed in Patuxent River, Maryland (90%); and Lexington Park, Maryland (10%), and is expected to be completed in March 2026. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. This contract was competed. Naval Air Warfare Center Aircraft Division Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Leidos Inc., Reston, Virginia, is awarded a $12,411,208 modification (P00022) to a previously awarded cost-plus-fixed-fee contract (N0001919C0051). This modification adds scope to provide for the integration of required updates to the systems requirements document critical to the functionality of the ALQ-214 system using the Adaptive Radar Countermeasure software in support of enhancing F/A-18 survivability against modern threats Work will be performed in Reston, Virginia (47%); Clifton, New Jersey (40%); and Goleta, California (13%), and is expected to be completed in September 2026. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $9,349,290 will be obligated at time of award, none of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Aviation Systems Engineering Co. Inc., Lexington Park, Maryland, is awarded a $8,109,974 firm-fixed-price contract to provide maintenance and flight operations training support for the P-8A Poseidon aircraft in support of the Republic of Korea Navy, achieving and maintaining operational capability, as well as pilot and maintainer proficiency in addition to pilot currency. Additionally, this contract provides for the development of additional personal qualification standards, updates to outdated maintenance curriculum, and updates to aircrew courseware to include latest mission capabilities. Work will be performed in Jacksonville, Florida (75%); Pohang, South Korea (10%); and Seoul, Korea (15%), and is expected to be completed in September 2028. Foreign Military Sales customer funds in the amount of $8,109,974 will be obligated at the time of award, none of which expire at the end of the current fiscal year. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity (N0001925C0116).",
    "contract_date": "2025-09-02"
  },
  {
    "text": "US Marine Management, Norfolk, Virginia, is awarded a firm-fixed-price modification under contract N3220523C4035, which is contract for the services of the oil tanker MT Badlands Trader. The modification adds a capability to refuel USS and allied vessels at sea. The capability will be installed no later than February 2026. The place of performance is worldwide. Military Sealift Command, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "American Engineering Corp., Okinawa, Japan (FA5270-25-D-0024); CMS  K.K., Okinawa, Japan (FA5270-25-D-0025); Fuji Construction Co. Ltd., Okinawa, Japan (FA5270-25-D-0026); Gilbane Japan GK, Tokyo, Japan (FA5270-25-D-0027); Kashiwabara Corp., Yamaguchi, Japan (FA5270-25-D-0028); Kyudenko – Yabu JV, Fukuoka, Japan (FA5270-25-D-0029); Kyunan Co. Ltd., Miyazaki, Japan (FA5270-25-D-0030); Maeda-Onaka JV, Okinawa, Japan (FA5270-25-D-0031); Nippo Corp., Tokyo, Japan (FA5270-25-D-0032); Sekitokyu Kogyo Co. Ltd, Tokyo, Japan (FA5270-25-D-0033); Sumiju Yokosuka Kogyo Co., Ltd., Kanagawa, Japan (FA5270-25-D-0034); TECC Corp., Kanagawa, Japan (FA5270-25-D-0035); TOA-KGC JV, Okinawa, Japan (FA5270-25-D-0036); Yugen Kaisha Yamauchi Gumi, Okinawa, Japan (FA5270-25-D-0037); and Sankyo Denki Ohna Denken JV (FA5270-25-D-0041), have been awarded a ceiling $995,000,000 firm-fixed-price, multiple award, indefinite-delivery/indefinite-quantity contract for the Okinawa multiple award construction contract. This contract provides for a wide range of construction projects, both on and off military installations, across Okinawa, Japan. Work will be performed in Okinawa, Japan, and is expected to be completed by Sept. 1, 2030. This contract was a competitive acquisition, and 15 offers were received. Fiscal 2025 operation and maintenance funds in the amount of $500 will be obligated to each awardee at the time of award. The 18th Contracting Squadron, Kadena Air Base, Okinawa, Japan, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "The Boeing Co., Oklahoma City, Oklahoma, has been awarded a $20,610,145 contract award for the Japan E-767 Airborne Warning and Control System Multifunctional Information Distribution System – Joint Tactical Radio System. This contract provides for pilots, ferry flights, lab access and support, and testing for the Multifunctional Information Distribution System – Joint Tactical Radio System Upgrade. Work will be performed in Oklahoma City, Oklahoma, and is expected to be completed by Feb. 14, 2029. This contract involves Foreign Military Sales (FMS) to Japan. This contract was a sole source acquisition. FMS funds in the amount of $18,916,071 are being obligated at time of award. The Air Force Life Cycle Management Center, Hanscom Air Force Base, Massachusetts, is the contracting activity (FA2363-25-C-B003).",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Robbins-Gioia LLC, Alexandria, Virginia, was awarded a maximum $8,793,842 firm-fixed-price follow-on contract, including options, for the program depot maintenance scheduling system. This contract provides services for sustainment, program and status reporting, schedule collaboration, interface sustainment, end-user support at Air Logistic Complexes and the Air Force Sustainment Command Headquarters, and software requirements. Work will be performed at Alexandria, Virginia, and is expected to be completed by July 31, 2027. This contract was a sole source acquisition. Fiscal 2025 operations and maintenance funds; and working capital funds in the amount of $2,152,766, were obligated at time of award. The Air Force Life Cycle Management Center, Wright-Patterson Air Force Base, Ohio, is the contracting activity (FA877025CB007). (Awarded Aug. 15, 2025)",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Lockheed Martin RMS, Owego, New York, has been awarded a maximum $56,406,399 firm-fixed-price, fixed-quantity contract for B-2 countermeasure receivers. This was a sole-source acquisition using justification 10 U.S. Code 3204 (c)(1), as stated in Federal Acquisition Regulation 6.301-1. This is a six-year contract with no option periods. The performance completion date is Aug. 31, 2031. Using military service is Air Force. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation, Oklahoma City, Oklahoma (SPRTA1-25-C-0009).",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Dominion Energy South Carolina Inc., Cayce, South Carolina, has been awarded an estimated $25,222,626 modification (P00062) to a 50‐year contract (SP0600‐18‐C‐8326) with no option periods to incorporate tariff rate adjustments as authorized by the South Carolina Public Service Commission. The performance completion date is Nov. 18, 2069. Using military service is Army. Type of appropriation is fiscal 2025 through 2070 Army operations and maintenance funds. The contracting activity is the Defense Logistics Agency Energy, Fort Belvoir, Virginia.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Michigan Church Supply Co. Inc.,* Mount Morris, Michigan, has been awarded a maximum $8,500,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for the supply of Christian religious equipment and supplies. This was a competitive acquisition with one response received. This is a five-year contract with no option periods. The ordering period end date is Aug. 28, 2030. Using military services are Army, Navy, Air Force, Space Force, Marine Corps, and Coast Guard. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-0088). (Awarded on Aug. 29, 2025)",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Airgas USA LLC, Kennesaw, Georgia, has been awarded an estimated $7,522,323 firm-fixed-price requirements contract for aviator's breathing oxygen, liquid oxygen, liquid nitrogen, and liquid argon. This was a competitive acquisition with five responses received. This is a five-year contract with no option periods. Locations of performance are Alabama, Florida, Georgia, and Virginia, with a June 30, 2030, performance completion date. Using military services are Air Force, Army, Marine Corps, and Navy. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Energy Aerospace, San Antonio, Texas (SPE601-25-D-1515). (Awarded on Aug. 29, 2025)",
    "contract_date": "2025-09-02"
  },
  {
    "text": "The SeaCube Leasing International Inc., Montvale, New Jersey (HTC71124DW028/P00005); Textainer Equipment Management (U.S.) Ltd., San Francisco, California (HTC71124DW029/P00004); and Triton Container International Ltd., Hamilton, Bermuda (HTC71124DW030/P00004), have been awarded modifications to an indefinite-delivery/indefinite-quantity, fixed price contract, with an estimated value of $45,700,000. This brings the total cumulative face value of the program to $91,492,873. This contract is to obtain intermodal equipment leasing and transportation services, information technology management in support of leasing operations, and related container support functions to meet the government missions and exercises for peacetime, contingency, disaster, and humanitarian operations on a global basis, to include maintenance, repair, inspection, leasing, and acquisition of intermodal equipment. The option period of performance is from Sept. 1, 2025, to Aug. 31, 2026. Operations and maintenance funds will be obligated for fiscal 2025 and 2026. The U.S. Transportation Command, Directorate of Acquisition, Scott Air Force Base, Illinois, is the contracting activity. (Awarded Aug. 25, 2025)",
    "contract_date": "2025-09-02"
  },
  {
    "text": "International Communication Associates, Arlington, Virginia, was awarded a $41,000,000 time-and-materials contract to provide foreign language instructor training support for the Defense Language Institute Foreign Language Center through Defense Language Institute Washington.  Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Oct. 5, 2030. Army Field Directorate Office, Fort Eustis, Virginia, is the contracting activity (W911S0-25-D-0003).",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Diplomatic Language Services, Arlington, Virginia, was awarded a $41,000,000 time-and-materials contract to provide foreign language instructor training support for the Defense Language Institute Foreign Language Center through Defense Language Institute Washington. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of Oct. 5, 2030. Army Field Directorate Office, Fort Eustis, Virginia, is the contracting activity (W911S0-25-D-0004).",
    "contract_date": "2025-09-02"
  },
  {
    "text": "International Center for Language Studies, Washington, D.C., was awarded a $41,000,000 time-and-materials contract to provide foreign language instructor training support for the Defense Language Institute Foreign Language Center through Defense Language Institute Washington. Bids were solicited via the internet with four received. Work locations and funding will be determined with each order, with an estimated completion date of Oct. 5, 2030. Army Field Directorate Office, Fort Eustis, Virginia, is the contracting activity (W911S0-25-D-0002).",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Dubuque Barge and Fleeting Service Co.,* Dubuque, Iowa (W9128F-25-D-A018); Midwest Construction Co.,* Nebraska City, Nebraska (W9128F-25-D-A019); W.A. Ellis Construction Co.,* Independence, Missouri (W9128F-25-D-A020); Western Contracting Corp.,* Sioux City, Iowa (W9128F-25-D-A021); and Bloomsdale Excavating Co. Inc.,* Bloomsdale, Missouri (W9128F-25-D-A022), will compete for each order of the $49,000,000 firm-fixed-price contract for construction in support of the Missouri River Bank Stabilization and Navigation Project. Bids were solicited via the internet with six received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 1, 2030. U.S. Army Corps of Engineers, Omaha District, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Seaside Engineering & Surveying LLC,* Baker, Florida (W9127S-25-D-A002); Consolidated Land Services Inc.,* Mountain Home, Arkansas (W9127S-25-D-A006); and RLC LLC, doing business as, Renaissance Infrastructure Consulting,* St. Simons Island, Georgia (W9127S-25-D-A007), will compete for each order of the $30,000,000 firm-fixed-price contract for architect-engineering services. Bids were solicited via the internet with six received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 31, 2030. U.S. Army Corps of Engineers, Little Rock District, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Torch Technologies Inc., Huntsville, Alabama, was awarded a $12,740,969 modification (P00022) to contract W31P4Q-23-F-B002 for Option Three under the Security Assistance Management Directorate Homing All the Way Killer Project Office. The modification brings the total cumulative face value of the contract to $12,740,969. Work will be performed in Redstone Arsenal, Alabama, with an estimated completion date of Sept. 3, 2026. Fiscal 2025 Foreign Military Sales funds from Australia, Bahrain, Egypt, Greece, Japan, Jordan, Qatar, Saudi Arabia, Spain, Taiwan, Ukraine, the United Arab Emirates, and the United Kingdom; and operations and maintenance, Army funds in the amount of $12,740,969, were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Maverick Constructors LLC,* Opelousas, Louisiana, was awarded a $9,800,875 firm-fixed-price contract (W912P8-25-C-A003) for the execution of the Calcasieu River and Pass Dredged Material Management Plan. Bids were solicited via the internet with nine received. Work will be performed in Cameron Parish, Louisiana, with an estimated completion date of Oct. 30, 2026. Fiscal 2023 construction, Corps of Engineers, civil funds in the amount of $9,800,875 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans District, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Cherokee Nation Defense Solutions LLC, Tulsa, Oklahoma, will be awarded an indefinite-delivery/indefinite-quantity and firm-fixed price contract with time-and-material contract line items for travel (H9821025DE002). The contract value is $27,426,387, which includes a five-year ordering period. The purpose of this is for the contractor to provide administrative and customer support services to ensure operational effectiveness. Service and support provided include, but are not limited to, project management oversight and administrative support, office clerical assistant support, and information management support. Work will be performed in Alexandria, Virginia; Seaside, California; and Fort Knox, Kentucky, with and period of performance of Sept. 8, 2025, through Sept. 7, 2030. The government's requirement for enterprise administrative services was solicited as a direct 8(a) sole-source award to Cherokee Nation Defense Solutions LLC. The task orders issued under this contract will be funded with operations and maintenance dollars. As defined in Federal Acquisition Regulation 17.1, this is not a multiyear contract. Defense Human Resources Activity, Alexandria, Virginia, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "Guardian Defense Group, Inc., Alexandria, Virginia, was awarded a ceiling $9,324,226 firm-fixed-price, indefinite-delivery/indefinite-quantity contract (H9223925DE003) for psychological assessment support services for U.S. Army Special Operations Command (USASOC) for a base period of 10.5 months and four 12-month ordering periods. These services shall be conducted in support of, and in coordination with, major command elements and USASOC subordinate units that include, but are not limited to, the John F. Kennedy Special Warfare Center and School, the 1st Special Forces Command, the 75th Ranger Regiment, and the 160th Special Operations Regiment, as well as other Army Special Operations Forces units as required. The contractor may also provide psychological services in support of and in coordination with other U.S. Special Operations Command components. This award consists of a guaranteed minimum of $100,000 during the base period. Fiscal 2025 Major Force Program 11 funds in the amount of $1,107,700 are obligated at the time of the award. The work will be performed at Fort Bragg, North Carolina; Fort Campbell, Kentucky; Joint Base Lewis McChord, Washington; Fort Benning, Georgia; Hunter Army Airfield, Georgia; Camp Merrill, Georgia; Richmond, Virginia; Fort Walker, Virginia; Virginia Beach, Virginia; Elgin Air Force Base, Florida; Fort Carson, Colorado; and other continental U.S. locations. This contracting action was a competitive service-disabled veteran-owned small business set-aside, best value trade-off source selection. USASOC, Fort Bragg, North Carolina, is the contracting activity.",
    "contract_date": "2025-09-02"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-09-02"
  }
]