[
  {
    "text": "Owl Cyber Defense Solutions LLC, Columbia, Maryland, was awarded a maximum $150,000,000 indefinite-delivery/indefinite-quantity contract for research and development. This contract provides for the delivery of several software releases, including completion and transition of Voice and Video Cross Domain Solution, XD Vision, and Cross Domain Full Motion Video to the Minerva user community, to include computer software, technical documentation, hardware, and installation and maintenance of the current systems located at existing customer sites. Work will be performed at Columbia, Maryland, and is expected to be completed by July 29, 2030. This contract was the result of a sole source acquisition under the Small Business Innovation Research Program. Fiscal 2025 research, development, test and evaluation funds in the amount of $10,000 are being obligated at the time of award. The Air Force Research Laboratory, Rome, New York, is the contracting activity (FA8750-25-D-B003).",
    "contract_date": "2025-07-29"
  },
  {
    "text": "AM General LLC, South Bend, Indiana, was awarded a $126,531,778 modification (P00023) to contract W912CH-24-F-0229 for M1165A1B3 HMMWV vehicles. The modification brings the total cumulative face value of the contract to $3,050,585,536. Work will be performed in South Bend, Indiana, with an estimated completion date of Aug. 28, 2027. Fiscal 2025 other procurement, Army funds in the amount of $126,531,778 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity. (Awarded June 28, 2025)",
    "contract_date": "2025-07-29"
  },
  {
    "text": "Amentum/DynCorp International, Fort Worth, Texas, was awarded a $70,662,146 modification (P00008) to contract W58RGZ-24-C-0026 for maintenance support services. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2026. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-07-29"
  },
  {
    "text": "cBEYONData LLC, Arlington, Virginia, was awarded a $17,732,287 firm-fixed-price contract for Enterprise Resource Planning Systems and Enterprise Business System Convergence. Bids were solicited via the internet with four received. Work will be performed at the Pentagon with an estimated completion date of July 28, 2030. Fiscal 2025 research, development, test and evaluation, Army funds in the amount of $3,300,000 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W91CRB-25-C-A010). (Awarded June 28, 2025)",
    "contract_date": "2025-07-29"
  },
  {
    "text": "DZSP 21 LLC, Chantilly, Virginia, is awarded a $115,954,444 cost-plus-award-fee modification to a previously awarded contract (N40192-23-C-5300) for base operations support services. This award brings the cumulative face value of the contract to $848,892,639. This modification provides for the exercise of Option Five for base operating support services at Navy, Marine Corps, and Air Force installations in the Joint Region Marianas area of responsibility. Work will be performed in Guam and is expected to be completed by July 2026. Fiscal 2025 operations and maintenance (O&M) (Navy) funds; fiscal 2025 O&M (Marine Corps) funds; and fiscal 2025 O&M (Defense) funds, in the amount of $53,280,434, will be obligated at time of award, and funds will expire at the end of the current fiscal year. The Naval Facilities Engineering Systems Command, Marianas, Guam, is the contracting activity.",
    "contract_date": "2025-07-29"
  },
  {
    "text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a not-to-exceed $92,900,000 modification (P00002) to a previously awarded fixed-price incentive (firm-target) undefinitized contract (N0001925C0070). This modification adds scope to procure long lead materials, parts, components, and associated support in support of the F-35 Lot 21 production aircraft for non-U.S. Department of Defense (DOD) partners and Foreign Military Sales (FMS) customers. Work will be performed Fort Worth, Texas (59%); El Segundo, California (14%); Warton, United Kingdom (9%); Cameri, Italy (4%); Orlando, Florida (4%); Nashua, New Hampshire (3%); Baltimore, Maryland (3%); San Diego, California (2%); and other various locations outside of the continental U.S. (2%), and is expected to be completed May 2031. FMS customer funds in the amount of $74,800,000; and non-U.S. DOD partner funds in the amount of $18,100,000, will be obligated at the time of award, none of which expire at the end of the current fiscal year. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity",
    "contract_date": "2025-07-29"
  },
  {
    "text": "Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a cost-plus-fixed-fee $72,107,096 contract to provide agile software development required to enhance the functionality of combat data systems common reprogramming tool minimum viable capability release to support F-35 Lightning II air system capabilities and configurations for the Air Force, Marine Corps, Navy, and non-U.S. Department of Defense (DOD) partners. Work will be performed Fort Worth, Texas (90%); and Eglin Air Force Base, Florida (10%), and is expected to be completed December 2028. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $2,000,002; fiscal 2025 research, development, test and evaluation (Air Force) funds in the amount of $2,000,000; and non-U.S. DOD partner funds in the amount of $890,876, will be obligated at the time of award, none of which expire at the end of the current fiscal year. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity (N0001925C0068).",
    "contract_date": "2025-07-29"
  },
  {
    "text": "Raytheon Co., Tucson Arizona, is awarded a $67,550,000 firm-fixed-price modification to previously awarded contract N00024-24-C-5408 for Evolved Seasparrow Missile Blk 2 guided missile assemblies. Work will be performed in Tucson, Arizona (12%); Edinburgh, Australia (11%); Mississauga, Canada (10%); San Jose, California (9%); Raufoss, Norway (9%); Hengelo OV, Netherlands (5%); Ottobrunn, Germany (5%); Cambridge, Canada (4%); Nashua, New Hampshire (4%); Koropi Attica, Greece (3%); Lystrup, Denmark (2%); Ankara, Turkey (2%); Andover, Massachusetts (2%); Torrance, California (2%); Westlake Village, California (2%); Grenaa, Denmark (2%); Eight Mile Plains Brisbane, Australia (2%); Canton, New York (1%); Camden, Arkansas (1%); Aranjuez, Spain (1%); Milwaukie, Oregon (1%); and various other locations each less than 1% (10%), and is expected to be completed by September 2030. Fiscal 2025 other customer funds in the amount of $67,550,000 will be obligated at the time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(4). Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-29"
  },
  {
    "text": "CIRCOR Naval Solutions LLC, Warren, Massachusetts, is awarded a not-to-exceed $40,000,000, for a firm-fixed-price, undefinitized contract action for the procurement of 20 trim and drain pumps used on Virginia Class submarines. This is a stand-alone contract with no options. All work will be performed in Warren, Massachusetts, and is expected to be completed by January 2029. Working capital funds (Navy) in the amount of $19,600,000 will be obligated at time of the award, and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement with one offer received. Naval Supply Systems Command Weapon Systems Support, Mechanicsburg, Pennsylvania, is the contracting activity (N00104-25-C-ZA19).",
    "contract_date": "2025-07-29"
  },
  {
    "text": "The Boeing Co., St. Louis, Missouri, was awarded a $37,909,683 firm-fixed-price order (N6134025F8000) against a previously issued basic ordering agreement (N0001921G0006). This order is to provide the Simulator Integration Kits (SIKs) and long lead items/hardware for the P-8A Canada Training Systems. This effort will include contractor effort to plan, coordinate, schedule, procure, package and deliver the P-8A SIKs and other long lead hardware; as well as conducting inventory events and providing facilities requirements support. These SIKs and hardware will support the development and manufacture of operational flight trainers, weapons tactics trainers, part task trainers, training systems support centers, virtual maintenance trainers, a maintenance support cabinet, and electronic classrooms. Work will be performed in Huntington Beach, California (62%); St. Louis, Missouri (25%); various other locations within the continental U.S (10%); Tampa, Florida (2%); and Greenwood, Nova Scotia, and Comox, British Columbia (1%), and is expected to be completed in November 2029. Foreign Military Sales funds in the amount of $37,909,683 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This order was not competed. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity.",
    "contract_date": "2025-07-29"
  },
  {
    "text": "The Boeing Co., Seattle, Washington, is awarded a $19,992,491 cost-plus-fixed-fee order (N0001925F0027) against a previously issued basic ordering agreement (N0001921G0006). This order provides non-recurring engineering in support of the integration of Second Generation Antijam Tactical Ultra-High Frequency Radio Waveform on the P-8A Poseidon platform. Work will be performed in Seattle, Washington (90%); Patuxent River, Maryland (5%); and Jacksonville, Florida (5%), and is expected to be completed in December 2028. Fiscal 2025 aircraft procurement (Navy) funds in the amount of $19,992,491 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This order was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-07-29"
  },
  {
    "text": "Andantech Professional Corp.,* Gainesville, Florida, was awarded a $14,800,000 firm-fixed-price, indefinite-delivery/indefinite-quantity requirements contract for the development of large-scale circuit designs for various image-sensor, memory, and computation-logic components that will be used as part of a high-throughput, low-power, low-bandwidth vision sensor with reconfigurable analog processing logic called the autonomous vision sensor. Work will be performed in Gainesville, Florida, and is expected to be completed by July 2031. If all options are exercised, work will continue through July 2031. This contract will be funded from fiscal research, development, testing, and evaluation of 2026-2031 funds by delivery order with a ceiling of $14,800,000. There will be no funding assigned at the time of this award. This contract was not competitively procured via the Sam.gov, in accordance with 10 U.S. Code 3204(a)(1) and Federal Acquisition Regulation 6.302-1 — only one responsible source and no other supplies or services will satisfy agency requirements. Naval Surface Warfare Center, Panama City Division, Panama City, Florida, is the contracting activity (N6133125D0007).",
    "contract_date": "2025-07-29"
  },
  {
    "text": "BAE Systems Land & Armaments L.P., Minneapolis, Minnesota, is awarded a $9,216,354 cost-plus-fixed-fee modification to previously awarded contract (N6339421C0008) to exercise options for design agent engineering and technical specialized support services for legacy rotating Guided Missile Launching Systems. Work will be performed in Taiwan (85%); and Minneapolis, Minnesota (15%), and is expected to be completed by July 2026. Fiscal 2025 other procurement (Navy) funds in the amount of $1,210,800 (70%); fiscal 2025 operation and maintenance (Navy) funds in the amount of $375,000 (21%); and Foreign Military Sales funds in the amount of $152,500 (9%), will be obligated at time of award; and funds in the amount of $375,000 will expire at the end of the current fiscal year. Naval Surface Warfare Center Port Hueneme Division, Port Hueneme, California, is the contracting activity.",
    "contract_date": "2025-07-29"
  },
  {
    "text": "Zygos Consulting LLC, Arlington, Virginia, is awarded an $18,446,701 firm-fixed-price contract (HT001525C0003) for advisor support services that provides recommendations for support to management, assists supervision, support technical direction, and support coordination of acquisition actions, reporting, analytical activities, support reviews and support recommendations for acquisition policies, coordinates acquisition activities, analyzes and measures probable effects of various acquisition strategies, make recommendations on acquisition strategies, and streamlining on IT products and services. This is a 12-month base contract with four 12-month option periods, with a July 22, 2030, performance completion date. Base year funding is fiscal 2025 operations and maintenance funds in the amount of $2,146,418 obligated at time of award. Place of performance is San Antonio, Texas and Falls Church, Virginia. The Defense Health Agency, Enterprise Medical Services Contracting Division, San Antonio, Texas, is the contracting activity. (Awarded July 18, 2025)",
    "contract_date": "2025-07-29"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-29"
  }
]