[
  {
    "text": "Boeing, Mesa, Arizona, was awarded a $343,988,969 modification (P00033) to a contract (W58RGZ-21-C-0015) to exercise options for remanufactured aircraft and associated support. The modification brings the total cumulative face value of the contract to $3,430,883,832. Work locations and funding will be determined with each order, with an estimated completion date of Dec. 31, 2027. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Mike Hooks LLC, Westlake, Louisiana, was awarded a $49,000,000 firm-fixed-price contract for the rental of a cutterhead pipeline dredge with attendant plant and operators for maintenance dredging. Bids were solicited via the web with three received. Work locations and funding will be determined with each order, with an estimated completion date of Nov. 4, 2026. U.S. Army Corps of Engineers, Mobile District, is the contracting activity (W91278-25-D-A034).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Granite Construction Co., Watsonville, California, was awarded a $39,330,400 firm-fixed-price contract for levee and floodwall construction. Work will be performed in Watsonville, California, with an estimated completion date of Sept. 11, 2027. Fiscal 2022 Infrastructure Investment and Jobs Act funds in the amount of $39,330,400 were obligated at the time of the award. U.S. Army Corps of Engineers, San Francisco District, is the contracting activity (W912P7-25-C-A018).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Caterpillar Inc., Irving, Texas, was awarded a $24,890,967 modification (P00016) to contract (W91CRB-20-D-0005) for the purchase of Caterpillar spare parts. The modification brings the total cumulative face value of the contract to $34,627,913. Work locations and funding will be determined with each order, with an estimated completion date of Dec. 31, 2025. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "4K Global - ACC MP LLC, Martinez, Georgia, was awarded a $9,618,269 firm-fixed-price contract for arms room construction. Bids were solicited via the web with two received. Work will be performed at Fort Bragg, North Carolina, with an estimated completion date of Sept. 20, 2027. Fiscal 2025 military construction, defense-wide funds in the amount of $9,618,269 were obligated at the time of the award. U.S. Army Corps of Engineers, Wilmington District, is the contracting activity (W912PM-25-C-0036).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Aleut Construction LLC,* Reston, Virginia, was awarded a $9,377,998 firm-fixed-price contract for the repair and renovation. Bids were solicited via the web with seven received. Work will be performed at Robins Air Force Base, Georgia, with an estimated completion date of April 30, 2027. Fiscal 2025 military construction, Army funds in the amount of $9,377,998 were obligated at the time of the award. U.S. Army Corps of Engineers, Savannah District, is the contracting activity (W912HN-25-C-4004).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Galvion LTD, Portsmouth, New Hampshire, was awarded a $9,150,000 firm-fixed-price contract for protective personnel equipment helmets. Bids were solicited via the web with one received. Work will be performed in Portsmouth, New Hampshire, with an estimated completion date of Aug. 24, 2026. Fiscal 2025 Foreign Military Sales (Chile) funds in the amount of $9,150,000 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W91CRB-25-C-A012).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "TeamGov Inc.,* Hyattsville, Maryland, was awarded a $7,839,980 firm-fixed-price contract for comprehensive equipment maintenance. The modification brings the total cumulative face value of the contract to $35,691,300. Bids were solicited via the web with four received. Work will be performed in Aberdeen, Adelphi, Fort Detrick, and Fort Meade, Maryland; Natick, Massachusetts; Warren, Michigan; Picatinny Arsenal, New Jersey; Brooklyn, Fort Drum, Watervliet, and West Point, New York; Columbus, Ohio; Carlisle, Pennsylvania; and Fort Belvoir, Fort Gregg-Adams, Fort Myer, Fort Walker, and Radford, Virginia, with an estimated completion date of Sept. 4, 2026. Fiscal 2024 operation and maintenance, Corps of Engineers, civil funds in the amount of $6,897,715 were obligated at the time of the award. U.S. Army Corps of Engineers, Huntsville Engineer and Support Center, Alabama, is the contracting activity (W912DY-25-F-0343).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Raytheon Co., Tucson, Arizona, is awarded a $205,113,738 firm-fixed-price modification to previously awarded contract (N00024-24-C-5406) for the procurement of MK 15 Close-In Weapon Systems upgrades, conversions, overhauls, and related equipment. Work will be performed in Louisville, Kentucky (34%); El Segundo, California (10%); Tucson, Arizona (5%); Andover, Massachusetts (4%); Colchester, Vermont (3%); Mason, Ohio (3%); Grand Rapids, Michigan (2%); Tempe, Arizona (2%); Palo Alto, California (2%); Norcross, Georgia (2%); San Diego, California (2%); Ottobrunn Germany (2%); Joplin, Missouri (1%); Hauppauge, New York (1%); Grantsburg, Wisconsin (1%); Exeter, New Hampshire (1%); Pomona, California (1%); Galena, Kansas (1%); and various other locations each with less than 1% (23%), and is expected to be completed by January 2029. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $66,109,126 (32%); fiscal 2025 other procurement (Army) funds in the amount of $63,000,000 (31%); fiscal 2024 weapons procurement (Navy) funds in the amount of $29,752,620 (15%); fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $16,844,270 (8%); fiscal 2025 working capital funds (Navy) in the amount of $14,500,000 (7%); fiscal 2025 other procurement (Navy) funds in the amount of $14,000,000 (6%); and fiscal 2025 weapons procurement (Navy) funds in the amount of $657,790 (1%), will be obligated at time of award, and funds in the amount of $66,109,126 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington Navy Yard, D.C., is the contracting activity.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Lockheed Martin Space, Littleton, Colorado, is being awarded a $132,599,818 cost-plus-fixed-fee contract modification (P00103) under contract N00030-19-C-0025. This effort will support systems engineering and development and testing for Conventional Prompt Strike. Work will be performed in Denver, Colorado (44%); Courtland, Sunnyvale, California (16%); Alabama (12%); Pittsfield, Massachuestts (7%); Sunnyvale, California (5%); Cambridge, Massachusetts (5%); Huntsville, Alabama (3%); Magna, Utah (2%); Washington, D.C. (1%); Simsbury, Connecticut (1%); Cape Canaveral, Florida (1%); and various other locations (3%). Work under this contract is expected to be completed on Dec. 31, 2025. Fiscal 2025 research, development, test and Evaluation (Navy) funds in the amount of $25,000,000 will be obligated upon award.  No funds will expire at the end of the current fiscal year. This contract was awarded as a sole source acquisition pursuant to 10 U.S. Code 3204(a)(1) and was previously synopsized on the System for Award Management (SAM.gov) online portal. Strategic Systems Programs, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "The Boeing Co., St. Louis, Missouri, is being awarded a not-to-exceed $96,723,000 ceiling delivery order (N00383-25-F-YY2V) under a previously awarded basic ordering agreement (N00383-22-G-YY01) for the repair of outer wing panels used on the F/A-18 E/F aircraft. The delivery order does not include an option provision. Work will be performed in Jacksonville, Florida (90%); and St. Louis, Missouri (10%). Work will be completed by December 2030. Fiscal 2025 working capital funds (Navy) in the amount of $47,394,270 will be obligated at the time of award, and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 3204 (a)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Mission Systems Wimborne Limited, Wimborne, Dorset, United Kingdom, is being awarded a $14,261,389 firm-fixed-price, undefinitized contract action for the repair of 19 air refueling probes in support of V-22 aircraft. All work will be performed in Davenport, Iowa, and will be completed by November 2026. Fiscal 2025 working capital funds (Navy) in the amount of $6,988,081 will be obligated at the time of award and funds will not expire at the end of the current fiscal year. Subsequent task orders will be funded with appropriate fiscal year working capital funds (Navy) at the time of their issuance. One company was solicited for this non-competitive requirement pursuant to the authority set forth in 10 U.S. Code 2304 (c)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity (N00383-25-C-B017).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Metron Inc., Reston, Virginia, is being awarded a $9,281,811 cost-plus-fixed fee and cost only contract for the development of combat system signal processing, tracking algorithms, tools, and display technologies for undersea warfare systems including the undersea warfare decision support system and advanced processing and capability builds for surface ship and submarine systems. This contract includes options which, if exercised, would bring the cumulative value of this contract to $49,364,035. Work will be performed in Reston, Virginia (95%); and Portland, Oregon (5%), and is expected to be completed by September 2026. If all options are exercised, work will continue through September 2030. Fiscal 2025 research, development, test and engineering (Navy) funding in the amount of $960,000 (88%); and fiscal 2025 other procurement (Navy) funding in the amount of $132,103 (12%); will be obligated at the time of award and will not expire at the end of the current fiscal year. This contract was competitively procured via the SAM.gov website with 28 offers received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-5243).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Illumination Works LLC, Beavercreek, Ohio, was awarded a ceiling of $97,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity for digital transformation for industrial modernization. This contract provides for a hybrid approach to integrative solutions for the Industrial Internet of Things Enterprise Platforms, Data Analytics as a Service, Solution Factory, and Positive Inventory Control Fusion. Work will be performed at Oklahoma City Air Logistics Complex, Ogden Air Logistics Complex, Warner Robins Air Logistics Complex, Wright Patterson Air Force Base, and associated geographical separated units, and is expected to be completed by Aug. 31, 2036. This contract is a sole source Small Business Innovation Research Phase III acquisition. No fiscal limitations working capital funds in the amount of $4,889,109 are being obligated at time of award under the initial task order (FA810025FB013). The Enterprise Contracting Section, Oklahoma City, Oklahoma, is the contracting activity (FA810025DB005).",
    "contract_date": "2025-09-05"
  },
  {
    "text": "SSA Conventional Inc., Seattle, Washington (HTC71125DE119), has been awarded a firm-fixed-price, indefinite-delivery/indefinite-quantity contract with a face value of $26,257,687. This contract provides Stevedoring and Related Terminal Services (S&RTS) in the Pacific Northwest. The locations of performance are ports in Portland, Oregon; and Tacoma, Everett, Olympia, and Grays Harbor, Washington. The base period of performance is from Oct. 1, 2025, through Sep. 30, 2030. Working capital funds (Transportation) will be obligated for fiscal 2025. The U.S. Transportation Command, Directorate of Acquisition, Scott Air Force Base, Illinois, is the contracting activity.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Koniag IT Systems LLC, Anchorage, Alaska, has been awarded a firm-fixed-price contract (HQ0034-25-C-E074). The amount of this action is $13,895,193. operations and maintenance funds in the amount of $8,025,290 are being obligated at the time of the award. The cumulative total of the contract is $83,268,014. The purpose of this contract is to provide expertise, personnel, equipment, materials, and other items to support analytical activities, acquire tools, and pilot activities necessary to provide for meaningful business intelligence capabilities, and to integrate the analytical capability with an existing web-based SharePoint portal, and to document the requirements to establish a cost-efficient and sustainable analytics environment for the Department’s business data. The work will be performed in on-site government facilities predominantly in the Pentagon, Mark Center, Crystal City, Rosslyn, and Ft. Belvoir. The estimated contract completion date is March 31, 2028. Washington Headquarters Services, Arlington, Virginia, is the contracting authority.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "Collins Aerospace, Cedar Rapids, Iowa, has been awarded a maximum $15,845,775 firm-fixed-price, definitive contract for F-15E flat panel multipurpose displays. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a three-year four-month contract with no option periods. The performance completion date is Jan. 31, 2029. Using military service is Air Force. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency, Aviation, Warner Robins, Georgia (SPRWA1-25-C-0004). (Awarded on August 28, 2025)",
    "contract_date": "2025-09-05"
  },
  {
    "text": "RTX Corp., doing business as Pratt and Whitney, East Hartford, Connecticut, has been awarded a maximum $11,065,040 firm-fixed-price delivery order (SPE4A6-25-F-371Y) against a five-year basic ordering agreement (SPE4A1-21-G-0001) for blade compressor rotors. This was a sole-source acquisition in using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1 (a)(2). The delivery order completion date is July 22, 2026. Using military service is Air Force. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation, Richmond, Virginia.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "CORRECTION: Carter Enterprises LLC,** Brooklyn, New York, (SPE1C1-25-D-0053) for $11,254,960 was announced with an incorrect award date.  The correct award date is Sept. 3, 2025. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-05"
  },
  {
    "text": "*Small business**Small business in historically underutilized business zones",
    "contract_date": "2025-09-05"
  }
]