[
  {
    "text": "Lockheed Martin Corp., Grand Prairie, Texas, was awarded a $4,234,948,956 modification (P00013) to contract W31P4Q-23-D-0003 for production of the Guided Multiple Launch Rocket System. The total cumulative face value of the contract is $13,265,440,935. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Oct. 20, 2027. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-08-14"
  },
  {
    "text": "Phillips Contracting Co. Inc.,* Columbus, Mississippi, was awarded a firm-fixed-price contract for construction equipment rental with operators for disposal area maintenance. The amount of this action is $24,000,000. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 13, 2030. Army Contracting Command, Mobile, Alabama, is the contracting activity (W91278-25-D-A033).",
    "contract_date": "2025-08-14"
  },
  {
    "text": "Benaka Inc., New Brunswick, New Jersey, was awarded a firm-fixed-price contract for a design-bid-build construction of an area maintenance support activity and vehicle maintenance shop. The amount of this action is $19,679,000. The total cumulative face value of the contract is $19,707,000. Bids were solicited via the internet with three received. Work will be performed in Richmond, Virginia, with an estimated completion date of Aug. 14, 2027. Fiscal 2025 military construction, Army Reserve funds in the amount of $19,679,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Louisville, Kentucky, is the contracting activity (W912QR-25-C-A020).",
    "contract_date": "2025-08-14"
  },
  {
    "text": "BAE Systems Land and Armaments L.P., Sterling Heights, Michigan, was awarded a $11,500,000 modification (P00192) to contract W56HZV-15-C-A001 for an alternative dispute resolution settlement. The modification brings the total cumulative face value of the contract to $2,848,167,951. Work will be performed in York, Pennsylvania, with an estimated completion date of March 31, 2026. Fiscal 2018, 2019, and 2020, weapons and tracked combat vehicle procurement, Army funds in the amount of $11,500,000 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-08-14"
  },
  {
    "text": "Miami Nation Stronghold LLC,* Reston, Virginia, was awarded a firm-fixed-price contract for construction of a multi-purpose athletic field complex. The amount of this action is $10,236,166. Bids were solicited via the internet with five received. Work will be performed at Fort Polk, Louisiana, with an estimated completion date of Dec. 23, 2026. Fiscal 2024 military construction, Army funds in the amount of $10,236,166 were obligated at the time of the award. U.S. Army Corps of Engineers, Fort Worth, Texas, is the contracting activity (W9126G-25-C-0009).",
    "contract_date": "2025-08-14"
  },
  {
    "text": "Amentum Services Inc., Chantilly, Virginia, was awarded a $9,455,097 modification (P00044) to contract W58RGZ-25-C-0003 for global aviation maintenance services. The modification brings the total cumulative face value of the contract to $197,827,313. Work will be performed in Chantilly, Virginia, with an estimated completion date of Nov. 30, 2025. Fiscal 2025 operation and maintenance, Army; and fiscal 2025 other procurement, Army funds in the amount of $9,455,097, were obligated at the time of the award. Army Contracting Command Redstone, Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-08-14"
  },
  {
    "text": "eSimplicity Inc.,* Silver Spring, Maryland, is being awarded a $99,244,904 firm-fixed-price, indefinite-delivery/indefinite-quantity contract in support of the Navy and Marine Corps Spectrum Center, and Naval Information Warfare Developmental Center, to provide spectrum management support services. The contract will include a 60-month ordering period with no options. Work will begin September 2025 and is expected to be completed by August 2030. Services under the contract will be performed in Annapolis Junction, Maryland (30%); Fort Meade, Maryland (12%); Norfolk, Virginia (12%); Suffolk, Virginia (11%); Oak Harbor, Washington (11%); Silverdale, Washington (3%); Camp H.M. Smith, Hawaii (3%); Jacksonville, Florida (3%); San Diego, California (3%); Naples, Italy (3%); Yokosuka, Japan (3%); Naval Support Activity Bahrain (3%); and Naval Computer and Telecommunications Station Guam (3%). Fiscal 2025 operations and maintenance (Navy) appropriations in the contract's minimum amount of $10,000 will be obligated at time of award and will expire at the end of the current fiscal year on Sept. 30, 2025. Individual task orders will be subsequently funded with appropriate fiscal year appropriations at the time of their issuance. The requirement was competitively procured through the System for Award Management website (Sam.gov) as an unrestricted, competitive procurement with three offers received. Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department, Regional Directorate, Philadelphia, Pennsylvania, is the contracting activity (N00189-25-DZ032).",
    "contract_date": "2025-08-14"
  },
  {
    "text": "Vigor Marine LLC, Portland, Oregon, is awarded a $46,297,507 firm-fixed-price contract action for maintenance, modernization, and repair of USS Savannah (LCS 28) fiscal 2025 Docking Selected Restricted Availability. The scope of this acquisition includes all labor, supervision, equipment, production, testing, facilities, and quality assurance necessary to prepare for and accomplish the Chief of Naval Operations Availability. This contract includes options which, if exercised, would bring the cumulative value of this contract to $57,075,822. Work will be performed in Portland, Oregon, and is expected to be completed by February 2027. Fiscal 2025 other procurement, (Navy) funds in the amount of $41,789,220 (90%); and fiscal 2025 operation and maintenance (Navy) funds in the amount of $4,508,275 (10%), will be obligated at the time of award, of which $4,508,275 will expire at the end of the current fiscal year. This contract was competitively procured using full and open competition via the System for Award (SAM) website, with two offers received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N0002425C4420).",
    "contract_date": "2025-08-14"
  },
  {
    "text": "Lockheed Martin Rotary and Mission Systems, Syracuse, New York, is awarded a $8,044,741 cost-plus-incentive-fee modification to a previously awarded delivery order (N00024-24-F-6220) under an indefinite-delivery/indefinite quantity contract (N00024-19-D-6200) for engineering support of submarine electronic warfare systems on new construction and in-service submarines. Work will be performed in Syracuse, New York, and is expected to be completed by February 2026. Fiscal 2025 other procurement (Navy) funds in the amount of $7,153,000 (89%); fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $536,791 (7%); and fiscal 2023 other procurement (Navy) funds in the amount of $354,950 (4%), will be obligated at the time of award, of which $354,950 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-14"
  },
  {
    "text": "Noble Supply and Logistics Inc.,* Boston, Massachusetts, has been awarded a maximum $90,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for facilities maintenance, repair, and operations supplies. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a 413-day bridge contract with no option periods. Locations of performance are Florida, Alabama, and Mississippi, with an Oct. 2, 2026, ordering period end date. Using customers are Army, Navy, Air Force, Marine Corps and Coast Guard. Type of appropriation is fiscal 2025 through 2027 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE8E3-25-D-0021).",
    "contract_date": "2025-08-14"
  },
  {
    "text": "UPDATE: Combat Medical Systems LLC,* Huntersville, North Carolina (SPE2DE-25-D-0017, $48,000,000), has been added as an awardee to the multiple award contract for medical and surgical supplies and equipment for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DE-22-R-0017 and awarded Sept. 28, 2023. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-08-14"
  },
  {
    "text": "Lockheed Martin Corp., Missiles and Fire Control, Dallas, Texas, is being awarded an $18,302,843 modification (P00107) to a previously awarded contract (HQ0147-17-C-0032) for interceptor component obsolescence of the Terminal High Altitude Area Defense (THAAD) system to support the U.S. government. The total value of this contract is increased from $10,416,801,794 to $10,435,104,636. Under this modification the contractor will produce THAAD components under cost-plus-fixed-fee and firm-fixed-price contract line-item numbers. The work will be performed in Sunnyvale, California and Troy, Alabama, with an expected completion date August 18, 2028. Fiscal Year 2023 procurement funds in the amount of $44,508.24, Fiscal 2024 procurement funds in the amount of $17,140,994; and fiscal 2025 procurement funds in the amount of $1,117,341, are being obligated at the time of award. The Missile Defense Agency, Huntsville, Alabama, is the contracting activity.",
    "contract_date": "2025-08-14"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-14"
  }
]