[
  {
    "text": "BAE Systems Information and Electronic Warfare Systems, Hudson, New Hampshire, is awarded a $1,743,038,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for the production and delivery of up to 55,000 Advanced Precision Kill Weapon System II Full Rate Production Lots 13-17 in support of upgrading the current 2.75-inch Rocket System to a semi-active laser guided precision weapon for the Navy, Army, and Foreign Military Sales customers. Work will be performed in Hudson, New Hampshire (31%); Whippany, New Jersey (22%); Plymouth, United Kingdom (16%); Austin, Texas (7%); Bristol, Pennsylvania (3%); Rochester, New York (3%); Kitchener, Ontario, Canada (2%); Westminster, Maryland (2%); Ronan, Montana (2%); Topsfield, Massachusetts (2%); Pomfret, Connecticut (2%); Danbury, Connecticut (2%); Anaheim, California (1%); Tempe, Arizona (1%); Ipswich, Massachusetts (1%); Centennial, Colorado (1%); Carson, California (1%); and Boston, Massachusetts (1%), and is expected to be in completed December 2031. No funds will be obligated at the time of award, funds will be obligated on individual orders as they are issued. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity (N0001925D0018).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Fairbanks Morse LLC, doing business as Fairbanks Morse Defense, Beloit, Wisconsin, is awarded a $35,458,068, cost-plus-fixed-fee and firm-fixed-price, indefinite-delivery/indefinite-quantity contract for diesel engine lifecycle, modernization, and in-service support and related shipboard auxiliary and support systems. Work will be performed in Beloit, Wisconsin (80%); and at ship homeport locations (20%), and is expected to be completed by August 2031. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $54,732 will be obligated at time of award, of which $54,732 will expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1) (only one responsible source and no other supplies or services will satisfy agency requirements). Naval Surface Warfare Center, Philadelphia Division, Philadelphia, Pennsylvania, is the contracting activity (N6449825D4015).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "BAE Systems Land & Armaments LP, Minneapolis, Minnesota, is awarded a $20,245,685 cost-plus-fixed-fee delivery order under previously awarded Basic Ordering Agreement N00174-23-G-0001 for maintenance, preservation, and corrosion control of the MK38 Mod 2 & 3 Machine Gun Systems (MGSs). Work will be performed in Norfolk, Virginia (51%); and San Diego, California (49%), and is expected to be completed by September 2027. Fiscal 2024 weapons procurement (Navy) funds in the amount of $1,900,000 (34%); and fiscal 2025 operations and maintenance (Navy) in the amount of $3,650,683 (66%), will be obligated at time of award, of which $3,650,683 will expire at the end of the current fiscal year. This order was not competitively procured in accordance with 10 U.S. Code 3204(a)(1) (only one responsible source and no other supplies or services will satisfy agency requirements). Naval Surface Warfare Center Indian Head Division Indian Head, Maryland, is the contracting activity (N0017425F0021).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "General Dynamics Mission Systems, Manassas, Virginia, is awarded a $18,249,387 cost-plus-fixed-fee and firm-fixed-price contract for the development, maintenance, and delivery of the Common Weapon Launcher and Multi-Tube Weapon Simulator. This contract includes options which, if exercised, would bring the cumulative value of this contract to $229,999,491. This contract involves Foreign Military Sales to Australia, the United Kingdom, and United States (AUKUS) partnership. Work will be performed in Manassas, Virginia (60%); Charleroi, Pennsylvania (30%); and Middletown, Rhode Island (10%), and is expected to be completed by August 2026. If all options are exercised, work will continue through August 2030. Fiscal 2025 other procurement (Navy) funds in the amount of $11,507,559 (94%); Royal Australian Navy AN/BYG-1 armament cooperative program funds in the amount of $537,727 (4%); fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $138,714 (1%); and fiscal 2025 operation and maintenance (Navy) funds in the amount of $95,000 (1%), will be obligated at time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured pursuant to 10 U.S. Code 3204(a)(5). Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-6208).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Bird-Johnson Propeller Co. LLC, Walpole, Massachusetts, was awarded a $17,731,296 firm-fixed-price contract (N3220525C1204) for the procurement of fleet replenishment oiler class vessel propulsion replacement parts to include 192 blade bolts, three left hub assemblies, and three right hub assemblies. The contract does not contain an option period. The contract will be performed in Walpole, Massachusetts (100%), with a final delivery date of Nov. 30, 2026. Fiscal 2025 working capital funds (Navy) in the amount of $17,731,296 will be obligated at the time of the award, none of which will expire at the end of the current fiscal year. This contract was a sole source acquisition, under the authority of 10 U.S. Code 3204(a)(1), with a proposal solicited via the Government Point of Entry website and one proposal received. Military Sealift Command, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "The Boeing Co., Seattle, Washington, is awarded a $15,649,047 modification (P00035) to a cost-plus-fixed fee order (N0001920F0647) against a previously issued basic ordering agreement (N0001916G0001). This modification exercises an option to procure two P-8A Increment 3 retrofit kit installations in support of the Anti-Submarine Warfare capabilities upgrades for the Royal Australian Air Force. Work will be performed in Jacksonville, Florida (79.6%); St. Louis, Missouri (10.9%); and Mesa, Arizona (9.5%), and is expected to be completed July 2026. Royal Australian Air Force cooperative funds in the amount of $15,649,047 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. The contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Ultra Electronics Ocean Systems Inc., Braintree, Massachusetts, is awarded a $13,744,502 cost-plus-fixed-fee modification to a previously awarded contract (N0002425C4127) for engineering support in connection with the production of AN/SPS-73(V) Next Generation Surface Search Radar systems. Work will be performed in Braintree, Massachusetts (60%); Wake Forest, North Carolina (35%); and Chantilly, Virginia (5%), and is expected to be completed by February 2026. If all options are exercised, work will continue through February 2030. Fiscal 2025 other procurement (Navy) funds in the amount of $6,999,846 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-4127).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "HII Fleet Support Group LLC, Norfolk, Virginia, is awarded a $13,062,676 cost-plus-fixed-fee delivery order (N62793-25-F-7401) as part of a previously awarded contract (N00024-21-D-4103) to provide execution for the USS John C. Stennis (CVN 74) refueling complex overhaul and carrier engineering maintenance assist team support. Work includes assistance for preparation, evaluation and execution of repairs as well as technical guidance for maintenance execution and repairs. This contract, where specified, will provide hands on instruction in fault identification and application of current maintenance/repair techniques in accordance with the contract. Work will be performed in Newport News, Virginia, and is expected to be completed on Aug. 28, 2026. Fiscal 2025 shipbuilding and conversion (Navy) – cost to complete funding in the amount of $13,062,676 was obligated at time of award and will expire at the end of fiscal 2026. The Supervisor of Shipbuilding, Conversion and Repair, Newport News, Virginia, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "CAE USA Inc., Tampa, Florida, is awarded a $11,369,499 firm-fixed-price, cost reimbursable contract for contractor operation and maintenance, engineering, courseware revision and maintenance, instructor, cyber sustainment, and configuration management support in support of MH-60R training facility for the Royal Australian Navy. Work will be performed Nowra, New South Wales, Australia, and is expected to be completed August 2026. Foreign Military Sales customer funds in the amount of $11,369,499 will be obligated at the time of the award, none of which expire at the end of the current fiscal year. This contract was not competed. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity (N6134025C0002).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Metson Marine Services Inc.,* Ventura, California, is awarded a $9,988,166 modification (P00010) to a previously awarded cost-plus-fixed-fee contract (N0042123C0032). This modification exercises options to provide continued research, development, maintenance, operation, and support of facilities, systems, and equipment in support of the engineering development testing and fleet training mission of the Atlantic Targets and Marine Operation Key West detachment of Atlantic Ranges and Targets. Work will be performed in Key West, Florida (90%); Mayport, Florida (5%); Norfolk, Virginia (3%); and Patuxent River, Maryland (2%), and is expected to be completed in August 2026. Fiscal 2025 working capital (Navy) funds in the amount of $4,738,249 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract was competed. Naval Air Warfare Center Aircraft Division, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "General Atomics, San Diego, California, is awarded a $8,686,144 firm-fixed-price order (N0001925F0029) against a previously basic ordering agreement (N0001921G0014). This order provides logistics support as well as procures support equipment requirement data, detailed functional description document package, support equipment tools in support of the depot stand-up Phase II for the Electromagnetic Aircraft Launch System Ford Class. Work will be performed in San Diego, California (96.4%); Tupelo, Mississippi (2%); and various locations within the continental U.S. (1.6%), and is expected to be completed in October 2026. Fiscal 2025 other procurement (Navy) funds in the amount of $8,686,144 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Oasis Systems LLC, Burlington, Massachusetts, is awarded a $7,682,433 cost-plus-fixed-fee modification to previously awarded delivery order (N00024-23-F-6311) under an indefinite-delivery/indefinite-quantity contract N00024-20-D-6337 to exercise an option for Sea Hunter and Seahawk Unmanned Surface Vessel operations and sustainment. Work will be performed in San Diego, California (90%); Ventura, California (5%); Rockville, Maryland (2%); Burlington, Massachusetts (1%); and various locations across the U.S., each less than 1% (2%), and is expected to be completed by August 2026. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $2,500,000 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington Navy Yard, D.C., is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "CarverBeth LCC,* Luray, Virginia, is being awarded a $7,658,896 blanket purchase agreement hybrid firm-fixed price and time and materials service agreement for maintenance and operational support of the Consolidated Area Telephone System Network and base telephone systems located at 23 locations throughout the San Diego area, and Southern California in support of Naval Computer and Telecommunication Station San Deigo. The contract will include a one-year base period, four one-year option periods, and a not-to-exceed six-month extension option, in accordance with Federal Acquisition Regulation 52.217-8 which, if exercised, will bring the total value of this contract to $43,753,089. All work will be performed in San Diego, California, and work is expected to be completed by August 2026; if all options are exercised, work will be completed by February 2031. Fiscal 2025 operation and maintenance (Navy) funds will be used until the expiration on Sept. 30, 2025, to cover the initial blanket purchase agreement call order. The solicitation was posted via General Services Administration and was set aside for small business with two offers received. Naval Supply Systems Command Fleet Logistics Center, San Diego, California, is the contracting activity (N00244-25-A-S002).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Raytheon Missiles and Defense, Andover, Massachusetts, was awarded a $1,700,200,000 modification (P00008) to contract W31P4Q-24-C-0024 to support the low-rate initial production of Lower Tier Air and Missile Defense Systems. This action brings the cumulative total face value of the contract to $3,789,400,000. Work will be performed in Andover, Massachusetts, with an estimated completion date of Dec. 28, 2029. Fiscal 2025 Foreign Military Sales (Poland) funds in the amount of $397,410,000; and fiscal 2025 missile procurement, Army funds in the amount of $435,690,000, were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "EA Engineering, Science, and Technology Inc. PBC,* Hunt Valley, Maryland (W912DR-25-D-0004); CAPE-SRS JV LLC,* Norcross, Georgia (W912DR-25-D-0005); HGL-Aptim Technologies JV LLC,* Reston, Virginia (W912DR-25-D-0006); Kemron Environmental Services Inc.,* Atlanta, Georgia (W912DR-25-D-0007); Environmental Chemical Corp.,* Burlingame, California (W912DR-25-D-0008); Bay West LLC,* St. Paul, Minnesota (W912DR-25-D-0009); SERES Engineering & Services LLC,* Charleston, South Carolina (W912DR-25-D-0010); Weston Solutions Inc., West Chester, Pennsylvania (W912DR-25-D-0011); Tetra Tech Inc., Pittsburgh, Pennsylvania (W912DR-25-D-0012); and AECOM Technical Services Inc., Los Angeles, California (W912DR-25-D-0013), will compete for each order of the $500,000,000 firm-fixed-price contract for environmental, technical, and management services. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 27, 2032. U.S. Army Corps of Engineers, Baltimore District, Maryland, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "HDR Engineering Inc., Omaha, Nebraska (W91238-25-D-A012); West Consultants Inc.,* Salem, Oregon (W91238-25-D-A013); GEI Consultants Inc., Woburn, Massachusetts (W91238-25-D-A014); and Research Triangle Institute, Durham, North Carolina (W91238-25-D-A015), will compete for each order of the $49,990,000 firm-fixed-price contract for architectural-engineering services for water control, hydrology and hydraulic design. Bids were solicited via the internet with seven received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 27, 2030. U.S. Army Corps of Engineers, Sacramento, California, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "General Dynamics Land Systems Inc., Sterling Heights, Michigan, was awarded a $26,997,899 firm-fixed-price contract for Stryker Enhanced Power Distribution Unit Version Two Line Replaceable Units. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Feb. 28, 2028. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W912CH-25-D-0050).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Commercial Contracting Corp., Auburn Hills, Michigan, was awarded a $23,475,067 firm-fixed-price contract for the construction of a tactical vehicle laboratory. Bids were solicited via the internet with four received. Work will be performed in Warren, Michigan, with an estimated completion date of Dec. 26, 2027. Fiscal 2025 military construction, Army funds in the amount of $23,475,067 were obligated at the time of the award. U.S. Army Corps of Engineers, Louisville, Kentucky, is the contracting activity (W912QR-25-C-0020).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Cashman Dredging & Marine Contracting Co. LLC, Quincy, Massachusetts, was awarded an $8,967,750 firm-fixed-price contract for maintenance dredging at Tampa Harbor. Bids were solicited via the internet with four received. Work will be performed in Tampa Harbor, Florida, with an estimated completion date of April 2, 2026. Fiscal 2022, 2023, and 2025 civil operation and maintenance funds in the amount of $8,967,750 were obligated at the time of the award. U.S. Army Corps of Engineers, Jacksonville, Florida, is the contracting activity (W912EP-25-C-A009).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "LMRMS, Tampa, Florida, has been awarded a $98,000,000 hybrid contract action for the F16 Block 52 training simulators program for the Korean Air Force. This contract provides for the procurement of hardware and software development, integration, testing, and delivery of software for the Republic of Korea Air Force Block 52 F-16 mission training centers. Work will be performed at Orlando, Florida; Chungju, South Korea; and Seosan, South Korea, and is expected to be completed December 2031. This contract involves Foreign Military Sales (FMS) to South Korea. This contract was a sole source acquisition. FMS funds in the amount of $91,401,002 are being obligated at the time of award. Air Force Life Cycle Management Center, Wright-Patterson Air Force Base, Ohio, is the contracting activity (FA8621-25-C-B010).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Leidos Inc., Reston, Virginia, has been awarded an $8,980,894 modification (P00018) to a previously awarded contract (FA9451-22-C-0002) to develop, test, and demonstrate a mature prototype based on the first-generation technology demonstrator, high-power microwave counter unmanned aerial system prototype. Work will be performed at Albuquerque, New Mexico, and is expected to be completed by December 31, 2026. Fiscal 2025 and 2026 research development, test and evaluation funds in the amount of $6,734,000 are being obligated at the time of award. The Air Force Research Laboratory, Kirtland Air Force Base, New Mexico, is the contracting activity.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "Sysco Central Alabama, Calera, Alabama, has been awarded a maximum $33,103,659 fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for full-line food and beverage items. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a 251-day bridge contract with no option periods. The ordering period end date is May 16, 2026. Using military services are Army, Navy, Air Force, and Marine Corps. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE300-25-D-3020).",
    "contract_date": "2025-08-28"
  },
  {
    "text": "DRS Network & Imaging Systems LLC, Melbourne, Florida, has been awarded a maximum $8,336,664 firm-fixed-price contract for distribution box bases. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. The performance completion date is Nov. 17, 2027. Using military service is Army. Type of appropriation is fiscal 2025 through 2028 defense working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Columbus, Ohio (SPE7M9-25-C-0007). (Awarded April 13, 2025)",
    "contract_date": "2025-08-28"
  },
  {
    "text": "College Entrance Examination Board, New York, New York, is being awarded a firm-fixed-price, indefinite-delivery/indefinite-quantity contract for nationally recognized assessments for postsecondary preparation in the amount of $9,904,837. The period of performance is a five year base period. Fiscal 2025 funding in the amount of $1,560,710 will be obligated on the delivery order award. This was a sole-source acquisition using justification 10 U.S. Code 2304 (c)(1), as stated in Federal Acquisition Regulation 6.302-1. The contracting activity is the Department of Defense Education Activity, Alexandria, Virginia.",
    "contract_date": "2025-08-28"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-28"
  }
]