[
  {
    "text": "MSM Group North America Inc., St. Petersburg, Florida, was awarded a fixed-price-with-economic-price-adjustment contract to design, build, and commission a load, assemble, and pack facility at the Iowa Army Ammunition Plant. The amount of this action is $635,200,000. Bids were solicited via the internet with one received. Work will be performed in Middletown, Iowa, with an estimated completion date of Aug. 10, 2029. Fiscal 2024 and 2025 ammunition procurement, Army funds in the amount of $635,200,000 were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity (W519TC-25-C-0032).Kiewit Infrastructure West Co., Vancouver, Washington, was awarded a firm-fixed-price contract for design-bid-build construction for the Port of Nome Modification Phase 1A. The amount of this action is $399,443,425. Bids were solicited via the internet with one received. Work will be performed in Nome, Alaska, with an estimated completion date of Sept. 5, 2029. Fiscal 2022 civil construction funds in the amount of $399,443,425 were obligated at the time of the award. U.S. Army Corps of Engineers, Alaska, is the contracting activity (W911KB-25-C-A010).Poplicus Incorporated dba Govini,* Arlington, Virginia, was awarded a firm-fixed-price contract for Ark AI software-as-a-service platform software licenses. The amount of this action is $49,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 14, 2030. U.S. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W9128Z-25-D-A002).",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Aero Turbine, Inc., Stockton, California, has been awarded a maximum $228,405,885 modification (P00008) to a previously awarded contract (FA8122-23-D-0004) for the J85 management of items subject to repair overhaul components. The modification brings the total cumulative face value of the contract to maximum $453,432,627. Work will be performed at Stockton, California, and is expected to be completed by Dec. 29, 2032. The Air Force Sustainment Center, Tinker Air Force Base, Oklahoma, is the contracting activity. (Awarded on August 13, 2025)",
    "contract_date": "2025-08-15"
  },
  {
    "text": "General Dynamics Mission System, Inc., Scottsdale, Arizona, has been awarded a ceiling $17,500,000 modification (P00057) to a previously awarded contract (HQ0850-22-C-0007) for the proliferated warfighter space architecture, ground management and integration, and operation and sustainment efforts. The modification brings the total cumulative face value of the contract to $1,148,297,413 from $1,130,797,413. Work will be performed at Scottsdale, Arizona; Huntsville, Alabama; and Grand Forks, North Dakota, and is expected to be completed by the second quarter of fiscal 2027. Fiscal 2025 research, development, test and evaluation funds in the amount of $8,750,000 are being obligated at time of award. The Space Development Agency, Chantilly, Virginia, is the contracting activity.",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Modern Technology Solutions Inc., Alexandria, Virginia, has been awarded a $16,016,620 modification (P00012) to a previously awarded contract (FA8806-25-C-B001) for the addition of mission focused assessment and authorization effort on the Program Management Office, Systems Engineering, Integration and Testing. The modification brings the total cumulative face value of the contract to $131,987,548 from $115,970,929. Work will be performed at Colorado Springs, Colorado, and is expected to be completed by Jan. 10, 2030. Fiscal 2025 research, development, test and evaluation funds in the amount of $1,014,435 are being obligated at the time of award. The Space Systems Command, Los Angeles Air Force Base, El Segundo, California, is the contracting activity.",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Turf Care USA Inc., Riverton, Wyoming, was awarded a $7,578,000 firm-fixed-price contract for Joint Base Langley-Eustis grounds maintenance services. This contract provides for non-personal services to include all personnel, equipment, tools, supervision, and other items and services for grounds maintenance. Work will be performed at Fort Eustis, Newport News, Virginia; and Langley Air Force Base, Hampton, Virginia, and is expected to be completed by May 8, 2028. This contract was a competitive acquisition, and five offers were received. Fiscal 2025 operations and maintenance funds in the amount of $2,014,000 are being obligated at the time of award. The 633rd Contracting Squadron, Langley Air Force Base in Hampton, Virginia is the contracting activity (FA4800-24-F-0042).",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Lockheed Martin Space of Titusville, Florida, is being awarded a $110,898,408 cost-plus-fixed fee modification (P00014) to previously awarded contract (N0003024C0100) for Trident II (D5) missile production and deployed systems support. Work will be performed in Magna, Utah (94.9%); Clearwater, Florida (2.7%); Titusville, Florida (1.3%); and locations less than 1.0 percent each (1.1%). Work is expected to be completed Sept. 30, 2029. Fiscal 2025 weapons procurement (Navy) funds in the amount of $110,606,105 will be obligated on this award and no funds will expire at the end of the current fiscal year. Fiscal 2023 weapons procurement (Navy) funds in the amount of $292,303 will be obligated on this award and no funds will expire at the end of the current fiscal year. The maximum dollar value of the contract action is $110,898,408. This contract is being awarded to the Contractor on a sole source basis under 10 U.S. Code 3204(a)(1) and was previously synopsized on the Systems for Award Management website, with one proposal received. Strategic Systems Programs, Washington, D.C., is the contracting activity. The information contained in the announcement is unclassified.",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Serco Inc., Herndon, Virginia, is awarded a $97,064,456, cost-plus-fixed-fee, firm-fixed price, and cost only indefinite-delivery/indefinite-quantity type contract action for submarine high data rate (SubHDR) antenna pedestal group (APG) repair services and parts procurement. The work to be performed under this contract is for depot level repair, maintenance, and upgrade services to SubHDR APGs. This contract includes an initial ordering period of five years with a five year option period. Work will be performed in Herndon, Virginia (90%); and Newport, Rhode Island (10%), and is expected to be completed by August 2035. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $1,075,432 (100%) will be obligated on the first delivery order immediately following award of the basic contract, all of which will expire at the end of the current fiscal year. This contract was competitively procured, and two offers were received following a solicitation posted to SAM.gov. Naval Undersea Warfare Center Division, Newport, Rhode Island, is the contracting activity (N66604-25-D-Y500).",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Ashford Leebcor Enterprises IV LLC, Williamsburg, Virginia (N69450-22-D-0002); CCI Solutions LLC, Anchorage, Alaska (N69450-22-D-0003); Dawson Enterprises LLC, Honolulu, Hawaii (N69450-22-D-0004); P&S Construction Inc., North Chelmsford, Massachusetts (N69450-22-D-0005); Southeastern Industrial Barlovento JV-2, Destin, Florida (N69450-22-D-0006); VHB LLC, Boyds, Maryland (N69450-22-D-0007); Walga Ross Group 3, Joplin, Missouri (N69450-22-D-0008); and Webb LLC, Springfield, Virginia (N69450-22-D-0009), are awarded a combined maximum value $92,000,000 firm-fixed-price modification to increase the capacity of their respective, previously-awarded, contracts for general building projects. Award of this modification brings the total cumulative value for all eight contracts combined to $411,000,000. Work will be performed in Florida and is expected to be completed by November 2026. No funds will be obligated at time of award. The Naval Facilities Engineering Systems Command Southeast, Jacksonville, Florida, is the contracting activity.",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Alutiiq Logistics and Maintenance Services LLC., Anchorage, Alaska, is awarded a $54,632,039 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for base operations support services at Naval Air Weapons Station China Lake. The work to be performed provides for facilities support, utilities, and environmental services. Work will be performed in Ridgecrest, California, and will be completed by August 2027. Fiscal 2025 base operating support funds in the amount of $26,001,466 will be obligated at time of award and will not expire at the end of the current fiscal year. This is a sole source contract procured under authority 10 U.S. Code 3204(a)(1). The Facilities Engineering and Acquisition Division, China Lake, California, is the contracting activity (N62473-25-D-0013).",
    "contract_date": "2025-08-15"
  },
  {
    "text": "General Electric Power Conversion Naval Systems Inc., Imperial, Pennsylvania, is awarded a $43,832,021 cost-plus-fixed-fee and firm-fixed-price, indefinite-delivery/indefinite-quantity contract for technical services in support of the energy recirculation system at the Compatibility Test Facility. Work will be performed in Philadelphia (98%,) and Findlay, Pennsylvania (2%), and is expected to be completed by August 2030. Fiscal 2024 shipbuilding and conversion (Navy) funds in the amount of $4,533,229 will be obligated at the time of award and will not expire at the end of fiscal 2025. This contract was not competitively procured via SAM.gov in accordance with 10 U.S. Code 3204(a)(1)  (only one responsible source and no other supplies or services will satisfy agency requirements). Naval Surface Warfare Center, Philadelphia Division, Philadelphia is the contracting activity (N64498-25-D-4009).",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Sterling BV Inc.,* doing business as Sterling Foods, San Antonio, Texas, has been awarded a maximum $18,930,000 fixed-price, indefinite-delivery/indefinite-quantity contract for Performance Readiness snack bars. This was a competitive acquisition with three responses received. This is a five-year contract with no option periods. The ordering period end date is Aug. 15, 2030. Using military services are Army, Navy, Air Force and Marine Corps. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE3S1-25-D-Z106).",
    "contract_date": "2025-08-15"
  },
  {
    "text": "General Electric Co., Cincinnati, Ohio, has been awarded a maximum $11,897,130 firm-fixed-price one-time buy contract for turbo nozzle assemblies. This contract was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. The delivery completion date is March 7, 2030. Using military service is Air Force. Type of appropriation is fiscal 2025 defense working capital funds.  The contracting activity is the Defense Logistics Agency Aviation, Richmond, Virginia (SPE4A7-25-F-7290).",
    "contract_date": "2025-08-15"
  },
  {
    "text": "Deloitte Consulting LLP, Arlington, Virginia, has been awarded a task order contract (HQ0034-16-A-0015). The amount of this action is $12,214,797. Fiscal 2025 operations and maintenance funds in the amount of $6,140,182 are being obligated at the time of the award. The cumulative total of the contract is $71,717,690. The purpose of this contract is to provide assessments, policy recommendations, and support for the Office of the Deputy Assistant Secretary for Logistics. The work will be performed in Office of the Deputy Assistant Secretary of Defense for Logistics in the Pentagon and the Mark Center. The estimated contract completion date is Feb. 20, 2031. Washington Headquarters Services, Arlington, Virginia, is the contracting authority.",
    "contract_date": "2025-08-15"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-15"
  }
]