[
  {
    "text": "International SOS Government Services Inc., Trevose, Pennsylvania, was awarded $143,056,809 for Option Period Five of the TRICARE Overseas Program indefinite-delivery/indefinite-quantity, fixed-price task order contract (HT940220D0002) for health care support services. This contract supplements the healthcare capabilities and capacities of overseas military medical treatment facilities and provides healthcare in remote overseas locations. The program is a mission to provide TRICARE services to eligible beneficiaries in locations outside the U.S. and Washington, D.C., pursuant to Title 10 U.S. Code, Chapter 55, Section 1074(c)(1); and Title 32 Code of Federal Regulations, Part 199. The option period of performance is Sept. 1, 2025, to Aug. 31, 2026. Fiscal 2025 operations and maintenance funds were obligated at the time of award. The Defense Health Agency Managed Care Contracting Division, Aurora, Colorado, is the contracting activity. (Awarded July 30, 2025)",
    "contract_date": "2025-09-03"
  },
  {
    "text": "General Dynamics Information Technology Inc., Falls Church, Virginia, was awarded a sole-source Federal Supply Schedule General Services Administration firm-fixed-price order (HT003825FE001) with a maximum value of $15,828,800. The contract includes the continued operation, maintenance, and sunsetting support of the Armed Forces Billing and Collection Utilization Solution, a Software as a Service cloud-based solution for military medical treatment facility billing and collections. The task order's period of performance includes a six-month base period and two six-month optional periods, between Aug. 1, 2025, to Jan. 31, 2027. The primary work location will be in Falls Church, Virginia. The base period has been fully funded with fiscal 2025 operations and maintenance funds. The Defense Health Agency, Defense Healthcare Management Systems Contracting Division, Rosslyn, Virginia, is the contracting activity. (Awarded July 30, 2025)",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Western Door Federal LLC, Chantilly, Virginia, is awarded $11,637,792, to exercise Option Period Two of a previously awarded firm-fixed-price contract (HT001123C0099), to provide financial analysis, accounting, and program management support services for the Defense Health Agency Direct Care Financial Management Division. Work will be primarily performed at San Antonio, Texas and Falls Church, Virginia. Fiscal 2025 operation and maintenance funds are obligated at the time of award. The contract was an 8(a) sole source award through the Small Business Administration 8(a) program, in accordance with 15 U.S. Code 637, as implemented by Federal Acquisition Regulation 6.302-5(b)(4) and was executed on Sept. 22, 2023. The period of performance for this option period exercise is Sept. 30, 2025, to Sept. 29, 2026. The Defense Health Agency, Professional Services Contracting Division, Falls Church, Virginia, is the contracting activity. (Awarded Sept. 2, 2025)",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Western Door Federal LLC, Chantilly, Virginia, is awarded $8,593,763 for Option Year Four of a firm-fixed-price contract (HT001121C0021) to provide programming, budget development and execution, accounting, administrative, and training support services to the Defense Health Agency Direct Care Financial Management Division. Work will be primarily performed at Fort Sam Houston, Texas. Fiscal 2025 operations and maintenance funding was obligated at time of award. The contract was an 8(a) sole source award through the Small Business Administration 8(a) program in accordance with 15 U.S. Code 637 as implemented by Federal Acquisition Regulation 6.302-5(b)(4) and was executed on Sept. 27, 2021. The period of performance for this option period is Sept. 30, 2025, to Sept. 29, 2026. The Defense Health Agency, Professional Services Contracting Division, Falls Church, Virginia, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "General Dynamics Mission Systems Inc., Manassas, Virginia, is awarded a $91,211,004 cost-plus-fixed-fee, cost-plus-incentive-fee, and firm-fixed-price, indefinite-delivery/indefinite-quantity contract for engineering and technical support and production of submarine tethered expendable buoy systems on new construction and in-service submarines. Work will be performed in Manassas, Virginia, and is expected to be completed by August 2030. Fiscal 2025 other procurement (Navy) fund in the amount of $2,000,000 (67%); and fiscal 2025 research, development, test and evaluation (Navy) fund in the amount of $1,000,000 (33%), will be obligated to satisfy the minimum guarantee and begin engineering efforts under delivery order (N00024-25-F-6233) and the funds will not expire at the end of the current fiscal year. The requirement was competitively procured through full and open competition with three offerors received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-D-6231).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Weeks-Cashman JV, Omaha, Nebraska, is awarded an $87,838,740 firm-fixed-price construction contract for P-1044, Pier 31 Replacement. Work will be performed at the Naval Submarine Base New London, Groton, Connecticut, and is expected to be completed by November 2027. The maximum dollar value, including the base price and five options, is $95,573,000. Fiscal 2024 military construction funds in the amount of $87,838,740 will be obligated at the time of the award and will not expire at the end of the fiscal year. This contract was competitively procured via the www.SAM.gov website, with two offers received. The Naval Facilities Engineering Systems Command Mid-Atlantic, Norfolk, Virginia, is the contracting activity (N4008525C0032).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Lockheed Martin Rotary and Mission Systems, Moorestown, New Jersey, is being awarded a $52,966,176 cost-plus-incentive-fee, cost-plus-award-fee, and cost-only contract modification to previously awarded contract (N00024-15-C-5151) to exercise options to provide ship integration and test of the Aegis weapon system. Work will be performed in Moorestown, New Jersey (44%); San Diego, California (19%); Norfolk, Virginia (18%); Bath, Maine (10%); Pascagoula, Mississippi (9%), and is expected to be completed by September 2026. Fiscal 2019 shipbuilding and conversion (Navy) funds in the amount of $4,821,906 (35%); fiscal 2025 operations and maintenance (Navy) funds in the amount of $4,410,428 (32%); fiscal 2020 shipbuilding and conversion (Navy) funds in the amount of $2,385,560 (17%); fiscal 2022 shipbuilding and conversion (Navy) funds in the amount of $1,251,978 (9%); fiscal 2025 other procurement (Navy) funds in the amount of $736,861 (5%); and fiscal 2016 shipbuilding and conversion (Navy) funds in the amount of $238,546 (2%), will be obligated at time of award, of which $4,410,428 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "CenCore LLC,* Springville, Utah, is awarded a $43,449,980 firm-fixed-price, indefinite-delivery/indefinite-quantity contract (N6523625D3800). The commercial contract will provide for design, fabrication, delivery, assembly and installation of prefabricated secure modular buildings on existing concrete pads at Naval Information Warfare Center, Charleston, South Carolina. The contract includes a five-year ordering period with no options. The first delivery order will be awarded simultaneously with a value of $5,449,980 and a delivery date of Feb. 12, 2027. Work will be performed in Springville, Utah (87%); and Charleston, South Carolina (13%), and is expected to be completed by August 2032. Fiscal 2025 research, development, test and evaluation funds in the amount of $5,449,980 will be obligated on the first delivery order at time of award of the basic contract. Funds will not expire at the end of the current fiscal year. The contract was competitively procured as a small business set-aside via the System for Award Management website, with five offers received. Naval Information Warfare Center Atlantic, Charleston, South Carolina, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Honeywell International Inc., Phoenix, Arizona, is being awarded a $24,234,992 firm-fixed-price contract for 69 auxiliary power unit spares in support of F/A-18 aircraft. All work will be performed in Phoenix, Arizona, and will be completed by November 2028. Fiscal 2025 annual working capital (Navy) funds in the full amount of $24,234,992 will be obligated at time of award and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement in accordance with Federal Acquisition Regulation 10 U.S. Code 3204(a)(1) with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity (N00383-25-C-D027).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "J&J Contractors Inc., North Billerica, Maine, is awarded a $22,311,265 firm-fixed-price construction contract for P-347 perimeter security improvements at Portsmouth Naval Shipyard, Naval Computer and Telecommunications Station, Cutler, Maine. Work will be performed in Cutler, Maine, and is expected to be completed by March 2028. The base price and two options will be awarded in the amount of $22,311,265. Fiscal 2021 military construction funds in the amount of $22,311,265 will be obligated at the time of award and will expire at the end of the current fiscal year. This contract was competitively procured via the www.sam.gov website with three offers received. Naval Facilities Engineering Systems Command, Mid-Atlantic, Norfolk, Virginia, is the contracting activity (N4008525C0013).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Detyens Shipyards Inc.,* North Charleston, South Carolina, is awarded a $14,754,720 firm-fixed-price contract (N3220525C4082) for 91-calendar day shipyard availability for the mid-term availability of Military Sealift Command's Expeditionary Mobile Base USNS Robert E. Simanek (ESB 7). This contract includes a base work package and four unexercised options for additional work and time which, if exercised, would increase the cumulative value of this contract to $16,021,595. Work will be performed in Charleston, South Carolina, beginning Oct. 18, 2025, and is expected to be completed by Jan. 16, 2026. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $14,754,720 are obligated and will expire at the end of the fiscal year. This contract was a small business set-aside solicited via the Government Point of Entry website and one proposal received. Military Sealift Command, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Northrop Grumman Systems Corp., Melbourne, Florida, is awarded an $11,631,673 cost-plus-fixed-fee modification (P00007) to an order (N0001923F0029) against a previously issued basic ordering agreement (N0001920G0005). This modification provides for the procurement of two installation data packages for the E-2D Advanced Hawkeye Fatigue Article Test and Teardown. Work will be performed in Malborne, Florida (45%); Bethpage New York (40%); and El Segundo, California (15%), and is expected to be completed in April 2028. Fiscal 2025 research, development, test and evaluation funds in the amount of $11,631,673 will be obligated at time of award, none of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Ranco Construction Inc., Southampton, New Jersey (FA4484-25-D-0024); OK2 Construction LLC, Cleburne, Texas (FA4484-25-D-0025); and JJS Electric Inc., Wrightstown, New Jersey (FA4484-25-D-0026), were awarded a ceiling $66,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity, multiple award contract for electrical work. This contract includes all personnel, labor, material, tools, equipment, quality control, supervision, and other items and services necessary to manage and accomplish a broad range of inspection, survey, testing, troubleshooting, constructing, calibrating, programming, maintenance, demolition, temporary power, upgrade, alteration, and repair of electrical systems. Work will be performed at Joint Base McGuire-Dix-Lakehurst, New Jersey, and is expected to be completed by Sept. 2, 2030. These contracts were competitive acquisitions, and nine offers were received. No funds are being obligated at the time of award. The 87th Contracting Squadron, Joint Base McGuire-Dix-Lakehurst, New Jersey, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Relief Enterprise Inc., Austin, Texas, was awarded a $36,342,175 indefinite-delivery/indefinite quantity contract for custodial services. This contract provides for all management, tools, equipment, and labor necessary to ensure that custodial services are performed at Joint Base San Antonio - Fort Sam Houston, Texas, in a manner that will maintain a satisfactory facility condition and present a clean, neat and professional appearance. Work will be performed at Joint Base San Antonio- Fort Sam Houston, Texas, and is expected to be completed by Aug. 31, 2029. This contract was a sole source acquisition. Fiscal 2025 funds for operations and maintenance in the amount of $740,071 are being obligated at time of award. The 502nd Contracting Squadron- Joint Base San Antonio-Lackland, Texas is the contracting activity (FA301625D0012). (Awarded Aug. 31, 2025)",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Haskell Corp, Bellingham, Washington, was awarded a $21,541,787 firm-fixed-price contract for a steam generator at Air Force Research Lab. This contract provides for the design, fabrication, transport, testing, installation, and related work for one new steam generator. This generator will be utilized to replace an aging steam generation system in use at Area 1-42. The location of performance is the Air Force Research Laboratory West Area 1-42, Edwards Air Force Base, California. The work is expected to be completed by Sept. 7, 2027. This award is the result of a full and open competitive acquisition solicited on SAM.gov with 1 offer received. Fiscal 2024 research and development funds in the amount of $16,026,856 are being obligated at the time of award. The Air Force Test Center, Aerospace Systems Support Branch, Edwards AFB, California is the contracting activity (FA930025P6011).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Lockheed Martin Corp., Littleton, Colorado, was awarded a $12,155,760 fixed-price incentive (firm-target) modification (P00118) to previously awarded contract FA8823-21-C-0001 for Space Based Infrared System contractor logistics support, product support, and integration contract evolution. This modification will increase the contract value from $1,270,585,484 to $1,282,741,244 Work will be performed on Peterson Space Force Base, Buckley SFB, Greeley Air National Guard Station, and Boulder, Colorado, and is expected to be completed by Jan. 31, 2026. Fiscal 2025 operations and maintenance funds in the amount of $12,155,760 are being obligated at the time of the award. Space Systems Command, Peterson SFB, Colorado, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Goodwill Industries of San Antonio Contract Services, San Antonio, Texas, was awarded a $9,402,910 indefinite-delivery requirements contract for grounds maintenance services. This contract provides for the contractor to provide all personnel, equipment, tools, materials, vehicles, supervision, and other items and services necessary to perform grounds services, shrubbery/tree trimming, stump removal, grass trimming, and debris/trash pickup; services will be performed at Joint Base San Antonio-Fort Sam Houston, Texas, and is expected to be completed by Jan. 31, 2030. This contract was a sole source acquisition. Fiscal 2025 funds for operations and maintenance in the amount of $163,121 are being obligated at time of award. The 502nd Contracting Squadron-Joint Base San Antonio-Lackland, Texas, is the contracting activity (FA301625D0023). (Awarded Aug. 30, 2025)",
    "contract_date": "2025-09-03"
  },
  {
    "text": "WR Security & Bewachungs GmbH, Kaiserslautern, Germany, has been awarded an $8,261,201 firm-fixe-price contract for passenger terminal security & baggage screening services. This contract provides for non-personal, unarmed services supporting the 721st Aerial Port Squadron, ensuring efficient passenger and baggage handling compliant with Transportation Security Administration, Air Mobility Command, and German regulations. Work will be performed on Ramstein Air Base, Germany, and is expected to be completed by Sept. 30, 2030, if all options are exercised. This contract was a competitive acquisition, and four offers were received. Fiscal 2026 working capital in the amount of $1,465,521 are subject to availability and will be obligated when available. The 700th Contracting Squadron, Kapaun Air Station, Germany, is the contracting activity (FA561325C0007).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "9Line LLC, Tampa, Florida, was awarded a $64,165,507 hybrid firm-fixed-price and cost reimbursement contract (H9240025CE003) for non-clinical case management and advocacy services. The work will be performed at locations in the U.S. and abroad and is expected to be completed by June 14, 2030. U.S. Special Operations Command, MacDill Air Force Base, Florida, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Specialized Materials and Chemicals LLC,* Perry, Utah, was awarded a $49,500,000 firm-fixed-price contract for ammonium perchlorate to support McAlester Army Ammunition Plant production purposes. The amount of this action is $49,500,000. Bids were solicited via the web with two received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 2, 2028. Army Contracting Command, Rock Island, Illinois, is the contracting activity (W519TC-25-D-A010).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "The Johns Hopkins University Applied Physics Laboratory LLC, Laurel, Maryland, was awarded a $20,000,000 cost-plus-fixed-fee contract to accelerate the development, acquisition, fielding, and sustainment of material. The amount of this action is $20,000,000. Bids were solicited via the web with one received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 14, 2032. Army Contracting Command, Research Triangle Park Division, Aberdeen Proving Ground, Maryland, is the contracting activity (W911NF-25-D-A003).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Fulcrum Concepts LLC, Mattaponi, Virginia, was awarded a $14,853,953 modification (P00007) to contract W911W6-21-C-0041 for the Modular Effects Launcher Phase III. The modification brings the total cumulative face value of the contract to $29,731,217. Work will be performed in Mattaponi, Virginia, with an estimated completion date of Sept. 30, 2027. Fiscal 2010 research, development, test, and evaluation, Army funds in the amount of $1,443,876 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Applied Technologies Group Inc.,* Huntsville, Alabama, was awarded a $12,308,640 modification (P00038) to contract W31P4Q-23-F-E001 for logistics support for the Utility Helicopters Project Office. The modification brings the total cumulative face value of the contract to $49,371,665. Work will be performed in Huntsville, Alabama, with an estimated completion date of Oct. 12, 2026. Fiscal 2025 funds in the amount of $6,812,686 other procurement, Army funds; $3,467,957 operation and maintenance, Army funds; and $2,027,996 Foreign Military Sales funds, were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Navigator Development Group Inc.,* Enterprise, Alabama, was awarded a $10,725,178 modification (P00039) to contract W31P4Q-21-F-D001 for programmatic services support for Program Executive Office Aviation Headquarters. The modification brings the total cumulative face value of the contract to $51,510,197. Work will be performed in Enterprise, Alabama, with an estimated completion date of Sept. 7, 2026. Fiscal 2025 funds in the amount of $241,882 for Foreign Military Sales administrative funds, $876,770 for operation and maintenance, Army funds, $7,715,570 for operation and maintenance, Army funds, $1,051,024 for research, development, test, and evaluation, Army funds, and $839,933 for operation and maintenance, Army funds were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Dickson Furniture Manufacturers LLC, Houston, Texas, was awarded a firm-fixed-price contract for the procurement and installation of replacement case goods under the Centralized Furnishings Program. The amount of this action is $9,009,859, with a total cumulative face value of $9,012,259. Bids were solicited via the internet with four received. Work will be performed in Pensacola, Florida, with an estimated completion date of March 20, 2026. Fiscal 2010 procurement, defense-wide funds in the amount of $9,009,859 were obligated at the time of the award. U.S. Army Corps of Engineers, Huntsville Engineer and Support Center, is the contracting activity (W912DY-25-F-0323).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Theissen Training Systems Inc., Gainesville, Florida, was awarded a $7,510,805 firm-fixed-price contract for a deployable range package and associated equipment. Bids were solicited via the internet with one received. Work will be performed in Romania, with an estimated completion date of Sept. 29, 2027. Fiscal 2025 Foreign Military Sales (Romania) funds in the amount of $7,510,805 were obligated at the time of the award. Army Contracting Command, Orlando, Florida, is the contracting activity (W900KK-25-C-A023). (Awarded Aug. 28, 2025)",
    "contract_date": "2025-09-03"
  },
  {
    "text": "Bernard Cap LLC,* Hialeah, Florida, has been awarded a maximum $8,813,161 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for crown, dress cap, polyester, CNT, laminated, white 3006 and crown, dress, polyester/wool gabardine, laminated, green 2212. This was a competitive acquisition with three responses received. This is a five-year contract with no option periods. The ordering period end date is Sept. 2, 2030. Using military service is Marine Corps. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-5011).",
    "contract_date": "2025-09-03"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-09-03"
  }
]