[
  {
    "text": "Lockheed Martin Corp., Orlando, Florida, was awarded a $720,120,883 modification (P00060) to contract W31P4Q-23-C-0005 for Production Year Four of HELLFIRE/JAGM missiles. The modification brings the total cumulative face value of the contract to $1,493,541,465. Work will be performed in Ocala, Florida, with an estimated completion date of Sept. 30, 2028. Fiscal 2025 missile procurement, Army funds in the amount of $720,120,883 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-08-13"
  },
  {
    "text": "Burns & McDonnell Engineering Co. Inc., Kansas City, Missouri (W91236-25-D-A006); Tetra Tech/Mason & Hanger JV, Ann Arbor, Michigan (W91236-25-D-A007); Black & Veatch – Zapata JV, Overland Park, Kansas (W91236-25-D-A009); and Benham-WSP JV, Jacksonville, Florida (W91236-25-D-A010), will compete for each order of the $240,000,000 firm-fixed-price contract for multi-discipline architect-engineer services. This total cumulative face value is $240,000,000. Bids were solicited via the internet with 10 received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 12, 2030. U.S. Army Corps of Engineers, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-08-13"
  },
  {
    "text": "CDM Constructors Inc., Boston, Massachusetts, was awarded a $32,850,117 firm-fixed-price contract for construction of an ammunition storage site with a total cumulative face value of $32,850,117. Bids were solicited via the internet with three received. Work will be performed in Israel with an estimated completion date of Dec. 12, 1027. Fiscal 2025 Foreign Military Sales (Israel) funds in the amount of $32,850,117 were obligated at the time of the award. U.S. Army Corps of Engineers, Middle East District, is the contracting activity (W912ER-25-C-A001).",
    "contract_date": "2025-08-13"
  },
  {
    "text": "Rise8 Inc. Tampa, Florida, has been awarded a $399,000,000, indefinite-delivery/indefinite-quantity contract modification (P0005) to a previously awarded contract (FA8730-23-D-B004) for software development tools and services. The modification brings the total cumulative face value of the contract to $499,000,000 from $100,000,000. Work will be performed at Tampa, Florida, and is expected to be completed by June 4, 2030. No funds will be obligated at the time of award. The Air Force Research Laboratory, Wright Patterson Air Force Base, Ohio, is the contracting activity.",
    "contract_date": "2025-08-13"
  },
  {
    "text": "CORRECTION: The $15,616,578 modification (P00034) to a previously awarded contract (FA8819-21-C-1001) awarded to Geost, Tucson, Arizona, announced on Aug. 12, 2025, was announced with the incorrect date. The correct date is Aug. 13, 2025.",
    "contract_date": "2025-08-13"
  },
  {
    "text": "Standard Aero Inc., San Antonio, Texas, is awarded a $58,916,012 modification (P00002) to a firm-fixed-price, indefinite-delivery/indefinite-quantity contract (N0001924D0126). This modification exercises options to provide continued depot repair of T56-A-427A engines, to include the repair of the power section, torque meter, gearbox, and accessories for the E-2D Advanced Hawkeye aircraft. Work will be performed in San Antonio, Texas (70%); Winnipeg, Canada (25%); and Indianapolis, Indiana (5%), and is expected to be completed by August 2026. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. This contract was competitively procured. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-13"
  },
  {
    "text": "Nemean Solutions LLC,* Sierra Vista, Arizona, is awarded a $56,769,968 firm-fixed-price, indefinite-delivery/indefinite-quantity contract to provide Contractor Support Services in support of Program Executive Officer Land Systems business and acquisition related activities to include acquisition policy, program development, program analysis, public affairs, acquisition logistics management support, financial management support, audit readiness support, engineering and safety support. Work will be performed in Quantico, Virginia (96%); and Albany, Georgia (4%), and is expected to be completed in August 2030. No funds will be obligated at time of award. Funds will be obligated on individual task orders as they are issued. This contract was not competitively procured pursuant to Federal Acquisition Regulation 19.8, Contracting with the Small Business Administration (8(a) Program). The Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-D-0004).",
    "contract_date": "2025-08-13"
  },
  {
    "text": "Rockwell Collins Simulation and Training Solutions, Cedar Rapids, Iowa, is awarded a $16,027,070 modification (P00034) to a previously awarded firm-fixed-price contract (N6134021C0017). This modification adds in-scope production and testing of Special Programs Advanced Readiness Trainer Afloat/Ashore (SPARTA) 12, to include updates and compliance of SPARTA 12 as well as SPARTA Joint Simulation Environment/Global Reuseable Interface Domain and associated program support. Additionally, this modification exercises options for Simulated Maintenance Trainer 2 (SMT-2) Delta Software System Configuration 5 (DSSC-5) concurrency, as well as technical data and computer software in support of SMT-2 hardware and software baseline to DSSC-5. The modification also exercises options for the production and delivery of six flight aircraft flight management computer functional equivalent units. These efforts are in support of the E-2D Hawkeye Integrated Training Systems for the Navy. Work will be performed in Sterling, Virginia (60%); Norfolk, Virginia (30%); Point Mugu, California (5%); and Orlando, Florida (5%), and is expected to be completed in August 2027. Fiscal 2025 aircraft procurement (Navy) funds in the amount of $13,171,919; and fiscal 2023 aircraft procurement (Navy) funds in the amount of $2,855,151, will be obligated at the time of award, $2,855,151 of which will expire at the end of the current fiscal year. This modification was not competed. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity.",
    "contract_date": "2025-08-13"
  },
  {
    "text": "HII Fleet Support Group LLC, Virginia, is awarded a $10,984,857 cost-plus-fixed-fee delivery order (N62793-25-F-7406) as part of a previously awarded contract (N00024-21-D-4114) to provide execution for the USS John C. Stennis (CVN 74) refueling complex overhaul and carrier engineering maintenance assist team support. Work includes assistance for preparation, evaluation, and execution of repairs as well as technical guidance for maintenance execution and repairs. This contract, where specified, will provide \"hands on\" instruction in fault identification and application of current maintenance and repair techniques in accordance with the contract. Work will be performed in Newport News, Virginia, and is expected to be completed in August 2026. Fiscal 2025 shipbuilding and conversion (Navy) cost to complete funding in the amount of $10,984,857 was obligated at time of award and will expire at the end of the period of performance. Supervisor of Shipbuilding, Conversion and Repair, Newport News, Virginia, is the contracting activity.",
    "contract_date": "2025-08-13"
  },
  {
    "text": "Greensea Systems Inc., Richmond, Vermont, is awarded a $10,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for the Amphibious Unmanned Ground Vehicle (AUGV). The intent of this contract is to procure AUGVs as part of the Littoral Explosive Ordnance Neutralization Family of Systems. Work will be performed in Richmond, Vermont, and is expected to be completed in August 2030. Funds in the amount of $9,004,750 are expected to be obligated upon award of this contract. This contract is awarded based on a sole-source basis under authority of 10 U.S. Code 4021. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-D-5303).",
    "contract_date": "2025-08-13"
  },
  {
    "text": "Systems & Technology Research LLC, Woburn, Massachusetts, has been awarded an $11,386,095 modification (P00006) to cost-plus-fixed-fee contract HR001124C0309 to exercise Option One of the Artificial Intelligence Reinforcements program. The modification brings the total cumulative face value of the contract to $17,261,425 from $5,875,330. Work will be performed in Woburn, Massachusetts (75%); Beavercreek, Ohio (20%); and Carlsbad, California (5%), with an expected completion date of February 2028. Fiscal 2025 research and development funds in the amount of $1,785,000 are being obligated at the time of award. The Defense Advanced Research Projects Agency, Arlington, Virginia, is the contracting activity.",
    "contract_date": "2025-08-13"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-08-13"
  }
]