[
  {
    "text": "Raytheon Missiles & Defense, Marlborough, Massachusetts, was awarded a $52,981,009 fixed-price incentive (firm-target) modification to a previously awarded contract (N00024-22-C-5500) to exercise an option for hardware production of the AN/SPY-6(V) family of radars. Work will be performed in Andover, Massachusetts (31%); San Diego, California (9%); Sykesville, Maryland (9%); Scottsdale, Arizona (8%); Syracuse, New York (5%); Cerritos, California (5%); Stafford Springs, Connecticut (4%); Tulsa, Oklahoma (3%); Indianapolis, Indiana (3%); Portsmouth, Rhode Island (2%); Riverside, California (2%); and various locations across the U.S., each less than 1% (19%). Work is expected to be completed by September 2029. Fiscal 2024 shipbuilding and conversion (Navy) funds in the amount of $52,981,009 will be obligated at the time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity. (Awarded Aug. 20, 2025)",
    "contract_date": "2025-08-21"
  },
  {
    "text": "Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $27,235,068 modification (P00010) to a previously awarded cost-plus-fixed-fee contract (N0001924C0011). This modification procures special tooling and test equipment in support of the Joint Strike Fighter aircraft for the Air Force, Marine Corps, Navy, Foreign Military Sales (FMS) customers, and non-U.S. Department of Defense (DOD) participants. Work will be performed in Marietta, Georgia (30%); Palmdale, California (29%); Fort Worth, Texas (28%); El Segundo, California (5%); Chesterfield, Michigan (4%); Melbourne, Florida (2%); and various other locations within the continental U.S. (2%), and is expected to be completed in December 2028. Fiscal 2023 aircraft procurement (Air Force) funds in the amount of $84,654; fiscal 2025 aircraft procurement (Air Force) funds in the amount of $10,915,690; fiscal 2023 aircraft procurement (Navy) funds in the amount of $42,328; fiscal 2025 aircraft procurement (Navy) funds in the amount of $5,321,146; fiscal 2023 aircraft procurement (Marine Corps) funds in the amount of $42,327; fiscal 2025 aircraft procurement (Marine Corps) funds in the amount of $5,437,289; non-U.S. DOD participants funds in the amount of $5,027,789; and FMS customer funds in the amount of $363,845, will be obligated at time of award, $169,303 of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-08-21"
  },
  {
    "text": "Sedna Digital Solutions LLC,* Manassas, Virginia, is awarded a $23,842,394 cost-plus-fixed-fee contract modification to a previously awarded contract (N00024-23-C-6132) to exercise options for Navy engineering design, development, production support, equipment, and supporting material for SONAR systems. Work will be performed in Manassas, Virginia, and is expected to be completed by Jan. 30, 2029. Fiscal 2025 other procurement (Navy) funds in the amount of $9,070,204 (38%) will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-08-21"
  },
  {
    "text": "Information Systems and Networks Corp., Bethesda, Maryland, has been awarded a $14,268,341 firm-fixed-price and cost contract (M9549425C0014) to provide housing property management support services for Marine Corps service members residing in unaccompanied housing (UH). Work will be performed at 26 installations located in both the continental U.S.  and outside the continental U.S. including Okinawa, Japan (23%); Oceanside, California (21%); Jacksonville, North Carolina (21%); San Diego, California (6%); Port Royal, South Carolina (5%); Twentynine Palms, California (4%); Kaneohe, Hawaii (4%); Quantico, Virginia (4%); Havelock, North Carolina (3%); Yuma, Arizona (3%), and various other locations making up less than 1%. This contract includes options which, if exercised, would bring the cumulative value of this contract to $28,536,683. If all options are exercised, work will continue through September 2026. Fiscal 2025 operation and maintenance (Marine Corps) funds in the amount of $14,268,341 will be obligated at time of award. This contract was not competitively procured and was awarded under the authority of 10 U.S. Code 3204(a)(1) as implemented by Federal Acquisition Regulation 6.302-1. The Marine Corps Installations Command Contracting Office, Arlington, Virginia, is the contracting activity (M9549425C0014).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "Sea Dragon Energy Inc.,* San Diego, California, is awarded a cost-plus-fixed-fee contract for the Seawater to Jet Fuel Demonstration Unit (Phase Two) effort. Work will be performed in San Diego, California, and is expected to be completed in August 2027. The total cumulative value of this contract, including a 24-month base period with no options, is $9,497,958. Fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $9,497,958, are obligated at the time of award and will expire at the end of the current fiscal year. This contract was competitively procured under long range broad agency announcement (BAA) (N0001425SB001) entitled \"Long Range Broad Agency Announcement (BAA) for Navy and Marine Corps Science and Technology.\" Since proposals will be received throughout the year under the Long-Range BAA, the number of proposals received in response to the solicitation is unknown. The Office of Naval Research, Arlington, Virginia, is the contracting activity (N0001425C1317).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "Bestwork Industries for the Blind Inc.,** Cherry Hill, New Jersey, has been awarded a maximum $48,658,050 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for fleece liners. This is a three-year contract with no option periods. The ordering period end date is Aug. 20, 2028. Using customers are Navy and Coast Guard. Type of appropriation is fiscal 2025 through 2028 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-B014).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "InfraTech International LLC, Barrigada, Guam, was awarded a $18,986,013 firm-fixed-price contract for AJJY 25-1049M Upgrade Generator and Switchgear – Detachment 2. This contract provides for upgrading the generators and switchgear at Det 2, Northwest Field, Guam. Work will be performed at Northwest Field, Guam, and is expected to be completed by Nov. 22, 2027. This contract was a competitive acquisition, and two offers were received. Fiscal 2025 operations and maintenance appropriations funds in the amount of $18,986,013 are being obligated at the time of award. The 36th Contracting Squadron, Andersen Air Force Base, Guam, is the contracting activity (FA5240-24-D-0004 – FA5240-25-F-0117).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "Modern International Inc., Barrigada, Guam, was awarded a $16,985,204 firm-fixed-price contract for airfield construction. This contract provides for repairs to the tie feeder circuits P-84 and P-85. Work will be performed on Andersen Air Force Base, Guam, and is expected to be completed by Feb. 22, 2027. This contract was a competitive acquisition and eight offers were received. Fiscal 2025 operations and maintenance appropriations funds in the amount of $16,985,204 are being obligated at the time of award. The 36th Contracting Squadron, Andersen Air Force Base, Guam, is the contracting activity (FA5240-25-C-0002).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "EB Airfoils LLC, Palm City, Florida, was awarded a firm-fixed-price, indefinite-delivery/indefinite-quantity $13,357,344 contract for TF-33 Engine sustainment. This contract provides for the repair of 2nd stage compressor blade sets. Work will be performed at Palm City, Florida, and is expected to be completed by July 2029.  This contract was a competitive acquisition and one offer was received. No funds will be obligated at time of award. The Air Force Sustainment Center, Tinker Air Force Base, Oklahoma, is the contracting activity (FA8121-25-D-0011). (Awarded August 20, 2025)",
    "contract_date": "2025-08-21"
  },
  {
    "text": "Sea Pac Engineering Inc., Los Angeles, California, was awarded a $9,905,586 firm-fixed-price contract for BPS, tank and well repairs. This contract provides for design and repair of the Marbo Bulk Pump Station, Tank 2, Wells 1 and 3, Work will be performed at Andersen Air Force Base, Guam, and is expected to be completed by Nov. 1, 2027. This contract was a competitive acquisition, and three offers were received. Fiscal 2025 operations and maintenance appropriations funds in the amount of $9,905,586 are being obligated at the time of award. The 36th Contracting Squadron, Andersen Air Force Base, Guam, is the contracting activity (FA5240-25-C-0004).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "S & K Design Build LLC, St. Ignatius, Montana, was awarded a firm-fixed-price contract for design-bid-build project for water infrastructure. The amount of this action is $ 7,844,620 with a total cumulative face value of $7,983,270. Bids were solicited via the internet with three received. Work will be performed in Melrose, New Mexico, with an estimated completion date of July 31, 2026. Fiscal 2025 military construction, defense-wide funds in the amount of $7,844,620 were obligated at the time of the award. U.S. Army Corps of Engineers, Albuquerque, New Mexico, is the contracting activity (W912PP-25-C-0007).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "V. Lopes Jr. & Sons GEC,* Santa Maria, California, was awarded a firm-fixed-price contract for construction of a vehicle maintenance shop. The amount of this action is $15,836,653. Bids were solicited via the internet with four received. Work will be performed in Bakersfield, California, with an estimated completion date of March 18, 2027. Fiscal 2021 military construction, Army National Guard funds in the amount of $15,836,653 were obligated at the time of the award. U.S. Property and Fiscal Office, California, is the contracting activity (W912LA-25-C-A002).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "Scale AI Inc.,* San Francisco, California, was awarded a firm-fixed price contract for research and development services. The amount of this action is $99,490,983. Bids were solicited via the internet with 11 received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 20, 2030. Army Contracting Command, Aberdeen Proving Ground, Adelphi, Maryland, is the contracting activity (W911QX-25-D-A011).",
    "contract_date": "2025-08-21"
  },
  {
    "text": "*Small business**Mandatory source",
    "contract_date": "2025-08-21"
  }
]