[
  {
    "text": "Huntington Ingalls Inc., Newport News, Virginia, is awarded a $160,094,898 cost-plus-incentive fee modification to previously awarded Contract N00024-21-C-2106 for the USS John C. Stennis (CVN 74) Refueling Complex Overhaul for supplemental work. Work will be performed in Newport News, Virginia, and is expected to be completed by October 2026. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $5,000,000 will be obligated at time of award and will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Raytheon Technologies Corp., Pratt and Whitney Military Engines, East Hartford, Connecticut, is awarded a $67,179,755 cost-plus-incentive-fee, cost-plus-fixed-fee, fixed-price-incentive-fee modification (P00072) to a previously awarded contract (N0001921C0011). This contract action allows for the procurement of recurring depot level maintenance and repair, sustainment support,  program management, financial and administrative activities, propulsion integration, replenishment spare part buys, engineering support, material management, configuration management, product management support, software sustainment, security management, joint technical data updates, and support equipment management for all fielded F135 propulsion systems at the F-35 production sites and operational locations, to include training in support of the F-35 Lightning II aircraft for the Air Force, Marine Corps, Navy, Foreign Military Sales (FMS) customers, and non-U.S. Department of Defense (DOD) participants. Work will be performed in East Hartford, Connecticut (40%); Oklahoma City, Oklahoma (21%); Indianapolis, Indiana (12%); West Palm Beach, Florida (6%); Windsor Locks, Connecticut (6%); Brekstad, Norway (4%); Leeuwarden, Netherlands (3%); Iwakuni, Japan (3%); Williamtown, Australia (2%); Cameri, Italy (1%); Marham, United Kingdom (1%); and Fort Worth, Texas (1%), and is expected to be completed in November 2025. Fiscal 2025 operations and maintenance (Air Force) funds in the amount of $24,445,035; fiscal 2025 operations and maintenance (Marine Corps) funds in the amount of $17,004,930; fiscal 2025 operations and maintenance (Navy) funds in the amount of $5,320,112; FMS funds in the amount of $6,660,642; and non-U.S. DOD participant funds in the amount of $13,749,035, will be obligated at time of award, $57,303,832 of which will expire at the end of the current fiscal year. The contract being modified was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "The Boeing Co., Seattle, Washington, is awarded a $39,995,549 cost-plus-fixed-price order (N0001925F0254) against a previously issued basic ordering agreement (N0001921G0006). This order is for procurement of P-8A platform sustainment support, support equipment maintenance, engineering investigations, and integrated maintenance augmentation support in support of the Navy; and the governments of Australia, the United Kingdom, Norway, New Zealand, the Republic of Korea and Germany. Work will be performed in Jacksonville, Florida (25%); Whidbey Island, Washington (15%); Kaneohe Bay, Hawaii (5%); Patuxent River, Maryland (5%); Keflavik, Iceland (5%); Sigonella, Italy (6%); Manama, Bahrain (6%); Kadena, Japan (5%); Misawa, Japan (5%); Seattle, Washington (2.5%); Oceana, Virginia (2.5%); Fayetteville, Tennessee (2.5%); Mesa, Arizona (2.5%); Dayton, Ohio (2.5%); Columbus, Ohio (2.5%); Fort Walton Beach, Florida (2.5%); Huntsville, Alabama (2.5%); and various other locations within the continental U.S. (1%); and outside the continental U.S. (2%), and is expected to be completed in September 2027. Fiscal 2025 Royal Australian Air Force funds in the amount of $270,095; fiscal 2025 Foreign Military Sales funds in the amount of $1,542,027; fiscal 2025 operations and maintenance (Navy) funds in the amount of $15,941,801; and fiscal 2025 other customer funds in the amount of $21,787,216, will be obligated at time of award, $37,729,017 of which will expire at the end of the fiscal year. This order was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "JP Harvey – Stantec JV*, Hampton, Virginia, is awarded a $30,000,000 firm-fixed price, indefinite-delivery/indefinite-quantity contract for general architectural and engineering services for small- to medium-sized facilities projects. Work will be performed at Navy and Marine Corps installations in Washington, D.C., Virginia, and Maryland, within the Naval Facilities Engineering Systems Command, Washington area of operations. The work is expected to be completed by Sept. 30, 2030. The maximum dollar value, including the base period and one option period, is $30,000,000. Fiscal 2025 operations and maintenance, Navy funds in the amount of $10,000 will be obligated at time of award for the minimum guarantee and will expire at the end of the current fiscal year. This contract was competitively procured via the sam.gov website, with 16 offers received. Naval Facilities Engineering Systems Command, Washington, D.C., is the contracting activity (N40080-25-D-1001).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Raymond Pond Federal Solutions JV LLC,* Conyers, Georgia, is awarded a $30,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for general architectural and engineering services for small- to medium-sized facilities projects. Work will be performed at Navy and Marine Corps installations in Washington, D.C., Virginia, and Maryland, within the Naval Facilities Engineering Systems Command Washington area of operations. The work is expected to be completed by Sept. 30, 2030. The maximum dollar value, including the base period and one option period, is $30,000,000. Fiscal 2025 operations and maintenance, Navy funds in the amount of $10,000 will be obligated at time of award for the minimum guarantee and will expire at the end of the current fiscal year. This contract was competitively procured via the sam.gov website, with 16 offers received. Naval Facilities Engineering Systems Command Washington is the contracting activity (N40080-25-D-1002).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $22,166,392 cost-plus-fixed-fee and fixed-price incentive modification (P00058) to a previously awarded contract (N0001920C0032). This modification adds scope to acquire material utilizing U.S. government and F-35 partner funds to support depot stand-up repair capabilities organically. Work will be performed in Fort Worth, Texas (100%), and is expected to be completed in September 2028. Foreign Military Sales customer funds in the amount of $2,207,265; fiscal 2025 award approval sheet foreign partner funds in the amount of $3,790,422; fiscal 2025 operations and maintenance (Air Force) funds in the amount of $9,441,487; fiscal 2025 operations and maintenance (Marine Corps) funds in the amount of $5,188,998; and fiscal 2025 operations and maintenance (Navy) funds in the amount of $872,168, will be obligated at time of award, none of which will expire at the end of the fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Vertex Modernization and Sustainment LLC, Indianapolis, Indiana, is being awarded a $20,216,722 modification to increase contract ceiling on a previously awarded cost-plus-fixed-fee, indefinite-quantity/indefinite-delivery contract (N00039-17-D-0004) for Environmental Satellite Receiver Processor (ESRP) specialized engineering support services. No funding will be placed on contract and obligated at the time of award. The ESRP system provides real-time direct readout of environmental data to the meteorology and oceanography (METOC) personnel to support mission planning and execution in all warfare areas. The system ingests, stores, processes, and displays raw data from multiple national and international (polar and geostationary) METOC environmental satellite families for mission planning and execution. This modification will allow for continued procurement of highly specialized engineering services to analyze and implement system functional upgrades, update system documentation, and repair hardware and software for the Navy's meteorological and oceanographic satellite receiver processor systems. The contract includes a 10-year ordering period. Work will be performed in Indianapolis, Indiana, and is expected to be completed by Jan. 30, 2027. In accordance with 10 U.S. Code 3204(a)(1) - Only One Responsible Source (Federal Acquisition Regulation subpart 6.302-1), this sole-source modification was not competitively procured. The Naval Information Warfare Systems Command, San Diego, California, is the contracting activity (N00039).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Lockheed Martin Corp., Rotary and Mission Systems, Moorestown, New Jersey, is awarded an $18,315,750 cost-plus-fixed-fee contract to provide design agent field engineering services in support of the AN/SPY-1 Series Radar Antenna, which is integrated within the Aegis Combat System. This contract combines purchases for the Navy and the governments of Japan and Spain under the Foreign Military Sales (FMS) program. No FMS (Japan) or FMS (Spain) funds will be obligated at this time. This contract includes options which, if exercised, would increase the cumulative contract value to $74,680,938. Work will be performed in Yokosuka, Japan (23%); San Diego, California (18%); Mayport, Florida (17%); Rota, Spain (12%); Norfolk, Virginia (10%); Seattle, Washington (10%); Pearl Harbor, Hawaii (7%); Port Hueneme, California (2%); and Wallops Island, Virginia (1%), and is expected to be completed by September 2026. If all options are exercised, work will continue through September 2029. Fiscal 2025 other procurement (Navy) funds in the amount of $1,073,776 (57%); and fiscal 2025 operations and maintenance (Navy) funds in the amount of $802,750 (43%), will be obligated at the time of award, of which $802,750 will expire at the end of the current fiscal year. This contract was a sole source acquisition pursuant to 10 U.S. Code 3204(a)(1). Naval Surface Warfare Center Port Hueneme Division, Port Hueneme, California, is the contracting activity (N6339425C0005).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Metron Inc.,* Reston, Virginia, is awarded a cost-plus-fixed-fee contract for the \"Research, Development and Transition in Support of Mission Planning\" effort. This contract focuses on enhancing the Navy's mission planning capabilities by integrating advanced Meteorology and Oceanography (METOC) data and probabilistic risk assessments. The research and development effort will improve the Navy's ability to incorporate physical battlespace factors, including atmospheric effects on the electromagnetic spectrum, space weather and acoustic impacts, into multi-domain mission planning and risk management systems. The contractor will develop algorithms and decision support tools to predict and assess the impacts of uncertain risks on naval operations, considering factors like hazardous weather and sea state conditions and the use of autonomous and remote systems. The program will deliver user-friendly analysis tools and decision aids that provide insights into potential mission and force risks. The project’s approach leverages observed, predicted and derived METOC data to improve fleet operations and decision making. Work will be performed in Reston, Virginia, and is expected to be completed in September 2030. The total cumulative value of this contract, including a 60-month base period with no options, is $9,953,224. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $988,917 are obligated at the time of award and will not expire at the end of the current fiscal year. This contract was competitively procured under long range broad agency announcement (BAA) N0001424SB001 entitled \"Long Range Broad Agency Announcement (BAA) for Navy and Marine Corps Science and Technology.\" Since proposals were received throughout the year under the Long-Range BAA, the number of proposals received in response to the solicitation is unknown. The Office of Naval Research, Arlington, Virginia, is the contracting activity (N0001425C2209).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Raytheon Co., Tucson, Arizona, is awarded a $7,729,850 cost-plus-fixed-fee modification to previously awarded contract N00024-23-C-5401 to exercise options for design agent and engineering support for the Rolling Airframe Missile (RAM).  Work will be performed in Tucson, Arizona and is expected to be completed by March 2028. Foreign Military Sales (FMS) (Japan) funds in the amount of $5,110,038 (96%); and FMS (Canada) funds in the amount of $199,674 (4%), will be obligated at time of award of which none will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Puerto Rico Apparel Manufacturing Corp.,** Mayaguez, Puerto Rico, has been awarded a maximum $142,479,750 fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for various types of combat uniform unisex coats and trousers. This was a competitive acquisition with five responses received. This is a five-year contract with no option periods. The ordering period end date is Sept. 10, 2030. Using military services are Army and Air Force. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-0091).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Draeger Inc. Telford, Pennsylvania, has been awarded a maximum $18,024,786 firm-fixed-price, indefinite-quantity contract for hazard-detecting instruments and apparatus. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a five-year contract with no option periods. The performance completion date is Sept. 29, 2030. Using military services are Army, Navy, and Air Force. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Columbus, Ohio (SPE7MX-25-D-0048).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Propper International Inc., Cabo Rojo, Puerto Rico, has been awarded a maximum $15,340,320 firm-fixed-price, definite-delivery/definite-quantity contract for improved combat vehicle coverall supplies. This was a sole-source acquisition using justification 10 U.S. Code 3204 (c)(3), as stated in Federal Acquisition Regulation 6.302-3. This is a one-year one-month contract with no option periods. The ordering period end date is Oct. 2, 2026. Using military service is Army. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-C-0005).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "National Industries for the Blind,*** Alexandria, Virginia, has been awarded an estimated $15,142,500 modification (P00017) exercising the third one-year option period of a one-year base contract (SPE1C1-23-D-B002) with four one-year option periods for advanced combat helmet pad suspension system. This is a firm-fixed-price, indefinite-delivery/indefinite-quantity contract. The ordering period end date is Sept. 17, 2026. Using military service is Army. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Global Advanced Metals USA Inc.,* Boyertown, Pennsylvania, has been awarded a maximum $8,610,400 firm-fixed-price delivery order (SP8000-25-F-0008) issued against a three-year contract (SP8000-25-D-0005) with no option periods for tantalum ingots. This is a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. The performance completion date is Sept. 4, 2028. Using military services are Army, Navy, Air Force, Marine Corps, and Space Force. Type of appropriation is fiscal 2025 transaction funds. The contracting activity is the Defense Logistics Agency Contracting Services Office, Columbus Division #3, Columbus, Ohio.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Sargent Aerospace & Defense LLC, Tucson, Arizona, has been awarded a maximum $8,040,870 firm-fixed-price contract for various direct linear valves. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a four-year nine-month contract with no option periods. The performance completion date is June 1, 2031. Using military service is Navy. Type of appropriation is fiscal 2025 Navy working capital funds. The contracting activity is the Defense Logistics Agency, Land and Maritime, Mechanicsburg, Pennsylvania (SPRMM1-25-C-HT01).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "UPDATE: KLS-Martin Limited Partnership,* Jacksonville, Florida (SPE2DF-25-D-0003, $9,000,000) has been awarded as an awardee to the multiple award contract for consumable dental supplies issued against solicitation SPE2DE-20-R-0007 and awarded June 10, 2021. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "University of South Florida Institute of Applied Engineering Inc., Tampa, Florida, was awarded a cost-plus-fixed-fee contract with a ceiling of $85,000,000 for basic research and development services in information operations, vulnerability/survivability assessment, and analysis. The amount of this action is $85,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 29, 2030. Army Contracting Command, Aberdeen Proving Ground, Adelphi Division, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Teledyne FLIR Defense, Wilsonville, Oregon, was awarded a $27,369,443 firm-fixed-price contract, with a total cumulative face value of $32,098,547, for the commercial Stryker Infantry Carrier Vehicle Recon Kit, accessories, and integration. Bids were solicited via the internet with one received. Work will be performed in Wilsonville, Oregon, with an estimated completion date of Dec. 3, 2028. Fiscal 2025 Foreign Military Sales (Bulgaria) funds in the amounts of $27,369,443 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "DRS Network & Imaging Systems LLC, Melbourne, Florida, was awarded a $22,896,418 modification (P00016) to contract W909MY-22-C-0023 for the manufacture, assembly, testing, and delivery of 3GEN FLIR Dewar Cooler Benches. The modification brings the total cumulative face value of the contract to $26,182,651. Work will be performed in Melbourne, Florida, with an estimated completion date of Jan. 31, 2028. Fiscal 2025 other procurement, Army funds in the amount of $22,896,418 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "F & R Construction Group Inc., San Juan, Puerto Rico, was awarded a $22,274,324 firm-fixed-price contract for the construction of an advanced skills training barracks. Bids were solicited via the internet with five received. Work will be performed in Fort Buchanan, Puerto Rico, with an estimated completion date of June 10, 2028. Fiscal 2025 military construction funds in the amount of $22,274,324 were obligated at the time of the award. U.S. Army Corps of Engineers, Louisville District, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "American Mine Services LLC, Lafayette, Colorado, was awarded a $9,086,696 firm-fixed-price contract for the replacement of butterfly valves and insulation at the Jennings Randolph Lake Dam. The amount of this action is $9,086,696. Bids were solicited via the internet with four received. Work will be performed in Elk Garden, West Virginia, with an estimated completion date of Sept. 10, 2027. Fiscal 2025 operation and maintenance, Corps of Engineers, civil funds in the amount of $9,086,696 were obligated at the time of the award. U.S. Army Corps of Engineers, Baltimore District, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Paetzold Construction Co. Inc., Browns Mills, Jersey City, New Jersey (FA4484-25-D-0018); Ranco Construction Inc., Southampton, New Jersey (FA4484-25-D-0019); and Sequoia Construction Inc., Mt Laurel, New Jersey (FA4484-25-D-0020), were awarded a ceiling $49,500,000 firm-fixed-price, indefinite-delivery/indefinite-quantity, multiple award contract for underground utilities. The work consists of furnishing all labor, materials, equipment, transportation, fuel, supervision, and permits required for the improvement and replacement of utilities. Work will be performed at Joint Base McGuire-Dix-Lakehurst, New Jersey, and is expected to be completed by March 10, 2030. These contracts were competitive acquisitions and 11 offers were received. No funds are being obligated at the time of award. The 87th Contracting Squadron, Joint Base McGuire-Dix-Lakehurst, New Jersey, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "Lockheed Martin, Littleton, Colorado, has been awarded a $7,503,606 modification (P00184) to a previously awarded contract (FA8807‐18‐C‐0009), Global Positioning System III Follow-On, for Launch and On-Orbit Support Year One. The modification brings the total cumulative face value of the contract from $4,102,529,136 to $4,110,032,742. Work will be performed at Littleton, Colorado, and is expected to be completed by Dec. 31, 2026. Fiscal 2025 research, development, test and evaluation funds in the amount of $500,000 are being obligated at time of award. The Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity.",
    "contract_date": "2025-09-11"
  },
  {
    "text": "L-3 Communications Integrated Systems L.P., doing business as L3 Aeromet, Tulsa, Oklahoma, is being awarded a $34,573,000 modification (P00019) to a previously awarded indefinite-delivery/indefinite-quantity contract to increase the ceiling. The value of this contract is increased from $172,719,699 to $207,292,700.00. Under this contract, the contractor will provide support for the Airborne Sensors (ABS) Program. These efforts will continue operations and sustainment and mission support of the ABS aircraft and sensor equipment, mission planning and flight test execution, and improvement and modernization efforts. The work will be performed in Tulsa, Oklahoma. The performance period is from Sept. 15, 2025, through Sept. 14, 2026. Fiscal 2025 research, development, test and evaluation funds in the amount of $3,902,032 are being obligated at the task order level with this award. The Missile Defense Agency, Huntsville, Alabama, is the contracting activity (HQ0855-21-D-0001).",
    "contract_date": "2025-09-11"
  },
  {
    "text": "*Small business**Women-owned small business***Mandatory source",
    "contract_date": "2025-09-11"
  }
]