[
  {
    "text": "Lockheed Martin Corporation Missiles and Fire Control, Dallas, Texas, is being awarded a $2,063,197,215 modification (P00105) to a previously awarded contract (HQ0147-17-C-0032) for the production of Terminal High Altitude Area Defense (THAAD) Interceptors to support the U.S. government. The total value of this contract is increased from $8,353,586,643 to $10,416,783,858. Under this modification, the contractor will produce THAAD components under fixed-price incentive (firm-target) contract line-item numbers. The work will be performed in Dallas, Texas; Sunnyvale, California; Troy, Alabama; and Camden, Arkansas, with an expected completion date Dec. 1, 2029. One offer was solicited, and one offer was received. Fiscal 2024 and fiscal 2025 procurement funds in the amount of $284,917,283 are being obligated at time of award. The Missile Defense Agency, Huntsville, Alabama, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "General Dynamics Information Technology, Falls Church, Virginia, was awarded a $98,000,000 contract modification (P00030) to extend the ordering period and ceiling value to a previously awarded competitive, single award, indefinite-delivery/indefinite-quantity contract (HC1028-15-D-0007) to provide communications systems acquisition, integration, installation, operations, and maintenance in support of U.S. Air Forces Central Command (USAFCENT) deployed mission requirements. The ordering period is extended to Sept. 8, 2026, and the lifecycle value of this contract action is increased by $98,000,000. The total lifecycle value of the contract is $814,000,000. Performance will be at USAFCENT locations throughout Southwest Asia. The Defense Information Technology Contracting Organization, Scott Air Force Base, Illinois, is the contracting activity. (Awarded June 23, 2025)",
    "contract_date": "2025-07-28"
  },
  {
    "text": "Whitman Requardt and Associates LLP, Baltimore, Maryland, was awarded a $90,000,000 modification (P00005) to contract W912DR-20-D-0006 for architect-engineer services. The modification brings the total cumulative face value of the contract to $90,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 30, 2026. U.S. Army Corps of Engineers, Baltimore, Maryland, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "Burns and McDonnell Engineering Co. Inc., Arlington, Virginia, was awarded a $90,000,000 modification (P00007) to contract W912DR-20-D-0002 for architect-engineer services. The modification brings the total cumulative face value of the contract to $90,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 30, 2026. U.S. Army Corps of Engineers, Baltimore, Maryland, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "AECOM Technical Services Inc., Los Angeles, California, was awarded a $90,000,000 modification (P00004) to contract W912DR-20-D-0001 for architect-engineer services. The modification brings the total cumulative face value of the contract to $90,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 30, 2026. U.S. Army Corps of Engineers, Baltimore, Maryland, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "Stantec Consulting Services Inc., Raleigh, North Carolina, was awarded a $90,000,000 modification (P00006) to contract W912DR-20-D-0005 for architect-engineer services. The modification brings the total cumulative face value of the contract to $90,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 30, 2026. U.S. Army Corps of Engineers, Baltimore, Maryland, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "HDR Engineering Inc., Woodcliff Lake, New Jersey, was awarded a $90,000,000 modification (P00008) to contract W912DR-20-D-0004 for architect-engineer services. The modification brings the total cumulative face value of the contract to $90,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 30, 2026. U.S. Army Corps of Engineers, Baltimore, Maryland, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "Gf-D Design Partners JV, Fairfax, Virginia, was awarded a $90,000,000 modification (P00004) to contract W912DR-20-D-0003 for architect-engineer services. The modification brings the total cumulative face value of the contract to $90,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 30, 2026. U.S. Army Corps of Engineers, Baltimore, Maryland, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "The Boeing Co., Mesa, Arizona, was awarded an $11,024,012 modification (P00010) to contract W58RGZ-24-C-0036 for maintenance augmentation team services. The modification brings the total cumulative face value of the contract to $11,024,012. Work will be performed in Mesa, Arizona, with an estimated completion date of July 31, 2026. Fiscal 2025 Foreign Military Sales funds (Qatar) in the amount of $11,024,012 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "Viasat Inc., Carlsbad, California (FA8807-25-F-B017); Northrop Grumman Space Systems, Dulles, Virginia (FA8807-25-F-B018); Astranis Space Technologies Corp., San Francisco, California (FA8807-25-F-B019); Intelsat General Communications LLC, McLean, Virginia (FA8807-25-F-B020); and The Boeing Co., El Segundo, California (FA8807-25-F-B021), have been awarded combined $37,296,196 firm-fixed-price, multiple-award, indefinite‐delivery/indefinite‐quantity contracts for the procurement of design and demonstration in support of the Protected Tactical Satellite-Global program. Work will be performed at the listed contractors' locations and is expected to be completed by Jan. 31, 2026. These contracts were a competitive acquisition and eight offers were received. Fiscal 2025 research, development, test and evaluations funds in the amount of $37,296,196 are being obligated at the time of award. The Space Systems Command, Los Angeles Air Force Base, is the contracting activity.",
    "contract_date": "2025-07-28"
  },
  {
    "text": "Sea Pac Engineering Inc., Los Angeles, California, was awarded a $36,882,982 firm-fixed-price contract for troop housing construction. This contract provides for design and full repair of the Palau Dorm B25016, Andersen Air Force Base, Guam. Work will be performed at Andersen Air Force Base, Guam and is expected to be completed by Dec. 10, 2027. This contract was a competitive acquisition, and five offers were received. Fiscal 2025 operations and maintenance appropriations funds in the amount of $36,882,982 are being obligated at the time of award. The 36th Contracting Squadron, Andersen AFB, Guam, is the contracting activity (FA5240-25-C-0005).",
    "contract_date": "2025-07-28"
  },
  {
    "text": "University of Oklahoma, Norman, Oklahoma was awarded a $8,800,000 cost-reimbursement contract for sustainment and modernization research and development: operationalizing additive manufacturing (AM), phase two. This contract provides for development of a cross-platform AM repair framework for quality assurance and the development of a performance-based AM qualification framework along with research on advanced manufacturing techniques for avionics sustainment, ensuring a robust, scalable approach to modernizing Air Force logistics and maintenance operations. Work will be performed at Norman, Oklahoma, and is expected to be completed by Oct. 15, 2028. This contract was a competitive acquisition and one offer was received. Fiscal 2024 research and development funds in the amount of $8,800,000 are being obligated at time of award. The Air Force Laboratory, Wright Patterson Air Force Base, Dayton, Ohio, is the contracting activity (FA2394-25-C-B029).",
    "contract_date": "2025-07-28"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-28"
  }
]