[
  {
    "contractors": [
      {
        "name": "CACI Inc.",
        "contract_id": "HTC71125DE120",
        "location": "Chantilly, Virginia"
      }
    ],
    "purpose": "The contract provides technical support services to field and sustain the Joint Transportation Management System at Scott Air Force Base, Illinois.",
    "amount": 1640000000.0,
    "contracting_agency": {
      "name": "U.S. Transportation Command, Directorate of Acquisition",
      "location": "Scott AFB, Illinois"
    },
    "contract_date": "2025-08-11",
    "award_text": "CACI Inc., Chantilly, Virginia (HTC71125DE120), has been awarded an indefinite-delivery/indefinite-quantity contract with a total cumulative face value of $1,640,000,000. Funds will be allocated on individual task orders. The contract provides technical support services to field and sustain the Joint Transportation Management System at Scott Air Force Base, Illinois. The base period of performance is from Aug. 12, 2025, through Aug. 11, 2035. The U.S. Transportation Command, Directorate of Acquisition, Scott AFB, Illinois, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "General Dynamics Electric Boat Corp.",
        "contract_id": "N00024-24-C-2124",
        "location": "Groton, Connecticut"
      }
    ],
    "purpose": "engineering, technical, design agent, and planning yard support for operational strategic and attack submarines",
    "amount": 322593238.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-11",
    "award_text": "General Dynamics Electric Boat Corp., Groton, Connecticut, was awarded a $322,593,238 cost-plus-fixed-fee modification to a previously awarded contract (N00024-24-C-2124) for engineering, technical, design agent, and planning yard support for operational strategic and attack submarines. Work will be performed in Groton, Connecticut (70%); Kings Bay, Georgia (13%); Bangor, Washington (10%); Pearl Harbor, Hawaii (3%); North Kingston, Rhode Island (2%); and Newport, Rhode Island (2%), and is expected to be completed by September 2025. Fiscal 2025 other procurement (Navy) funds in the amount of $16,527,923 (53%); fiscal 2025 operations and maintenance (Navy) funds in the amount of $14,275,119 (46%); and fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $367,000 (1%), will be obligated at time of award, of which $14,275,119 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Delphinus",
        "contract_id": "N00104-25-D-B501",
        "location": "Newton Square, Pennsylvania"
      },
      {
        "name": "Epsilon",
        "contract_id": "N00104-25-D-B601",
        "location": "Portsmouth, Virginia"
      },
      {
        "name": "Oceaneering",
        "contract_id": "N00104-25-D-B701",
        "location": "Chesapeake, Virginia"
      }
    ],
    "purpose": "for the repair of valves and actuators within the corporate component repair program for Virginia-class and Los Angeles-class submarines",
    "amount": 86000000.0,
    "contracting_agency": {
      "name": "Naval Supply Systems Command Weapon Systems Support",
      "location": "Mechanicsburg, Pennsylvania"
    },
    "contract_date": "2025-08-11",
    "award_text": "Delphinus,* Newton Square, Pennsylvania (N00104-25-D-B501); Epsilon, Portsmouth, Virginia (N00104-25-D-B601); and Oceaneering, Chesapeake, Virginia (N00104-25-D-B701), are being awarded a $86,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity, multiple award contract for the repair of valves and actuators within the corporate component repair program for Virginia-class and Los Angeles-class submarines. Each contract contains a provision for three option years. Work will be completed by August 2027. All work will be performed in various contractor facilities identified at task order level that cannot be determined at this time. Working capital funds (Navy) in the amount of $1,500 will be obligated ($500 on each of the three contracts) to fund the contracts’ minimum amount, and funds will not expire at the end of the fiscal year. These contracts were procured through full and open competition with five offers received. Naval Supply Systems Command Weapon Systems Support, Mechanicsburg, Pennsylvania, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "General Atomics Aeronautical Systems Inc.",
        "contract_id": "N0001925F0024",
        "location": "Poway, California"
      }
    ],
    "purpose": "This order provides engineering and logistics support to include program management, spares analyst, non-standard maintenance, engineering investigation, mishap investigation support, configuration change management support, production and sustainment diminishing manufacturing supply and material shortage support, airworthiness certification support, cybersecurity and network support, software modification and maintenance support, mission system and sensor payload modification integration solutions and support, reliability and maintainability analysis, trade studies and data management services in support of the successful operational capability for the MQ-9A Reaper Marine Air Ground Task Force Expeditionary Medium Altitude Long Endurance Unmanned Aerial System.",
    "amount": 35114050.0,
    "contracting_agency": {
      "name": "Naval Air Systems Command",
      "location": "Patuxent River, Maryland"
    },
    "contract_date": "2025-08-11",
    "award_text": "General Atomics Aeronautical Systems Inc., Poway, California, is awarded a $35,114,050 cost-plus-fixed-fee order (N0001925F0024) against a previously issued basic ordering agreement (N0001922G0006). This order provides engineering and logistics support to include program management, spares analyst, non-standard maintenance, engineering investigation, mishap investigation support, configuration change management support, production and sustainment diminishing manufacturing supply and material shortage support, airworthiness certification support, cybersecurity and network support, software modification and maintenance support, mission system and sensor payload modification integration solutions and support, reliability and maintainability analysis, trade studies and data management services in support of the successful operational capability for the MQ-9A Reaper Marine Air Ground Task Force Expeditionary Medium Altitude Long Endurance Unmanned Aerial System. Work will be performed in Poway, California (42%); Yuma, Arizona (13%); Kaneohe Bay, Hawaii (11%); Patuxent River, Maryland (7%); Cherry Point, North Carolina (7%); and various locations outside the continental U.S. (20%), and is expected to be completed in August 2026. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $17,211,330; and fiscal 2025 aircraft procurement (Navy) funds in the amount of $3,478,700, will be obligated at the time of award, $17,211,330 of which will expire at the end of the current fiscal year. This order was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Rotary and Mission Systems",
        "contract_id": "N00024-23-C-5117",
        "location": "Moorestown, New Jersey"
      }
    ],
    "purpose": "to exercise option items supporting systems engineering and software integration for the integrated combat system across the surface force portfolio of the Navy and Coast Guard.",
    "amount": 16182918.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-11",
    "award_text": "Lockheed Martin Rotary and Mission Systems, Moorestown, New Jersey, is awarded a $16,182,918 cost-plus-award-fee modification to previously awarded contract (N00024-23-C-5117) to exercise option items supporting systems engineering and software integration for the integrated combat system across the surface force portfolio of the Navy and Coast Guard. Work will be performed in Moorestown, New Jersey (41%); Columbia, Maryland (30%); Norfolk, Virginia (7%); Middletown, Rhode Island (6%); College Park, Maryland (5%); Mount Laurel, New Jersey (4%); Huntsville, Alabama (3%); Wallops Island, Virginia (1%); Arlington, Virginia (1%); San Diego, California (1%); and Herndon, Virginia (1%), and is expected to be completed by September, 2025. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $10,751,464 (77%); fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $1,416,615 (10%); fiscal 2025 weapon procurement (Navy) funds in the amount of $1,350,000 (10%); fiscal 2024 weapon procurement (Navy) funds in the amount of $166,102 (1%); fiscal 2024 other procurement (Navy) funds in the amount of $115,156 (1%); fiscal 2023 weapon procurement (Navy) funds in the amount of $50,195 (<1%); and fiscal 2023 other procurement (Navy) funds in the amount of $29,527 (<1%), will be obligated at time of award and funds in the amount of $29,527 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Pacific Maritime Industries Corp.",
        "contract_id": "N0018925D0027",
        "location": "San Diego, California"
      },
      {
        "name": "Quality Metal Works Inc.",
        "contract_id": "N0018925D0028",
        "location": "New Orleans, Louisiana"
      },
      {
        "name": "Atlantic Fabrication & Boiler Services",
        "contract_id": "N0018925D0033",
        "location": "Portsmouth, Virginia"
      }
    ],
    "purpose": "To provide commander, Mid-Atlantic Regional Maintenance Command lightweight modular berth, related material, and replacement parts in support of the Shipboard Habitability Improvement Program.",
    "amount": 13000000.0,
    "contracting_agency": {
      "name": "Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department",
      "location": "Norfolk, Virginia"
    },
    "contract_date": "2025-08-11",
    "award_text": "Pacific Maritime Industries Corp.,* San Diego, California (N0018925D0027); Quality Metal Works Inc.,* New Orleans, Louisiana (N0018925D0028); and Atlantic Fabrication & Boiler Services,* Portsmouth, Virginia (N0018925D0033), are being awarded a $13,000,000 multiple award, fixed-fee, indefinite-delivery/indefinite-quantity contract that will include terms and conditions for the placement of firm-fixed-price task orders, to provide commander, Mid-Atlantic Regional Maintenance Command lightweight modular berth, related material, and replacement parts in support of the Shipboard Habitability Improvement Program. Each of the three contracts will run concurrently and will include a 60-month base ordering period with a six-month option period. The ordering period is expected to begin August 2025 and be completed by August 2030; if the option is exercised, work will be completed by February 2031. Work will be performed in San Diego, California; New Orleans, Louisiana; and Portsmouth, Virginia, and percentage of work cannot be determined at this time. Fiscal 2025 operation and maintenance (Navy) funds in the amount of $1,500 will be obligated ($500 on each of the three contracts) to fund the contracts’ minimum amount, and funds will expire at the end of the fiscal year. Individual task orders will be subsequently funded with appropriate fiscal year appropriations at the time of their issuance. The requirement was competitively procured under a small business set-aside pursuant to Federal Acquisition Regulation 16.504 with one offer received. Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department, Norfolk, Virginia, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Sikorsky Aircraft Corp. a Lockheed Martin Co.",
        "contract_id": "N0001925F2157",
        "location": "Stratford, Connecticut"
      }
    ],
    "purpose": "cost-plus-fixed-fee, firm-fixed-price order",
    "amount": 21629891.0,
    "contracting_agency": {
      "name": "Department of Defense",
      "location": "Washington, DC"
    },
    "contract_date": "2025-08-11",
    "award_text": "CORRECTION: The $21,629,891 cost-plus-fixed-fee, firm-fixed-price order awarded to Sikorsky Aircraft Corp. a Lockheed Martin Co., Stratford, Connecticut, on July 24, 2025, was announced with the incorrect order number. The correct number is N0001925F2157."
  },
  {
    "contractors": [
      {
        "name": "Defense Engineering Corp.",
        "contract_id": "FA2377-25-D-B002 - FA2377-25-F-B004",
        "location": "Beavercreek, Ohio"
      }
    ],
    "purpose": "This contract provides for the STARS Program with RF sensing on all-weather intelligence, surveillance, and reconnaissance missions using nontraditional modes for persistent surveillance across multiple environments from multiple environments to improve the ability of the Air Force and Tri-Service Community programs.",
    "amount": 94975000.0,
    "contracting_agency": {
      "name": "Air Force Research Laboratory",
      "location": "Wright-Patterson Air Force Base, Ohio"
    },
    "contract_date": "2025-08-11",
    "award_text": "Defense Engineering Corp., Beavercreek, Ohio, was awarded a shared ceiling $94,975,000 multiple award fair opportunity indefinite-quantity/indefinite-delivery for Science and Technology Applied Radio Frequency (RF) Systems (STARS). This contract provides for the STARS Program with RF sensing on all-weather intelligence, surveillance, and reconnaissance missions using nontraditional modes for persistent surveillance across multiple environments from multiple environments to improve the ability of the Air Force and Tri-Service Community programs. Work will be performed at Beavercreek, Ohio, and is expected to be completed by Aug. 11, 2031. This contract was a competitive acquisition and 12 offers were received. Fiscal 2025 research, development, test and evaluation funds in the amount of $365,959 are being obligated at time of award. The Air Force Research Laboratory, Wright-Patterson Air Force Base, Ohio, is the contracting activity (FA2377-25-D-B002 - FA2377-25-F-B004)."
  },
  {
    "contractors": [
      {
        "name": "The Boeing Co., Defense, Space & Security",
        "contract_id": "FA8134-25-F-0001",
        "location": "Oklahoma City, Oklahoma"
      }
    ],
    "purpose": "E-4B maintenance, repair and engineering issues",
    "amount": 79737087.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Tinker AFB, Oklahoma"
    },
    "contract_date": "2025-08-11",
    "award_text": "The Boeing Co., Defense, Space & Security, Oklahoma City, Oklahoma, was awarded an indefinite-delivery/indefinite-quantity contract for $79,737,087 E-4B Programmed Depot Maintenance #8. This contract provides for E-4B maintenance, repair and engineering issues. Work will be performed in Oklahoma City, Oklahoma; Offutt Air Force Base, Nebraska; and San Antonio, Texas, with an expected completion date of Dec. 21, 2026. This contract was a sole source acquisition. Fiscal 2025 operations and maintenance funds in the approximate amount of $79,737,087 are obligated at time of award. Air Force Life Cycle Management Center, Tinker AFB, Oklahoma, is the contracting activity (FA8134-25-F-0001). (Awarded Aug. 8, 2025)"
  },
  {
    "contractors": [
      {
        "name": "SpendSmart Group LLC",
        "contract_id": "FA4417-25-D-0002",
        "location": "Park Ridge, Illinois"
      }
    ],
    "purpose": "This contract provides for non-personal services to support a simplified method for Civil Engineer Squadron personnel and facility managers to purchase quality materials, tools, and equipment used for work tasks, construction, recurring preventive maintenance, repairs, and the base U-Fix-It program.",
    "amount": 15000000.0,
    "contracting_agency": {
      "name": "1st Special Operations Contracting Squadron",
      "location": "Hurlburt Field, Florida"
    },
    "contract_date": "2025-08-11",
    "award_text": "SpendSmart Group LLC, Park Ridge, Illinois, was awarded a $15,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for the Contractor Operated Civil Engineer Supply Store Base Supply Store. This contract provides for non-personal services to support a simplified method for Civil Engineer Squadron personnel and facility managers to purchase quality materials, tools, and equipment used for work tasks, construction, recurring preventive maintenance, repairs, and the base U-Fix-It program. Work will be performed at Hurlburt Field, Florida, and is expected to be completed by Sept. 30, 2030. This contract was a small business set-aside acquisition, and one offer was received. Fiscal 2025 operations and maintenance appropriations funds in the amount of $3,000 are being obligated at time of award. The 1st Special Operations Contracting Squadron, Hurlburt Field, Florida, is the contracting activity (FA4417-25-D-0002)."
  },
  {
    "contractors": [
      {
        "name": "Florida Department of Education, Division of Blind Services",
        "contract_id": "FA4417-25-C-0009",
        "location": "Tallahassee, Florida"
      }
    ],
    "purpose": "Provide mess attendant services and non-personal services to support dining operations at the Reef-2-Go and Riptide Dining Facilities at Hurlburt Field, Florida.",
    "amount": 9626120.0,
    "contracting_agency": {
      "name": "1st Special Operations Contracting Squadron",
      "location": "Hurlburt Field, Florida"
    },
    "contract_date": "2025-08-11",
    "award_text": "Florida Department of Education, Division of Blind Services, Tallahassee, Florida, was awarded a $9,626,120 firm-fixed-price contract for mess attendant services at Hurlburt Field, Florida. This contract provides for non-personal services to support dining operations at the Reef-2-Go and Riptide Dining Facilities. Work will be performed at Hurlburt Field, Florida, and is expected to be completed by Jan. 15, 2030. This contract was a competitive acquisition, and five offers were received. Fiscal 2025 operations and maintenance appropriation funds in the amount of $9,626,120 are being obligated at the time of award. The 1st Special Operations Contracting Squadron, Hurlburt Field, Florida, is the contracting activity (FA4417-25-C-0009)."
  },
  {
    "contractors": [
      {
        "name": "CACI NSS LLC",
        "contract_id": "FA8555-25-D-B001",
        "location": "Reston, Virginia"
      }
    ],
    "purpose": "firm-fixed-price, cost-plus-fixed fee, and cost-reimbursable no fee, indefinite-delivery/indefinite-quantity contract",
    "amount": 43202330.0,
    "contracting_agency": {
      "name": "Air Force",
      "location": "Wright-Patterson AFB, Ohio"
    },
    "contract_date": "2025-08-11",
    "award_text": "CORRECTION: The $43,202,330 firm-fixed-price, cost-plus-fixed fee, and cost-reimbursable no fee, indefinite-delivery/indefinite-quantity contract awarded to CACI NSS LLC, Reston, Virginia (FA8555-25-D-B001), announced on Aug. 7, 2025, was announced with the wrong award date. The correct award date is Aug. 11, 2025."
  },
  {
    "contractors": [
      {
        "name": "Accenture Federal Services LLC",
        "contract_id": "W52P1J-21-C-0025",
        "location": "Arlington, Virginia"
      }
    ],
    "purpose": "To exercise Option Year Four of the Enterprise Task Management Software Solution",
    "amount": 35484050.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Rock Island, Illinois"
    },
    "contract_date": "2025-08-11",
    "award_text": "Accenture Federal Services LLC, Arlington, Virginia, was awarded a $35,484,050 modification (P00062) to contract W52P1J-21-C-0025 to exercise Option Year Four of the Enterprise Task Management Software Solution. The modification brings the total cumulative face value of the contract to $250,804,312. Work will be performed in Fort Belvoir, Virginia, with an estimated completion date of Aug. 14, 2026. Fiscal 2025 operation and maintenance, Army funds in the amount of $35,484,050 were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "ACME General Corp.",
        "contract_id": "W911QX-25-C-A004",
        "location": "Morgantown, West Virginia"
      }
    ],
    "purpose": "research and development for data analysis to support a technology transition framework.",
    "amount": 9553268.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Aberdeen Proving Ground, Maryland"
    },
    "contract_date": "2025-08-11",
    "award_text": "ACME General Corp., Morgantown, West Virginia, was awarded a $9,553,268 firm-fixed-price contract for research and development for data analysis to support a technology transition framework. The total cumulative face value of the contract is $31,477,958. Bids were solicited via the internet with one received. Work will be performed in Morgantown, West Virginia, with an estimated completion date of Aug. 11, 2028. Fiscal 2025 research, development, test, and evaluation, Army funds in the amount of $2,460,251 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W911QX-25-C-A004)."
  },
  {
    "contractors": [
      {
        "name": "RTX Corp.",
        "contract_id": "SPRBL1-25-D-0006",
        "location": "Arlington, Virginia"
      }
    ],
    "purpose": "for RTX systems and end-item production, spare parts, services and other types of support under an umbrella contract with indefinite-delivery/indefinite-quantity and 'C' type subsumable contracts for negotiated pricing",
    "amount": 50000000000.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Land and Maritime",
      "location": "Aberdeen Proving Ground, Maryland"
    },
    "contract_date": "2025-08-01",
    "award_text": "RTX Corp., Arlington, Virginia, has been awarded a maximum $50,000,000,000 terms and conditions umbrella contract for RTX systems and end-item production, spare parts, services and other types of support. This umbrella is comprised of basic terms and conditions allowing for indefinite-delivery/indefinite-quantity and \"C\" type subsumable contracts for negotiated pricing. This contract was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a 20-year contract with no option periods. Locations of performance are inside and outside the continental U.S., with a July 31, 2045, performance completion date. Using customers are Army, Defense Logistics Agency and Defense Department. Using customers are solely responsible for funding the subsumable contracts and vary in appropriations type and fiscal year. The contracting activity is the Defense Logistics Agency Land and Maritime, Aberdeen Proving Ground, Maryland (SPRBL1-25-D-0006)."
  },
  {
    "contractors": [
      {
        "name": "Valiant Technical Services Inc.",
        "contract_id": "SP3300‐25-C-5002",
        "location": "Fayetteville, North Carolina"
      }
    ],
    "purpose": "Chemical Management Services/Third Party Logistics services",
    "amount": 22545627.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Distribution",
      "location": "New Cumberland, Pennsylvania"
    },
    "contract_date": "2025-08-01",
    "award_text": "Valiant Technical Services Inc., Fayetteville, North Carolina, has been awarded an estimated $22,545,627 hybrid firm-fixed-price, fixed price with economic-price-adjustment, time-and-material contract for Chemical Management Services/Third Party Logistics services. This was a competitive acquisition with one response received. This is a one-year base contract with four one-year option periods. Location of performance is Georgia, with a July 31, 2026, performance completion date. Using military service is Air Force. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Distribution, New Cumberland, Pennsylvania (SP3300‐25-C-5002)."
  },
  {
    "contractors": [
      {
        "name": "The Source Group Inc.",
        "contract_id": "SPE603-25-D-5003",
        "location": "Signal Hill, California"
      }
    ],
    "purpose": "environmental restoration, compliance and facility maintenance services at Defense Fuel Support Point, Norwalk, California",
    "amount": 26513566.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Energy",
      "location": "Fort Belvoir, Virginia"
    },
    "contract_date": "2025-08-01",
    "award_text": "The Source Group Inc., Signal Hill, California, has been awarded an estimated $26,513,566 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for environmental restoration, compliance and facility maintenance services at Defense Fuel Support Point, Norwalk, California. This was a competitive acquisition with one response received. This is a four-year base contract with one six-month option period. The ordering period end date is July 31, 2029. Using customer is Defense Logistics Agency. Type of appropriations is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Energy, Fort Belvoir, Virginia (SPE603-25-D-5003)."
  },
  {
    "contractors": [
      {
        "name": "Peckham Inc.",
        "contract_id": "SPE1C1-25-D-N008",
        "location": "Lansing, Michigan"
      }
    ],
    "purpose": "for fleece undershirts",
    "amount": 12443328.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-01",
    "award_text": "Peckham Inc.,** Lansing, Michigan, has been awarded a maximum $12,443,328 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for fleece undershirts. This is a five-year contract with no option periods. The ordering period end date is July 31, 2030. Using military service is Marine Corps. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-N008)."
  },
  {
    "contractors": [
      {
        "name": "Tecmotiv (USA) Inc.",
        "contract_id": "SPRDL1-25-D-0062",
        "location": "Niagara Falls, New York"
      }
    ],
    "purpose": "for turbo superchargers",
    "amount": 10416679.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Land and Maritime",
      "location": "Warren, Michigan"
    },
    "contract_date": "2025-08-01",
    "award_text": "Tecmotiv (USA) Inc.,* Niagara Falls, New York, has been awarded a maximum $10,416,679 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for turbo superchargers. This is a five-year contract with no option periods. This was a competitive acquisition with three responses received. The performance completion date is Aug. 1, 2030. Using military service is Army. Type of appropriation is fiscal 2025 through 2030 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan (SPRDL1-25-D-0062)."
  },
  {
    "contractors": [
      {
        "name": "Palantir USG Inc.",
        "contract_id": "W519TC-25-D-0039",
        "location": "Palo Alto, California"
      }
    ],
    "purpose": "Transitioning existing contracts in which Palantir is currently a prime or subcontractor to this enterprise agreement.",
    "amount": 10000000000.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Rock Island Arsenal, Illinois"
    },
    "contract_date": "2025-08-01",
    "award_text": "Palantir USG Inc., Palo Alto, California, was awarded a firm-fixed-price contract transitioning existing contracts in which Palantir is currently a prime or subcontractor to this enterprise agreement. The amount of this action is $10,000,000,000. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2035. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity (W519TC-25-D-0039). (Awarded July 31, 2025)"
  },
  {
    "contractors": [
      {
        "name": "The Boeing Co.",
        "contract_id": "W58RGZ-25-D-0022",
        "location": "Ridley Park, Pennsylvania"
      }
    ],
    "purpose": "cargo engineering and logistics support services",
    "amount": 883122870.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Redstone Arsenal, Alabama"
    },
    "contract_date": "2025-08-01",
    "award_text": "The Boeing Co., Ridley Park, Pennsylvania, was awarded a cost-plus-fixed-fee contract for cargo engineering and logistics support services. The amount of this action is $883,122,870. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2030. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity (W58RGZ-25-D-0022)."
  },
  {
    "contractors": [
      {
        "name": "IMT Defense Corp.",
        "contract_id": "W15QKN-23-D-0009",
        "location": "Champaign, Illinois"
      }
    ],
    "purpose": "for 155mm Artillery M795 Metal Part Assemblies",
    "amount": 358766929.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Newark, New Jersey"
    },
    "contract_date": "2025-08-01",
    "award_text": "IMT Defense Corp.,* Champaign, Illinois, was awarded a $358,766,929 modification (P00009) to contract W15QKN-23-D-0009 for 155mm Artillery M795 Metal Part Assemblies. The modification brings the total cumulative face value of the contract to $749,781,969. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Nov. 21, 2027. Army Contracting Command, Newark, New Jersey, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "BAE Systems Land & Armaments L.P.",
        "contract_id": "W56HZV-23-C-0024",
        "location": "York, Pennsylvania"
      }
    ],
    "purpose": "Procurement of Armored Multipurpose Vehicles",
    "amount": 139597684.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Detroit Arsenal, Michigan"
    },
    "contract_date": "2025-08-01",
    "award_text": "BAE Systems Land & Armaments L.P., York, Pennsylvania, was awarded a $139,597,684 modification (P00033) to contract W56HZV-23-C-0024 for the procurement of Armored Multipurpose Vehicles. The modification brings the total cumulative face value of the contract to $2,286,486,021. Work will be performed in York, Pennsylvania, with an estimated completion date of May 31, 2028. Fiscal 2025 procurement of weapons and tracked combat vehicles, Army funds in the amount of $139,597,684 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Systems Products and Solutions Inc.",
        "contract_id": "W15QKN-25-D-0020",
        "location": "Huntsville, Alabama"
      }
    ],
    "purpose": "Maintenance support for device version four rugged and version four light systems.",
    "amount": 74792859.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Newark, New Jersey"
    },
    "contract_date": "2025-08-01",
    "award_text": "Systems Products and Solutions Inc.,* Huntsville, Alabama, was awarded a firm-fixed-price contract for maintenance support device version four rugged and version four light systems. The amount of this action is $74,792,859 with a total cumulative face value of $74,792,859. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2030. Army Contracting Command, Newark, New Jersey, is the contracting activity (W15QKN-25-D-0020)."
  },
  {
    "contractors": [
      {
        "name": "Outside the Box",
        "contract_id": "W912PM-25-C-0033",
        "location": "Richmond, Virginia"
      }
    ],
    "purpose": "construction",
    "amount": 18885132.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Wilmington, North Carolina"
    },
    "contract_date": "2025-08-01",
    "award_text": "Outside the Box,* Richmond, Virginia, was awarded a firm-fixed-price contract for construction. The amount of this action is $18,885,132 with a total cumulative face value of $18,885,132. Bids were solicited via the internet with eight received. Work will be performed in Camp Mackall, North Carolina, with an estimated completion date of Sept. 20, 2027. Fiscal 2025 military construction, defense-wide funds in the amount of $18,885,132 were obligated at the time of the award. U.S. Army Corps of Engineers, Wilmington, North Carolina, is the contracting activity (W912PM-25-C-0033)."
  },
  {
    "contractors": [
      {
        "name": "Computable Insights LLC",
        "contract_id": "W519TC-25-C-0037",
        "location": "Herndon, Virginia"
      }
    ],
    "purpose": "For Salesforce software licenses",
    "amount": 99697753.0,
    "contracting_agency": {
      "name": "Department of Defense",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-01",
    "award_text": "CORRECTION: The $99,697,753 firm-fixed-price contract (W519TC-25-C-0037) announced on July 30, 2025, to Computable Insights LLC, Herndon, Virginia, for Salesforce software licenses, was actually awarded on July 31, 2025."
  },
  {
    "contractors": [
      {
        "name": "The MITRE Corp.",
        "contract_id": "FA8702-25-C-B001",
        "location": "Bedford, Massachusetts"
      }
    ],
    "purpose": "support to the Air Force from MITRE as the administrator of the National Security Engineering Center Federally Funded Research and Development Center",
    "amount": 583945675.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Hanscom Air Force Base, Massachusetts"
    },
    "contract_date": "2025-08-01",
    "award_text": "The MITRE Corp., Bedford, Massachusetts, has been awarded a ceiling $583,945,675 cost reimbursement continuation contract for support to the Air Force from MITRE as the administrator of the National Security Engineering Center Federally Funded Research and Development Center. This contract provides for the exercise of an option under the basic contract (FA8702-19-C-0001). This contract was a sole-source acquisition. Work will be performed at Bedford, Massachusetts; McLean, Virginia; other various locations throughout the continental U.S.; and outside the continental U.S., and is expected to be completed by Sept. 30, 2026. This contract involves Foreign Military Sales to various countries. Fiscal 2025 research and development funds in the amount of $103,511 are being obligated at the time of award. The Air Force Life Cycle Management Center, Hanscom Air Force Base, Massachusetts, is the contracting activity (FA8702-25-C-B001)."
  },
  {
    "contractors": [
      {
        "name": "SJ Technologies Inc.",
        "contract_id": "FA7014-25-F-0232",
        "location": "Sugar Hill, Georgia"
      }
    ],
    "purpose": "This contract provides for consultation and planning, business solutions, life-cycle support services, and software engineering development services to support senior decision makers at Headquarters Air Force, including the Secretary of the Air Force, the Air Staff, and other Air Force organizations within the National Capital Region.",
    "amount": 50000000.0,
    "contracting_agency": {
      "name": "Air Force District of Washington, Contracting",
      "location": "Joint Base Andrews, Maryland"
    },
    "contract_date": "2025-08-01",
    "award_text": "SJ Technologies Inc., Sugar Hill, Georgia, was awarded a maximum $50,000,000 firm-fixed-price task order for software development services. This contract provides for consultation and planning, business solutions, life-cycle support services, and software engineering development services to support senior decision makers at Headquarters Air Force, including the Secretary of the Air Force, the Air Staff, and other Air Force organizations within the National Capital Region. Work will be performed at Joint Base Andrews, Maryland, and is expected to be complete by March 31, 2031 (includes a six-month extension). This contract was a competitive acquisition and 16 offers were received. Fiscal 2025 operations and maintenance appropriations in the amount of $8,797,214 are being obligated at the time of award. The Air Force District of Washington, Contracting, Joint Base Andrews, Maryland, is the contracting activity (FA7014-25-F-0232)."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Corp.",
        "contract_id": "FA8807-24-C-B001",
        "location": "Sunnyvale, California"
      }
    ],
    "purpose": "to provide risk reduction and design activities for the Mobile User Objective System Service Life Extension (MUOS SLE) Phase I prior to entering MUOS SLE Phase II",
    "amount": 29414652.0,
    "contracting_agency": {
      "name": "Space Systems Command",
      "location": "Los Angeles Air Force Base, California"
    },
    "contract_date": "2025-08-01",
    "award_text": "The Lockheed Martin Corp., Sunnyvale, California, has been awarded a $29,414,652 modification (P00014) to a previously awarded contractor (FA8807-24-C-B001) to provide risk reduction and design activities for the Mobile User Objective System Service Life Extension (MUOS SLE) Phase I prior to entering MUOS SLE Phase II. The modification will bring the total cumulative face value of the contract to $95,414,413. Work will be performed at the contractor's facility and is expected to be completed by Aug. 1, 2026. Fiscal 2025 research, development, test and evaluation appropriation funding in the amount of $10,000,000 is being obligated at the time of modification award. The Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Benaka Inc.",
        "contract_id": "FA4800-25-C-0010",
        "location": "New Brunswick, New Jersey"
      }
    ],
    "purpose": "Repairing and renovating Langley Dorm Facility 130, including repairs to exterior closure and roof, windows and doors, concrete masonry unit block walls and drywall, structural members, walkway overhangs and railings, sidewalks, exterior lighting, plumbing, electrical, communications, fire alarm and suppression, heating, ventilation, and air-conditioning systems, replacement of all interior finishes, and construction of a new 520 square feet utility building.",
    "amount": 23881532.0,
    "contracting_agency": {
      "name": "633rd Contracting Squadron",
      "location": "Joint Base Langley-Eustis, Virginia"
    },
    "contract_date": "2025-08-01",
    "award_text": "Benaka Inc., New Brunswick, New Jersey, was awarded a $23,881,532 firm-fixed-price contract for repairing and renovating Langley Dorm Facility 130. This contract provides for repairs of exterior closure and roof, windows and doors, damage to concrete masonry unit block walls and drywall, degradation of structural members, extensive repair of walkway overhangs and railings, sidewalks, exterior lighting, repair and replacement of plumbing, electrical, communications, fire alarm and suppression, and heating, ventilation, and air-conditioning systems, and replacement of all interior finishes and construction of a new 520 square feet utility building. Work will be performed on Langley Air Force Base, Virginia, and is expected to be completed June 10, 2027. This contract was a competitive acquisition and four offers were received. Fiscal 2025 operations and maintenance funds in the amount of $23,881,532 are being obligated at the time of award. The 633rd Contracting Squadron, Joint Base Langley-Eustis, Virginia, is the contracting activity (FA4800-25-C-0010)."
  },
  {
    "contractors": [
      {
        "name": "Raytheon Technologies Corp.",
        "contract_id": "N0001923C0030",
        "location": "East Hartford, Connecticut"
      }
    ],
    "purpose": "This modification adds scope to procure long-lead time materials for the future production and delivery of F135 propulsion systems for the F-35 in support of the Joint Strike Fighter program for the Air Force, Marine Corps, Navy, F-35 Cooperative Program Partners, and Foreign Military Sales (FMS) customers.",
    "amount": 115075000.0,
    "contracting_agency": {
      "name": "Naval Air Systems Command",
      "location": "Patuxent River, Maryland"
    },
    "contract_date": "2025-08-01",
    "award_text": "Raytheon Technologies Corp., doing business as Pratt and Whitney Military Engines, East Hartford, Connecticut, is awarded a $115,075,000 contract modification (P00007) to the previously awarded firm-fixed-price, cost-plus-incentive-fee and fixed-price incentive Lot 19 contract (N0001923C0030). This modification adds scope to procure long-lead time materials for the future production and delivery of F135 propulsion systems for the F-35 in support of the Joint Strike Fighter program for the Air Force, Marine Corps, Navy, F-35 Cooperative Program Partners, and Foreign Military Sales (FMS) customers. Work will be performed in East Hartford, Connecticut (20%); Indianapolis, Indiana (15%); Minneapolis, Minnesota (11%); Rocky Mountain, North Carolina (9%); Cleveland, Ohio (6%); Hartford, Connecticut (2%); Laconia, New Hampshire (2%); Detroit, Michigan (2%); Joplin, Missouri (2%); Redmond, Oregon (2%); Phoenix, Arizona (1%); various locations within the continental U.S. (1%); and various locations outside the continental U.S (27%), and is expected to be completed in February 2028. Fiscal 2024 aircraft procurement (Navy) funding in the amount of $1,800,000; fiscal 2024 aircraft procurement (Marine Corps) funding in the amount of $29,725,000; fiscal 2024 aircraft procurement (Marine Corps) funding in the amount of $8,400,000; FMS funds in the amount of $44,150,000; and non-U.S. Department of Defense participant funds in the amount of $31,000,000, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. The Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "TOTE Services LLC",
        "contract_id": "N3220525C4084",
        "location": "Jacksonville, Florida"
      }
    ],
    "purpose": "Operation and maintenance of Operation Petroleum Discharge System (OPDS) vessels to support Military Sealift Command's pre-positioning requirements on a worldwide basis.",
    "amount": 49880134.0,
    "contracting_agency": {
      "name": "Military Sealift Command",
      "location": "Norfolk, Virginia"
    },
    "contract_date": "2025-08-01",
    "award_text": "TOTE Services LLC, Jacksonville, Florida, is being awarded a $49,880,134 firm-fixed-price contract (N3220525C4084) inclusive of pass-through items for the operation and maintenance of Operation Petroleum Discharge System (OPDS) vessels. OPDS will continue supporting Military Sealift Command's pre-positioning requirements on a worldwide basis. This contract includes one 12-month base period, one 12-month option period, and one three-month option period. The contract will be performed on a worldwide basis beginning Aug. 1, 2025, and will conclude on Oct. 31, 2027, if all options are exercised. This contract will be non-competitively awarded under the authority of 10 U.S. Code 3204(a)(2), as implemented by Federal Acquisition Regulation 6.302-1(a)(2), Only One Responsible Source No Other Supplies or Services Will Satisfy Agency Requirements, as captured on the Government Point of Entry website. Military Sealift Command, Norfolk, Virginia, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Maritime Institute of Technology and Graduate Studies",
        "contract_id": "N3220525D4204",
        "location": "Linthicum Heights, Maryland"
      }
    ],
    "purpose": "to provide a comprehensive Unlicensed Mariner to Licensed Mariner Training Program",
    "amount": 43000000.0,
    "contracting_agency": {
      "name": "Military Sealift Command",
      "location": "Norfolk, Virginia"
    },
    "contract_date": "2025-08-01",
    "award_text": "Maritime Institute of Technology and Graduate Studies, Linthicum Heights, Maryland, is awarded a $43,000,000 indefinite-delivery/indefinite-quantity, firm-fixed-price contract (N3220525D4204) to provide a comprehensive Unlicensed Mariner to Licensed Mariner Training Program. The contract will be performed in Linthicum Heights, Maryland, with an ordering period beginning on Aug. 1, 2025, and concluding on July 31, 2035, if all options are exercised. The contract will have a five-year ordering period and an option to extend the ordering period for an additional five years. The solicitation utilized full and open competition with proposals solicited via the Government Point of Entry website and one proposal was received in response to the solicitation. Military Sealift Command, Norfolk, Virginia, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "B.L. Harbert International LLC",
        "contract_id": "W91278-25-D-0033",
        "location": "Birmingham, Alabama"
      },
      {
        "name": "Brasfield & Gorrie LLC",
        "contract_id": "W91278-25-D-0034",
        "location": "Birmingham, Alabama"
      },
      {
        "name": "Caddell Construction Co. LLC",
        "contract_id": "W91278-25-D-0035",
        "location": "Montgomery, Alabama"
      },
      {
        "name": "Hensel Phelps",
        "contract_id": "W91278-25-D-0036",
        "location": "Orlando, Florida"
      },
      {
        "name": "Korte Construction Co.",
        "contract_id": "W91278-25-D-0037",
        "location": "St. Louis, Missouri"
      },
      {
        "name": "The Whiting-Turner Contracting Co.",
        "contract_id": "W91278-25-D-0038",
        "location": "Baltimore, Maryland"
      }
    ],
    "purpose": "general repair and construction",
    "amount": 245000000.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Mobile, Alabama"
    },
    "contract_date": "2025-08-04",
    "award_text": "B.L. Harbert International LLC, Birmingham, Alabama (W91278-25-D-0033); Brasfield & Gorrie LLC, Birmingham, Alabama (W91278-25-D-0034); Caddell Construction Co. LLC, Montgomery, Alabama (W91278-25-D-0035); Hensel Phelps, Orlando, Florida (W91278-25-D-0036); Korte Construction Co., St. Louis, Missouri (W91278-25-D-0037); and The Whiting-Turner Contracting Co., Baltimore, Maryland (W91278-25-D-0038), will compete for each order of the $245,000,000 firm-fixed-price contract for general repair and construction. The total cumulative face value is $245,000,000. Bids were solicited via the internet with 19 received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 3, 2030. Army Contracting Command, Mobile, Alabama, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Goodyear Tire & Rubber Co.",
        "contract_id": "W91CRB-21-D-0003",
        "location": "Akron, Ohio"
      }
    ],
    "purpose": "for the purchase of tires",
    "amount": 14699590.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Aberdeen Proving Ground, Maryland"
    },
    "contract_date": "2025-08-04",
    "award_text": "Goodyear Tire & Rubber Co., Akron, Ohio, was awarded a $14,699,590 modification (P00010) to contract W91CRB-21-D-0003 for the purchase of tires. The modification brings the total cumulative face value of the contract to $77,758,247. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Dec. 20, 2025. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "JJR Solutions LLC",
        "contract_id": "W519TC-25-F-0192",
        "location": "Dayton, Ohio"
      }
    ],
    "purpose": "Small Business Innovation Research Phase III",
    "amount": 38486892.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Rock Island, Illinois"
    },
    "contract_date": "2025-08-04",
    "award_text": "JJR Solutions LLC,* Dayton, Ohio, was awarded a $9,231,910 modification (P00004) to contract W519TC-25-F-0192 for Small Business Innovation Research Phase III. The modification brings the total cumulative face value of the contract to $38,486,892. Work will be performed in Newport News, Virginia, with an estimated completion date of Nov. 17, 2026. Fiscal 2023 and 2025 other procurement, Army funds; and 2025 research, development, test and evaluation, Army funds in the amount of $1,013,097, were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Kongsberg Defence & Aerospace",
        "contract_id": "M67854-25-C-0023",
        "location": "Kongsberg, Norway"
      }
    ],
    "purpose": "Procurement of 101 full rate production Amphibious Combat Vehicle (ACV) Medium Caliber Cannon Protector Remote Turrets, associated production costs, fielding and support costs, support and test equipment, and spares.",
    "amount": 117900168.0,
    "contracting_agency": {
      "name": "Marine Corps Systems Command",
      "location": "Quantico, Virginia"
    },
    "contract_date": "2025-08-04",
    "award_text": "Kongsberg Defence & Aerospace, Kongsberg, Norway, is awarded a $117,900,168 firm-fixed-price modification to the previously awarded undefinitized contract action (M67854-25-C-2023) for Amphibious Combat Vehicle (ACV) Medium Caliber Cannon Protector Remote Turret 20, hereafter referred to as the \"Turret\". The total value of the contract if all options are exercised is $271,476,370. This contract modification provides for the definitization of the contract and the exercise of the options for the procurement of 101 full rate production Turrets for the ACV Medium Caliber Cannon (ACV-30) vehicle, associated production costs, fielding and support costs, support & test equipment, and spares. Work will be performed in Johnstown, Pennsylvania (62%); and Kongsberg, Norway (38%), with an expected completion date of Sept. 30, 2027. Fiscal 2025 procurement (Marine Corps) funds in the amount of $117,900,168 will be obligated at the time of award and will not expire at the end of the fiscal year. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-C-0023)."
  },
  {
    "contractors": [
      {
        "name": "BAE Systems Land & Armaments LP",
        "contract_id": "M67854-16-C-0006",
        "location": "Sterling Heights, Michigan"
      }
    ],
    "purpose": "Exercise of options for the procurement of 31 full rate production Amphibious Combat Vehicles (ACV) medium caliber cannon mission role variants and associated production, fielding, support costs, and spares.",
    "amount": 181107842.0,
    "contracting_agency": {
      "name": "Marine Corps Systems Command",
      "location": "Quantico, Virginia"
    },
    "contract_date": "2025-08-04",
    "award_text": "BAE Systems Land & Armaments LP, Sterling Heights, Michigan, was awarded a $181,107,842 firm-fixed-price modification to a previously awarded contract (M67854-16-C-0006) for Amphibious Combat Vehicles (ACV). The total value of the contract, if all options are exercised, is $3,845,631,512. This contract modification provides for the exercise of options for the procurement of 31 full rate production ACV medium caliber cannon mission role variants and associated production, fielding and support costs, and spares. Work will be performed in York, Pennsylvania (60%); Aiken, South Carolina (15%); San Jose, California (15%); Sterling Heights, Michigan (5%); and Stafford, Virginia (5%) with an expected completion date of September 2027. Fiscal 2025 procurement (Marine Corps) funds in the amount of $181,107,842 will be obligated at the time of award and will not expire at the end of the current fiscal year. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-16-C-0006)."
  },
  {
    "contractors": [
      {
        "name": "Moog Military Aircraft LLC",
        "contract_id": "N00383-25-D-P001",
        "location": "Elma, New York"
      }
    ],
    "purpose": "for the repair or upgrade of various F/A-18E-G wingfold components. This is a five-year contract with no option periods. Work will be performed in Torrance, California (94%); North Island, California (4%); and East Aurora, New York (2%). Work is expected to be completed by July 31, 2031.",
    "amount": 96646355.0,
    "contracting_agency": {
      "name": "Naval Supply Systems Command Weapon Systems Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-04",
    "award_text": "Moog Military Aircraft LLC, Elma, New York, is being awarded $96,646,355 for a firm-fixed-price contract for the repair or upgrade of various F/A-18E-G wingfold components. This is a five-year contract with no option periods. Work will be performed in Torrance, California (94%); North Island, California (4%); and East Aurora, New York (2%). Work is expected to be completed by July 31, 2031. No funding will be obligated at the time of award. Individual delivery orders will be funded with appropriate fiscal year working capital funds (Navy) at the time of their issuance and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 2304 (c)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity (N00383-25-D-P001)."
  },
  {
    "contractors": [
      {
        "name": "General Atomics Aeronautical Systems Inc.",
        "contract_id": "N0001924F5559",
        "location": "Poway, California"
      }
    ],
    "purpose": "This order procures additional electronic warfare pods and ground control station spares in support of the marine air ground task force unmanned expeditionary medium altitude long endurance program for the Navy.",
    "amount": 19274696.0,
    "contracting_agency": {
      "name": "Naval Air Systems Command",
      "location": "Patuxent River, Maryland"
    },
    "contract_date": "2025-08-04",
    "award_text": "General Atomics Aeronautical Systems Inc., Poway, California, is awarded a $19,274,696, firm-fixed-price and cost-plus-fixed-fee modification (P00002) to an order (N0001924F5559) against a previously issued basic ordering agreement (N0001922G0006). This order procures additional electronic warfare pods and ground control station spares in support of the marine air ground task force unmanned expeditionary medium altitude long endurance program for the Navy. Work will be performed in Greenville, Texas (50%); and Poway, California (50%), and is expected to be completed by September 2027. Fiscal 2025 aircraft procurement (Marine Corps) funds in the amount of $14,914,242; and fiscal 2024 aircraft procurement (Marine Corps) funds in the amount of $4,360,454, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin, Rotary and Mission Systems",
        "contract_id": "N00024-21-C-5127",
        "location": "Moorestown, New Jersey"
      }
    ],
    "purpose": "for the development, implementation, and integration of a system security solution for the Australia Surface Combatant baseline configuration of the AEGIS combat system. This contract involves Foreign Military Sales (FMS) to the government of Australia.",
    "amount": 18753155.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-04",
    "award_text": "Lockheed Martin, Rotary and Mission Systems, Moorestown, New Jersey, was awarded a $18,753,155 cost-plus-incentive-fee modification to previously awarded contract (N00024-21-C-5127) for the development, implementation, and integration of a system security solution for the Australia Surface Combatant baseline configuration of the AEGIS combat system. This contract involves Foreign Military Sales (FMS) to the government of Australia. Work will be performed in Moorestown, New Jersey, and is expected to be completed by September 2031. FMS (Australia) funds in the amount of $11,000,000 (59%) will be obligated at the time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity. (Awarded Aug. 1, 2025)"
  },
  {
    "contractors": [
      {
        "name": "Systems Planning & Analysis Inc.",
        "contract_id": "N00024-23-C-2103",
        "location": "Alexandria, Virginia"
      }
    ],
    "purpose": "procurement of a supply chain improvement effort",
    "amount": 11866132.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-04",
    "award_text": "Systems Planning & Analysis Inc., Alexandria, Virginia, was awarded a $11,866,132 firm-fixed-price modification to previously awarded contract (N00024-23-C-2103) for procurement of a supply chain improvement effort. Work will primarily be performed in Alexandria, Virginia and is expected to be completed by July 2026. Foreign partner funds in the amount of $11,866,132 will be obligated at time of award and will not expire at the end of the current fiscal year.  The Naval Sea Systems Command, Washington, D.C., is the contracting activity. (Awarded Aug. 1, 2025)"
  },
  {
    "contractors": [
      {
        "name": "Raytheon Co.",
        "contract_id": "N00024-21-C-5434",
        "location": "Tucson, Arizona"
      }
    ],
    "purpose": "for design agent engineering in support of the Evolved SeaSparrow Missile and NATO SeaSparrow Missile Systems programs.",
    "amount": 10052768.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-04",
    "award_text": "Raytheon Co., Tucson, Arizona, is awarded a $10,052,768 cost-plus-fixed-fee modification to a previously awarded contract (N00024-21-C-5434) for design agent engineering in support of the Evolved SeaSparrow Missile and NATO SeaSparrow Missile Systems programs. Work will be performed in Tucson, Arizona (73%); Portsmouth, Rhode Island (26%); and various other locations each less than 1% (1%), and is expected to be completed by December 2025. Fiscal 2025 other customer funds in the amount of $6,451,408 (33%); fiscal 2025 weapon procurement (Navy) funds in the amount of $5,494,239 (28%); fiscal 2024 other customer funds in the amount of $4, 652,283 (23%); fiscal 2025 operations and maintenance (Navy) funds in the amount of $1,372,113 (7%); fiscal 2023 other customer funds in the amount of $1,289,148 (7%);  fiscal 2025 research, development, test, and evaluation (Navy) funds in the amount of $275,000 (1%); fiscal 2021 other customer funds in the amount of $260,000 (1%); and Foreign Military Sales (Japan) funds in the amount of $16,814 (less than 1%), will be obligated at time of award and $1,372,113 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Southwest Research Institute",
        "contract_id": "HR001123C0116",
        "location": "San Antonio, Texas"
      }
    ],
    "purpose": "This contract modification provides for distributable nodes to measure the high frequency (HF) radio environment for improved warfighter situational awareness in the critical HF radio band.",
    "amount": 9234661.0,
    "contracting_agency": {
      "name": "Defense Advanced Research Projects Agency",
      "location": "Arlington, Virginia"
    },
    "contract_date": "2025-08-04",
    "award_text": "Southwest Research Institute, San Antonio, Texas, has been awarded a $9,234,661 cost-plus-fixed-fee engineering change proposal contract modification (P00008) to a previously awarded contract (HR001123C0116) for the Cancun Phase Two Option One program. This contract modification provides for distributable nodes to measure the high frequency (HF) radio environment for improved warfighter situational awareness in the critical HF radio band. Work will be performed in San Antonio, Texas (66%); Utica, New York (14%); Seattle, Washington (15%); and Chapel Hill, North Carolina (5%), with an expected completion date of December 2027. Fiscal 2025 research, development, test, and engineering funds in the amount of $470,000 are being obligated at time of award. The base contract was a competitive acquisition under broad agency announcement HR001123S0014, and 10 offers were received. Defense Advanced Research Projects Agency, Arlington, Virginia, is the contracting activity"
  },
  {
    "contractors": [
      {
        "name": "Wright & Wright Machinery Co. Inc.",
        "contract_id": "SPE8EC-25-D-0054",
        "location": "Monticello, Kentucky"
      }
    ],
    "purpose": "material handling equipment",
    "amount": 255000000.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-04",
    "award_text": "UPDATE: Wright & Wright Machinery Co. Inc.,* Monticello, Kentucky (SPE8EC-25-D-0054, $255,000,000), has been added as an awardee to the multiple award contract for material handling equipment, issued against solicitation SPE8EC-21-R-0001 and awarded July 22, 2022. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania."
  },
  {
    "contractors": [
      {
        "name": "TRAX International Corp.",
        "contract_id": "W51EW7-25-D-A002",
        "location": "Las Vegas, Nevada"
      }
    ],
    "purpose": "test center support services",
    "amount": 726894788.0,
    "contracting_agency": {
      "name": "Army Mission and Installation Contracting Command",
      "location": "Fort Sam Houston, Texas"
    },
    "contract_date": "2025-08-05",
    "award_text": "TRAX International Corp., Las Vegas, Nevada, was awarded a cost-plus-fixed-fee contract for test center support services. The amount of this action is $726,894,788. Bids were solicited via the internet with four received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 4, 2032. Army Mission and Installation Contracting Command, Fort Sam Houston, Texas, is the contracting activity (W51EW7-25-D-A002)."
  },
  {
    "contractors": [
      {
        "name": "Atherton Construction LLC",
        "contract_id": "W9124X-25-C-A001",
        "location": "Henderson, Nevada"
      }
    ],
    "purpose": "construction of a new qualification training range",
    "amount": 15604564.0,
    "contracting_agency": {
      "name": "U.S. Property and Fiscal Office",
      "location": "Nevada"
    },
    "contract_date": "2025-08-05",
    "award_text": "Atherton Construction LLC,* Henderson, Nevada, was awarded a firm-fixed-price contract for construction of a new qualification training range. The amount of this action is $15,604,564. Bids were solicited via the internet with two received. Work will be performed in Hawthorne, Nevada, with an estimated completion date of Dec. 8, 2026. Fiscal 2025 military construction, Army National Guard funds in the amount of $15,604,564 were obligated at the time of the award. U.S. Property and Fiscal Office, Nevada, is the contracting activity (W9124X-25-C-A001)."
  },
  {
    "contractors": [
      {
        "name": "Great Lakes Dredge & Dock Corp. LLC",
        "contract_id": "W912BU-25-C-A014",
        "location": "Houston, Texas"
      }
    ],
    "purpose": "beach renourishment",
    "amount": 8712500.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-05",
    "award_text": "Great Lakes Dredge & Dock Corp. LLC, Houston, Texas, was awarded a firm-fixed-price contract for beach renourishment. The amount of this action is $8,712,500. Bids were solicited via the internet with three received. Work will be performed in Rehoboth Beach, Delaware, with an estimated completion date of Dec. 13, 2025. Fiscal 2022 civil construction funds in the amount of $8,712,500 were obligated at the time of the award. U.S. Army Corps of Engineers, Philadelphia, Pennsylvania, is the contracting activity (W912BU-25-C-A014)."
  },
  {
    "contractors": [
      {
        "name": "The Dutra Group",
        "contract_id": "W912P7-25-C-A015",
        "location": "San Rafael, California"
      }
    ],
    "purpose": "berm construction and dredging",
    "amount": 8069000.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "San Francisco, California"
    },
    "contract_date": "2025-08-05",
    "award_text": "The Dutra Group, San Rafael, California, was awarded a firm-fixed-price contract for berm construction and dredging. The amount of this action is $8,069,000. Bids were solicited via the internet with four received. Work will be performed in Concord, California, with an estimated completion date of Jan. 5, 2026. Fiscal 2025 military construction, Army funds in the amount of $8,069,000 were obligated at the time of the award. U.S. Army Corps of Engineers, San Francisco, California, is the contracting activity (W912P7-25-C-A015)."
  },
  {
    "contractors": [
      {
        "name": "The county of Grand Forks",
        "contract_id": "HQ003424D009",
        "location": "Grand Forks, North Dakota"
      }
    ],
    "purpose": "The purpose of this contract is to provide Unmanned Aerial Systems (UAS) airspace operations technology and concept development support for the Office of the Under Secretary of Defense for Acquisition and Sustainment Unmanned Systems Office. This contract will execute simulated and/or live UAS events to address the technical, operational, and regulatory challenges associated with normalizing Department of Defense UAS operations.",
    "amount": 102873404.0,
    "contracting_agency": {
      "name": "Washington Headquarter Services",
      "location": "Arlington, Virginia"
    },
    "contract_date": "2025-08-05",
    "award_text": "The county of Grand Forks, North Dakota, was awarded a modification to an existing indefinite-delivery/indefinite-quantity contract (HQ003424D009). The amount of this action is $102,873,404. No amount is being obligated at this time. The cumulative total of the contract is $121,979,717. The purpose of this contract is to provide Unmanned Aerial Systems (UAS) airspace operations technology and concept development support for the Office of the Under Secretary of Defense for Acquisition and Sustainment Unmanned Systems Office. This contract will execute simulated and/or live UAS events to address the technical, operational, and regulatory challenges associated with normalizing Department of Defense UAS operations. The work will be performed in Grand Forks, North Dakota. The estimated contract completion date is May 19, 2029. Washington Headquarter Services, Arlington, Virginia, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Seemann Composites LLC",
        "contract_id": "N00167-25-D-0008",
        "location": "Gulfport, Mississippi"
      }
    ],
    "purpose": "multi-material propellor prototype requirement",
    "amount": 62000000.0,
    "contracting_agency": {
      "name": "Naval Surface Warfare Center Carderock Division",
      "location": "West Bethesda, Maryland"
    },
    "contract_date": "2025-08-05",
    "award_text": "Seemann Composites LLC, Gulfport, Mississippi, is awarded a $62,000,000 cost-plus-fixed-fee indefinite-delivery/indefinite-quantity contract (N00167-25-D-0008) for the multi-material propellor prototype requirement. Work will be performed in Gulfport, Mississippi, with an ordering period up to five years. Fiscal 2025 research and development test and evaluation (Navy) funds in the amount of $32,090 will be obligated at time of award. The contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1). Federal Acquisition Regulation 6.302-1(a)(ii)(B). Naval Surface Warfare Center Carderock Division, West Bethesda, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Huntington Ingalls Inc.",
        "contract_id": "N00024-23-C-2324",
        "location": "Pascagoula, Mississippi"
      }
    ],
    "purpose": "for work associated with the DDG 1000 modernization period execution",
    "amount": 20000000.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-05",
    "award_text": "Huntington Ingalls Inc., Pascagoula, Mississippi, is awarded a $20,000,000 cost-plus-incentive-fee modification to previously awarded contract N00024-23-C-2324 for work associated with the DDG 1000 modernization period execution. Of this amount, $10,000,000 is currently committed for future execution by the Supervisor of Shipbuilding Gulf Coast Administrative Contracting Officer. Work will be performed in Pascagoula, Mississippi (95%); and other locations below 1% (collectively totaling 5%), and is expected to be completed by September 2025. No funding will be obligated at the time of award. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "GPA Technologies Inc.",
        "contract_id": "N00024-25-D-4141",
        "location": "Ventura, California"
      },
      {
        "name": "Oceanetics Inc.",
        "contract_id": "N00024-25-D-4142",
        "location": "Annapolis, Maryland"
      },
      {
        "name": "PCCI Inc.",
        "contract_id": "N00024-25-D-4143",
        "location": "Alexandria, Virginia"
      },
      {
        "name": "Virtual Computing Technology Inc.",
        "contract_id": "N00024-25-D-4144",
        "location": "Solana Beach, California"
      }
    ],
    "purpose": "sustainment and refurbishment of waterborne security barriers, moorings, and marine facilities",
    "amount": 199000000.0,
    "contracting_agency": {
      "name": "Department of the Navy",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-05",
    "award_text": "CORRECTION: The $199,000,000 firm-fixed-price, cost-plus-fixed fee, indefinite-delivery/indefinite-quantity contract for the sustainment and refurbishment of waterborne security barriers, moorings, and marine facilities announced on July 23, 2025, had the wrong locations listed. The correction locations are: GPA Technologies Inc., Ventura, California (N00024-25-D-4141); Oceanetics Inc., Annapolis, Maryland (N00024-25-D-4142); PCCI Inc., Alexandria, Virginia (N00024-25-D-4143); and Virtual Computing Technology Inc., Solana Beach, California (N00024-25-D-4144)."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Corp. Missiles and Fire Control",
        "contract_id": "HQ0147-17-C-0032",
        "location": "Dallas, Texas"
      }
    ],
    "purpose": "Acquisition of the Terminal High Altitude Area Defense (THAAD) Configuration 3.1 Part B1 Ground Modernization equipment and associated labor to support the U.S. government under a firm-fixed-price contract line item.",
    "amount": 23564873.0,
    "contracting_agency": {
      "name": "Missile Defense Agency",
      "location": "Huntsville, Alabama"
    },
    "contract_date": "2025-08-05",
    "award_text": "Lockheed Martin Corp. Missiles and Fire Control, Dallas, Texas, is being awarded a $23,564,873 modification (P00106) to a previously awarded contract (HQ0147-17-C-0032) for the acquisition of the Terminal High Altitude Area Defense (THAAD) Configuration 3.1 Part B1 Ground Modernization equipment to support the U.S. government. The THAAD Configuration 3.1 Part B1, and associated labor, will be procured under a firm-fixed-price contract line item. The total value of this contract is increased from $10,416,783,858 to $10,440,348,731. The work will be performed in Dallas, Texas; Sunnyvale, California; Troy, Alabama; Huntsville, Alabama; and Camden, Arkansas, with an expected completion date Nov. 30, 2028. Fiscal 2025 procurement funds in the amount of $23,564,873 are being obligated at time of award. The Missile Defense Agency, Huntsville, Alabama, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "MCP Computer Products Inc.",
        "contract_id": "H9241524FE054",
        "location": "San Marcos, California"
      }
    ],
    "purpose": "Supply of Dell laptops and associated equipment in support of U.S. Special Operations Command (USSOCOM).",
    "amount": 15910864.0,
    "contracting_agency": {
      "name": "USSOCOM",
      "location": "MacDill Air Force Base, Florida"
    },
    "contract_date": "2025-08-05",
    "award_text": "MCP Computer Products Inc.,** San Marcos, California, is being awarded a delivery order (H9241524FE054) to a contract (47QTCA19D00ML) for Dell laptops, and associated equipment, with a delivery of 75 days after the date of the order. This is a firm-fixed-price order from blanket purchase agreement (BPA) 47QTCA22A000C with a value of $15,910,864 in support of U.S. Special Operations Command (USSOCOM). The BPA was solicited and issued using full and open after exclusion of sources, brand name or equal acquisition strategy; consideration was not restricted to any one vendor or brand. Fiscal 2025 operations and maintenance funds are being obligated at time of award. USSOCOM, MacDill Air Force Base, Florida, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "SJ Technologies Inc.",
        "contract_id": "FA7014-25-F-0232",
        "location": "Sugar Hill, Georgia"
      }
    ],
    "purpose": "Correction to previously announced contract details",
    "amount": 8797214.0,
    "contracting_agency": {
      "name": "U.S. Air Force",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-05",
    "award_text": "CORRECTION: The contract announced on Aug. 1, 2025, to SJ Technologies Inc., Sugar Hill, Georgia (FA7014-25-F-0232), was announced with the incorrect award amount and completion date. The correct award amount is $8,797,214 with fiscal 2025 operations and maintenance appropriations in the amount of $1,529,408 obligated at the time of award. The correct completion date is Feb. 4, 2031 (includes a six-month extension)."
  },
  {
    "contractors": [
      {
        "name": "Deloitte Consulting LLP",
        "contract_id": "FA7014-25-D-0007",
        "location": "Arlington, Virginia"
      }
    ],
    "purpose": "Provision of cyber training for the Department of Defense (DOD) Cyber Crime Center Cyber Training Academy follow-on, including training for Air Force and other DOD entities and personnel to defend DOD information systems from illegal, unauthorized, or counter-intelligence activities.",
    "amount": 115000000.0,
    "contracting_agency": {
      "name": "Air Force District of Washington, Enterprise Support Division",
      "location": "Joint Base Andrews, Maryland"
    },
    "contract_date": "2025-08-06",
    "award_text": "Deloitte Consulting LLP, Arlington, Virginia, was awarded a ceiling $115,000,000 firm-fixed-price indefinite-delivery/indefinite-quantity contract for the Department of Defense (DOD) Cyber Crime Center Cyber Training Academy follow-on. This contract provides for cyber training to Air Force and other DOD entities and personnel whose duties include defending DOD information systems from illegal, unauthorized, or counter-intelligence activities. Work will be performed at the National Capital Region and is expected to be completed by Aug. 5, 2030. This contract was a competitive acquisition and ten offers were received. The Air Force District of Washington, Enterprise Support Division, Joint Base Andrews, Maryland, is the contracting activity (FA7014-25-D-0007)."
  },
  {
    "contractors": [
      {
        "name": "Azimuth Corp.",
        "contract_id": "FA8650-22-D-5406",
        "location": "Beavercreek, Ohio"
      }
    ],
    "purpose": "research and development on the Materials Research and Survivability Studies II Program",
    "amount": 98716370.0,
    "contracting_agency": {
      "name": "Air Force Research Laboratory",
      "location": "Wright-Patterson AFB, Ohio"
    },
    "contract_date": "2025-08-06",
    "award_text": "Azimuth Corp., Beavercreek, Ohio, has been awarded a ceiling $98,716,370 modification (P00002) to a previously awarded contract (FA8650-22-D-5406) for research and development on the Materials Research and Survivability Studies II Program. The modification brings the total cumulative face value of the contract to $196,000,000. Work will be performed at Wright-Patterson Air Force Base, Ohio, and is expected to be completed by May 16, 2031. Fiscal 2024 research, development, test and evaluation funds in the amount of $215,002 are being obligated at time of award. The Air Force Research Laboratory, Wright-Patterson AFB, Ohio, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "BAE Systems Australia Ltd.",
        "contract_id": "FA8507-25-C-0001",
        "location": "Edinburgh, Australia"
      }
    ],
    "purpose": "Continued High Frequency system digital receive chain sub-system sustainment services, including engineering and programmatic services, hardware and software procurement, repair actions, system integration, system testing, and drafting and updating technical documentation.",
    "amount": 9024705.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Robins Air Force Base, Georgia"
    },
    "contract_date": "2025-08-06",
    "award_text": "BAE Systems Australia Ltd., Edinburgh, Australia, was awarded $9,024,705 undefinitized contract action for continued High Frequency system digital receive chain sub-system sustainment services. This contract provides for engineering and programmatic services, hardware and software procurement, repair actions as part of sustainment activities, system integration, system testing, and drafting and updating technical documentation. Work will be performed in Edinburgh, Australia, and is expected to be complete by Aug. 5, 2025. This contract was a sole source acquisition. Fiscal 2025 operations and maintenance appropriations funds in the amount of $457,929; fiscal 2024 other procurement funds in the amount of $338,688; and fiscal 2024 research, development, test and evaluation funds in the amount of $2,619,443, are being obligated at the time of award. The Air Force Life Cycle Management Center, Robins Air Force Base, Georgia, is the contracting activity (FA8507-25-C-0001)."
  },
  {
    "contractors": [
      {
        "name": "Weeks Marine Inc.",
        "contract_id": "W912PM-25-C-A008",
        "location": "Covington, Louisiana"
      }
    ],
    "purpose": "maintenance dredging",
    "amount": 38387500.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Wilmington, North Carolina"
    },
    "contract_date": "2025-08-06",
    "award_text": "Weeks Marine Inc., Covington, Louisiana, was awarded a $38,387,500 firm-fixed-price contract, with a total cumulative face value of $41,151,250, for maintenance dredging. Bids were solicited via the internet with one received. Work will be performed in Savannah, Georgia; Charleston, South Carolina; and Wilmington, North Carolina; with an estimated completion date of April 15, 2026. Fiscal 2025 civil operation and maintenance funds in the amount of $38,387,500 were obligated at the time of the award. U.S. Army Corps of Engineers, Wilmington, North Carolina, is the contracting activity (W912PM-25-C-A008)."
  },
  {
    "contractors": [
      {
        "name": "Rolls-Royce Solutions America Inc.",
        "contract_id": "W56HZV-23-C-0054",
        "location": "Novi, Michigan"
      }
    ],
    "purpose": "for Eitan Power Packs",
    "amount": 38356010.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Detroit Arsenal, Michigan"
    },
    "contract_date": "2025-08-06",
    "award_text": "Rolls-Royce Solutions America Inc., Novi, Michigan, was awarded a $38,356,010 modification (P00009) to contract W56HZV-23-C-0054 for Eitan Power Packs. The modification brings the total cumulative face value of the contract to $119,780,051. Work will be performed in Novi, Michigan, with an estimated completion date of Dec. 31, 2027. Fiscal 2025 Foreign Military Sales (Israel) funds in the amount of $38,356,010 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Sol Engineering Services LLC",
        "contract_id": "W912HZ-25-D-A003",
        "location": "Jackson, Mississippi"
      }
    ],
    "purpose": "laboratory support services",
    "amount": 20000000.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers' Engineer Research and Development Center",
      "location": "Vicksburg, Mississippi"
    },
    "contract_date": "2025-08-06",
    "award_text": "Sol Engineering Services LLC,* Jackson, Mississippi, was awarded a $20,000,000 firm-fixed-price contract for laboratory support services. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 5, 2030. U.S. Army Corps of Engineers' Engineer Research and Development Center, Vicksburg, Mississippi, is the contracting activity (W912HZ-25-D-A003)."
  },
  {
    "contractors": [
      {
        "name": "Manson Construction Co.",
        "contract_id": "W912P8-25-F-0102",
        "location": "Seattle, Washington"
      }
    ],
    "purpose": "cutterhead dredging",
    "amount": 14013300.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "New Orleans, Louisiana"
    },
    "contract_date": "2025-08-06",
    "award_text": "Manson Construction Co., Seattle, Washington, was awarded a firm-fixed-price contract for cutterhead dredging with a total cumulative face value of $14,013,300. Bids were solicited via the internet with four received. Work will be performed in Morgan City, Louisiana, with an estimated completion date of Dec. 3, 2025. Fiscal 2025 civil construction funds in the amount of $14,013,300 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans, Louisiana, is the contracting activity (W912P8-25-F-0102)."
  },
  {
    "contractors": [
      {
        "name": "AM General LLC",
        "contract_id": "W912CH-25-D-0070",
        "location": "South Bend, Indiana"
      }
    ],
    "purpose": "for radiator and oil cooler assemblies",
    "amount": 9410380.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Detroit Arsenal, Michigan"
    },
    "contract_date": "2025-08-06",
    "award_text": "AM General LLC, South Bend, Indiana, was awarded a $9,410,380 firm-fixed-price contract, with a total cumulative face value of $9,410,380, for radiator and oil cooler assemblies. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 6, 2028. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W912CH-25-D-0070)."
  },
  {
    "contractors": [
      {
        "name": "Tetra Tech, Inc.",
        "contract_id": "W912DY-24-F-0049",
        "location": "San Diego, California"
      }
    ],
    "purpose": "recurring maintenance and minor repairs services for petroleum facilities",
    "amount": 9318617.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers' Engineer Research and Development Center",
      "location": "Huntsville, Alabama"
    },
    "contract_date": "2025-08-06",
    "award_text": "Tetra Tech, Inc., San Diego, California, was awarded a $9,318,617 modification (P00002) to contract W912DY-24-F-0049 for recurring maintenance and minor repairs services for petroleum facilities. The modification brings the total cumulative face value of the contract to $52,434,095. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2026. U.S. Army Corps of Engineers' Engineer Research and Development Center, Huntsville, Alabama, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "TRAX International Corp.",
        "contract_id": "W51EW7-25-D-A002",
        "location": "Las Vegas, Nevada"
      }
    ],
    "purpose": "test center support services",
    "amount": 726894788.0,
    "contracting_agency": {
      "name": "Department of Defense",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-06",
    "award_text": "CORRECTION: The $726,894,788 contract (W51EW7-25-D-A002) announced on Aug. 5, 2025, to TRAX International Corp., Las Vegas, Nevada, for test center support services was announced with an incorrect estimated completion date. The correct estimated completion date is Aug. 24, 2032."
  },
  {
    "contractors": [
      {
        "name": "Joseph J. Henderson & Son Inc.",
        "contract_id": "N4008525C0005",
        "location": "Gurnee, Illinois"
      }
    ],
    "purpose": "Water treatment plant repair and replacement at Naval Station Great Lakes, Great Lakes, Illinois.",
    "amount": 25339799.0,
    "contracting_agency": {
      "name": "Naval Facilities Engineering Systems Command, Mid-Atlantic",
      "location": "Norfolk, Virginia"
    },
    "contract_date": "2025-08-06",
    "award_text": "Joseph J. Henderson & Son Inc., Gurnee, Illinois, was awarded a $25,339,799 firm-fixed-price contract for water treatment plant repair and replacement at Naval Station Great Lakes, Great Lakes, Illinois. Work is expected to be completed by August 2028. Fiscal 2025 operation and maintenance, Navy funds in the amount of $25,339,799 are obligated on this award and will expire at the end of the current fiscal year. This contract was competitively procured via the www.sam.gov website with three offers received. The Naval Facilities Engineering Systems Command, Mid-Atlantic, Norfolk, Virginia, is the contracting activity (N4008525C0005). (Awarded Aug. 4, 2025)"
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Corp.",
        "contract_id": "N0001922C0015",
        "location": "Fort Worth, Texas"
      },
      {
        "name": "Lockheed Martin Aeronautics Co.",
        "contract_id": "N0001922C0015",
        "location": "Fort Worth, Texas"
      }
    ],
    "purpose": "Provide continued engineering and other related activities in support of the design and development of a Joint Strike Fighter aircraft variant tailored for an unspecified Foreign Military Sales (FMS) customer.",
    "amount": 12893223.0,
    "contracting_agency": {
      "name": "Naval Air Systems Command",
      "location": "Patuxent River, Maryland"
    },
    "contract_date": "2025-08-06",
    "award_text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $12,893,223 modification (P00006) to a previously awarded cost-plus-incentive-fee contract (N0001922C0015). This modification increases the contract value to provide continued engineering and other related activities in support of the design and development of a Joint Strike Fighter aircraft variant tailored for an unspecified Foreign Military Sales (FMS) customer. Work will be performed in El Segundo, California (56%); Fort Worth, Texas (43%); and Tempe, Arizona (1%), and is expected to be completed in December 2028. FMS customer funds in the amount $12,893,223 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract action was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Derco Aerospace Inc.",
        "contract_id": "SPE4AX-25-D-P003",
        "location": "Milwaukee, Wisconsin"
      }
    ],
    "purpose": "for various H-60 Navy Seahawk helicopter platform electrical parts",
    "amount": 17427073.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Aviation",
      "location": "Richmond, Virginia"
    },
    "contract_date": "2025-08-06",
    "award_text": "Derco Aerospace Inc., Milwaukee, Wisconsin, has been awarded a maximum $17,427,073 firm-fixed-price with price-pending, requirements subsumable contract (SPE4AX-25-D-P003) issued under a five-year base contract (SPE4AX-22-D-9000) with one-five-year option period for various H-60 Navy Seahawk helicopter platform electrical parts. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. The performance completion date is Aug. 7, 2030. Using customer is the Navy. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation at Richmond, Virginia."
  },
  {
    "contractors": [
      {
        "name": "Leidos Inc.",
        "contract_id": "N00189-25-DZ021",
        "location": "Reston, Virginia"
      }
    ],
    "purpose": "for the provision of operational readiness research support services to include investigative studies that involve planning, coordinating, designing, and executing experimental protocols in support of the Naval Health Research Center.",
    "amount": 105545414.0,
    "contracting_agency": {
      "name": "Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-07",
    "award_text": "Leidos Inc., Reston, Virginia, is being awarded a $105,545,414 single-award, cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract for the provision of operational readiness research support services to include investigative studies that involve planning, coordinating, designing, and executing experimental protocols in support of the Naval Health Research Center. The contract will include a 60-month ordering period with no options. Work will begin in September 2025 and is expected to be completed by September 2030. Work will be performed in San Diego, California (80%), and Reston, Virginia (20%). Fiscal 2025 research, development, test and evaluation (Navy) funds in the contract's minimum amount of $1,000 will be obligated at time of award and will not expire at the end of the current fiscal year. Subsequent task orders under the resultant contract will be funded with appropriate fiscal research, development, test and evaluation funds (Navy). The requirement was competitively procured through the system for award management (SAM.gov) as unrestricted, competitive procurement with two offers received. Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department, Philadelphia, Pennsylvania, is the contracting activity (N00189-25-DZ021)."
  },
  {
    "contractors": [
      {
        "name": "L3 Harris Technologies Inc.",
        "contract_id": "FA8819-22-C-0001",
        "location": "Melbourne, Florida"
      }
    ],
    "purpose": "Procurement of an additional three production units for Foreign Military Sales (FMS) and an alternate 4.6-meter antenna.",
    "amount": 235938547.0,
    "contracting_agency": {
      "name": "Space Combat Power Directorate, Space Systems Command",
      "location": "Los Angeles Air Force Base, California"
    },
    "contract_date": "2025-08-07",
    "award_text": "L3 Harris Technologies Inc., Melbourne, Florida, has been awarded a $53,843,771 fixed- price-incentive-fee modification (P00026) to a previously awarded contract (FA8819-22-C- 0001) for the procurement of an additional three production units for Foreign Military Sales (FMS) and procure an alternate 4.6-meter antenna. The modification brings the total cumulative face value of the contract to $235,938,547 from $182,094,876. Work will be performed at Palm Bay, Florida, and is expected to be completed by December 2028. This contract involves FMS. FMS funds in the amount $10,545,213 are being obligated at time of award. The Space Combat Power Directorate, Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "CACI NSS LLC",
        "contract_id": "FA8555-25-D-B001",
        "location": "Reston, Virginia"
      }
    ],
    "purpose": "Sustainment and modernization of the Integrated Broadcast Services Network Services (IBS-NS) system, including sustainment of fielded systems, procurement, development, and modification.",
    "amount": 43202330.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Robins Air Force Base, Georgia"
    },
    "contract_date": "2025-08-07",
    "award_text": "CACI NSS LLC, Reston, Virginia, was awarded a $43,202,330 firm-fixed-price, cost-plus-fixed fee, and cost-reimbursable no fee, indefinite-delivery/indefinite-quantity contract for the sustainment and modernization of the Integrated Broadcast Services Network Services (IBS-NS) system. This contract provides for the sustainment of the IBS-NS fielded systems as well as procurement, development, and modification of this system. Work will be performed at multiple locations inside and outside of the contiguous U.S., and is expected to be complete by August 19, 2028. This contract involves Foreign Military Sales to the United Kingdom and Canada. This contract was a sole source acquisition. Fiscal 2025 operations and maintenance funds in the amount of $1,643,185 are being obligated at the time of award. The Air Force Life Cycle Management Center, Robins Air Force Base, Georgia, is the contracting activity (FA8555-25-D-B001)."
  },
  {
    "contractors": [
      {
        "name": "Puerto Rico Industries for the Blind Corp.",
        "contract_id": "SPE1C1-25-D-N014",
        "location": "Mayaguez, Puerto Rico"
      }
    ],
    "purpose": "for green service uniform coats and trousers",
    "amount": 28981411.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-07",
    "award_text": "Puerto Rico Industries for the Blind Corp.,** Mayaguez, Puerto Rico, has been awarded a maximum $28,981,411 fixed-price, indefinite-delivery/indefinite-quantity contract for green service uniform coats and trousers. This is a two-year contract with no option periods. The ordering period end date is Aug. 6, 2027. Using military service is Army. Type of appropriation is fiscal 2025 through 2028 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-25-D-N014)."
  },
  {
    "contractors": [
      {
        "name": "Best Medical Wear Ltd.",
        "contract_id": "SPE2DE-25-D-0016",
        "location": "Brooklyn, New York"
      }
    ],
    "purpose": "medical and surgical supplies and equipment for the Defense Logistics Agency Electronic Catalog",
    "amount": 10000000.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-07",
    "award_text": "UPDATE: Best Medical Wear Ltd.,* Brooklyn, New York (SPE2DE-25-D-0016, $10,000,000), has been added as an awardee to the multiple award contract for medical and surgical supplies and equipment for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DE-22-R-0017 and awarded Sept. 28, 2023. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania."
  },
  {
    "contractors": [
      {
        "name": "Akima Facilities Operations LLC",
        "contract_id": "W52P1J-20-F-0137",
        "location": "Herndon, Virginia"
      }
    ],
    "purpose": "maintenance, transportation, and supply services",
    "amount": 23034485.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Rock Island, Illinois"
    },
    "contract_date": "2025-08-07",
    "award_text": "Akima Facilities Operations LLC, Herndon, Virginia, was awarded a $23,034,485 modification (P00129) to contract W52P1J-20-F-0137 for maintenance, transportation, and supply services. The modification brings the total cumulative face value of the contract to $23,034,485. Work will be performed in Fort Hood, Texas, with an estimated completion date of July 9, 2026. Fiscal 2025 operation and maintenance, Army funds in the amount of $2,866,921 were obligated at the time of the award. Army Contracting Command, Rock Island, Illinois, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Applied Research Associates Inc.",
        "contract_id": "W911QX-23-C-0010",
        "location": "Albuquerque, New Mexico"
      }
    ],
    "purpose": "end-to-end support for development, implementation, and extension of evolving National System for Geospatial architecture",
    "amount": 19499697.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Aberdeen Proving Ground, Maryland"
    },
    "contract_date": "2025-08-07",
    "award_text": "Applied Research Associates Inc., Albuquerque, New Mexico, was awarded a $19,499,697 modification (P00017) to contract W911QX-23-C-0010 for end-to-end support for development, implementation, and extension of evolving National System for Geospatial architecture. The modification brings the total cumulative face value of the contract to $143,498,644. Work will be performed in Albuquerque, New Mexico, with an estimated completion date of June 1, 2027. Fiscal 2025 defense operation and maintenance funds in the amount of $6,244,432 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "TOTE Services Inc.",
        "contract_id": "N3220525C4020",
        "location": "Jacksonville, Florida"
      }
    ],
    "purpose": "Operation and maintenance of Sea-Based X-Band Radar Platform (SBX-1) for the Missile Defense Agency to provide limited test support services and as a contingency component of the Ground Based Mid-Course Defense element of the Ballistic Missile Defense System for the U.S. Strategic Command.",
    "amount": 311412239.0,
    "contracting_agency": {
      "name": "Military Sealift Command",
      "location": "Norfolk, Virginia"
    },
    "contract_date": "2025-08-08",
    "award_text": "TOTE Services Inc., Jacksonville, Florida, is being awarded a $311,412,239 firm-fixed-price contract (N3220525C4020) inclusive of pass-through elements for the operation and maintenance of Sea-Based X-Band Radar Platform (SBX-1). The vessel is operated for the Missile Defense Agency to provide limited test support services and is a contingency component of the Ground Based Mid-Course Defense element of the Ballistic Missile Defense System for the U.S. Strategic Command. This contract contains a 12-month base period with four 12-month option periods and one 6-month option period under Federal Acquisition Regulation 52.217-8. The contract will be performed on a worldwide basis beginning Oct. 1, 2025, and will conclude March 31, 2031, if all options are exercised. This contract was solicited using full and open competition, via the Government Point of Entry website and one proposal was received. Military Sealift Command, Norfolk, Virginia, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Huntington Ingalls Inc.",
        "contract_id": "N00024-24-C-2106",
        "location": "Newport News, Virginia"
      }
    ],
    "purpose": "additional advance planning effort and long-lead-time material required for the accomplishment of the USS Harry S. Truman (CVN 75) Refueling Complex Overhaul",
    "amount": 276131707.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-08",
    "award_text": "Huntington Ingalls Inc., Newport News, Virginia, is awarded a $276,131,707 cost-plus- incentive-fee and cost-plus-fixed-fee modification to a previously awarded contract (N00024-24-C-2106) for additional advance planning effort and long-lead-time material required for the accomplishment of the USS Harry S. Truman (CVN 75) Refueling Complex Overhaul. Work will be performed in Newport News, Virginia, and is expected to be completed by September 2026. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $65,000,000 will be obligated at the time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Galvion Technologies LLC",
        "contract_id": "M67854-25-D-5300",
        "location": "Portsmouth, New Hampshire"
      }
    ],
    "purpose": "Procurement of Integrated Helmet System with associated components and accessories",
    "amount": 131396295.0,
    "contracting_agency": {
      "name": "Marine Corps Systems Command",
      "location": "Quantico, Virginia"
    },
    "contract_date": "2025-08-08",
    "award_text": "Galvion Technologies LLC,* Portsmouth, New Hampshire, was awarded a $131,396,295 firm-fixed-price indefinite-delivery/indefinite-quantity contract for the Integrated Helmet System. This contract provides for the procurement of Integrated Helmet System with associated components and accessories. The ordering period will be a maximum of five years and is expected to be completed in August 2030. Work will be performed in Portsmouth, New Hampshire. No funds will be obligated at time of award. Funds will be obligated on individual task/delivery orders as they are issued. The requirement was procured under the authority of 10 U.S. Code 4022(f) as a follow-on agreement to the prototype agreement (M67854-20-9-1001). Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-D-5300)."
  },
  {
    "contractors": [
      {
        "name": "BAE Systems – San Diego Ship Repair",
        "contract_id": "N0002425C4406",
        "location": "San Diego, California"
      }
    ],
    "purpose": "Maintenance, modernization, and repair of USS O'Kane (DDG 77) for fiscal 2026 docking selected restricted availability, including all labor, supervision, equipment, production, testing, facilities, and quality assurance necessary for Chief of Naval Operations Availability.",
    "amount": 64116819.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-08",
    "award_text": "BAE Systems – San Diego Ship Repair, San Diego, California, was awarded a $64,116,819 firm-fixed-price contract action for maintenance, modernization and repair of USS O'Kane (DDG 77) fiscal 2026 docking selected restricted availability. The scope of this acquisition includes all labor, supervision, equipment, production, testing, facilities, and quality assurance necessary to prepare for and accomplish the Chief of Naval Operations Availability for critical modernization, maintenance, and repair programs. This contract includes options, which, if exercised, would bring the cumulative value of this contract to $68,483,520. Work will be performed in San Diego, California, and is expected to be completed by January 2027. Fiscal 2025 other procurement (Navy) funds in the amount of $64,322,679; and fiscal 2025 operation and maintenance (Navy) funds in the amount of $11,442, will be obligated at the time of award, of which $11,442 will expire at the end of the current fiscal year. This contract was competitively solicited using full and open competition via the System for Award Management website, with four offers received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N0002425C4406). (Awarded on Aug. 7, 2025)"
  },
  {
    "contractors": [
      {
        "name": "CACI, Inc. – Federal",
        "contract_id": "M67854-19-D-7614",
        "location": "Chantilly, Virginia"
      }
    ],
    "purpose": "Increase contract ceiling to provide continued Post Deployment System support services including service management, service operations, production and pre-production system sustainment, solution development environment, enterprise training and training devices, product lifecycle support, service transition for change requests, engineering change proposals, reduction of reports, interfaces, customizations, and extensions, and potential tasks for Global Combat Support System – Marine Corps future initiatives.",
    "amount": 62490208.0,
    "contracting_agency": {
      "name": "Marine Corps Systems Command",
      "location": "Quantico, Virginia"
    },
    "contract_date": "2025-08-08",
    "award_text": "CACI, Inc. – Federal, Chantilly, Virginia, is being awarded a $62,490,208 modification (P00020) to a previously awarded indefinite delivery/indefinite-quantity contract (M67854-19-D-7614). This modification will increase the contract ceiling amount by $62,490,208 from $249,960,831 to $312,451,039. This increase will allow continued Post Deployment System support services including service management, service operations; production and pre-production system sustainment; solution development environment; enterprise training and training devices; product lifecycle support; and service transition for change requests, engineering change proposals, and reduction of reports, interfaces, customizations, and extensions; and potential tasks to support Global Combat Support System – Marine Corps future initiatives under the existing contract. The current ordering period of the contract ends Dec. 25, 2026. Work will be performed in Stafford, Virginia (90%); Kansas City, Missouri (5%); and other locations (5%), and is expected to be complete in December 2026. No funds will be obligated at time of award. Funds will be obligated on individual task orders as they are issued. This action was not competitively procured pursuant to Federal Acquisition Regulation 6.302-1. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-19-D-7614)."
  },
  {
    "contractors": [
      {
        "name": "Bristol Design Build Services LLC",
        "contract_id": "N69450-21-D-0064",
        "location": "Anchorage, Alaska"
      },
      {
        "name": "HGL Construction Inc.",
        "contract_id": "N69450-21-D-0065",
        "location": "Oklahoma City, Oklahoma"
      },
      {
        "name": "Klutina River Contractors",
        "contract_id": "N69450-21-D-0066",
        "location": "Irvine, California"
      },
      {
        "name": "PacWest-Korte JV",
        "contract_id": "N69450-21-D-0067",
        "location": "Temecula, California"
      },
      {
        "name": "The Clement Group LLC",
        "contract_id": "N69450-21-D-0068",
        "location": "Montgomery, Alabama"
      },
      {
        "name": "VHB LLC",
        "contract_id": "N69450-21-D-0069",
        "location": "Boyds, Maryland"
      },
      {
        "name": "Walga Ross Group 3 JV",
        "contract_id": "N69450-21-D-0070",
        "location": "Joplin, Missouri"
      },
      {
        "name": "EMR Inc.",
        "contract_id": "N69450-22-D-0025",
        "location": "Niceville, Florida"
      },
      {
        "name": "Tybe-Garney Federal JV LLC",
        "contract_id": "N69450-22-D-0026",
        "location": "Newbern, Tennessee"
      }
    ],
    "purpose": "Modification to increase the capacity of previously-awarded contracts for general building type projects",
    "amount": 58000000.0,
    "contracting_agency": {
      "name": "Naval Facilities Engineering Systems Command Southeast",
      "location": "Jacksonville, Florida"
    },
    "contract_date": "2025-08-08",
    "award_text": "Bristol Design Build Services LLC, Anchorage, Alaska (N69450-21-D-0064); HGL Construction Inc., Oklahoma City, Oklahoma (N69450-21-D-0065); Klutina River Contractors, Irvine, California (N69450-21-D-0066); PacWest-Korte JV, Temecula, California (N69450-21-D-0067); The Clement Group LLC, Montgomery, Alabama (N69450-21-D-0068); VHB LLC, Boyds, Maryland (N69450-21-D-0069); Walga Ross Group 3 JV, Joplin, Missouri (N69450-21-D-0070); EMR Inc., Niceville, Florida (N69450-22-D-0025); and Tybe-Garney Federal JV LLC, Newbern, Tennessee (N69450-22-D-0026), are awarded a combined-maximum-value $58,000,000 firm-fixed-price modification to increase the capacity of their respective, previously-awarded contracts for general building type projects. Award of this modification brings the total cumulative value for all nine contracts combined to $307,000,000. Work will be performed in Florida (67%) and Tennessee (33%) and is expected to be completed by September 2026. No funds will be obligated at time of award. The Naval Facilities Engineering Systems Command Southeast, Jacksonville, Florida, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Marinette Marine Corp.",
        "contract_id": "N00024-20-C-2300",
        "location": "Marinette, Wisconsin"
      }
    ],
    "purpose": "to exercise the option and provide funding for engineering and class design support for the Constellation-class Guided Missile Frigate.",
    "amount": 43114274.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-08",
    "award_text": "Marinette Marine Corp., Marinette, Wisconsin, is awarded a $43,114,274 cost-plus-fixed-fee and cost-only modification to previously awarded contract (N00024-20-C-2300) to exercise the option and provide funding for engineering and class design support for the Constellation-class Guided Missile Frigate. Work will be performed in Camden, New Jersey (42%); Arlington, Virginia (30%); Millersville, Maryland (9%); Marinette, Wisconsin (5%); Annapolis, Maryland (2%); Hanover, Maryland (2%); Walpole, Massachusetts (1%); Mobile, Alabama (1%); Evans, Georgia (1%); Segrate, Italy (1%); Rome, Italy (1%); Mathews, Louisiana (1%); Hauppauge, New York (1%); Columbus, Ohio (1%); Allentown, Pennsylvania (1%); and Arvonia, Virginia (1%), and is expected to be completed by August 2026. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $2,500,000 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Innovatus Technology Consulting",
        "contract_id": "N6600122D0009",
        "location": "San Diego, California"
      }
    ],
    "purpose": "software and system engineering, design, development, configuration, integration, testing and life-cycle support services that are needed to support the Business Management Corporation Remedy Information Technology Service Management Enterprise System at Naval Information Warfare Center (NIWC) Pacific.",
    "amount": 20257747.0,
    "contracting_agency": {
      "name": "NIWC Pacific",
      "location": "San Diego, California"
    },
    "contract_date": "2025-08-08",
    "award_text": "Innovatus Technology Consulting,* San Diego, California, is awarded a $20,257,747 cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity modification to a previously issued contract (N6600122D0009). This modification provides for software and system engineering, design, development, configuration, integration, testing and life-cycle support services that are needed to support the Business Management Corporation Remedy Information Technology Service Management Enterprise System at Naval Information Warfare Center (NIWC) Pacific. Place of performance will be determined at task order level. Work is expected to be completed in August 2030. No funds will be obligated at the time of award. Funds will be obligated on individual task orders as they are issued. NIWC Pacific, San Diego, California, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Northrop Grumman Systems Corp., Mission Systems Sector",
        "contract_id": "N00024-22-C-5520",
        "location": "Linthicum Heights, Maryland"
      }
    ],
    "purpose": "to exercise an option for design agent engineering of Surface Electronic Warfare Improvement Program Block 3 systems",
    "amount": 18537253.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-08",
    "award_text": "Northrop Grumman Systems Corp., Mission Systems Sector, Linthicum Heights, Maryland, is awarded a $18,537,253 cost-plus-fixed-fee modification to the previously awarded contract (N00024-22-C-5520) to exercise an option for design agent engineering of Surface Electronic Warfare Improvement Program Block 3 systems. Work will be performed in Baltimore, Maryland (55%); Tampa, Florida (6%); Andover, Massachusetts (5%); Chelmsford, Massachusetts (4%); Rochester, New York (3%); San Diego, California (3%); Los Angeles, California (2%); Winona, Minnesota (2%); Stafford Springs, Connecticut (2%); Glendale, Arizona (1%); Nashua, New Hampshire (1%); Elk Grove Village, Illinois (1%); White Marsh, Maryland (1%); Tucson, Arizona (1%); Chandler, Arizona (1%); Washington, North Carolina (1%); Woodridge, Illinois (1%); Richardson, Texas (1%); Minneapolis, Minnesota (1%); El Cajon, California (1%); Hiawatha, Iowa (1%); Littleton, Colorado (1%); Glendale, California (1%); and miscellaneous locations - each less than 1% (4%), and is expected to be completed by August 2026. Fiscal 2025 other procurement (Navy) funds in the amount of $1,725,263 (36%); fiscal 2025 operations and maintenance (Navy) funds in the amount of $3,080,909 (64%); and fiscal 2025 research, development, testing and evaluation funds in the amount of $14,029 (<1%), will be obligated at time of award. The $3,080,909 (64%), fiscal 2025 operations and maintenance (Navy) funds are expiring funds and will be invoking the 10 U.S. Code 3133 Authority. The Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin, Rotary and Mission Systems",
        "contract_id": "N00024-23-C-5101",
        "location": "Moorestown, New Jersey"
      }
    ],
    "purpose": "Integrate and test one Engineering Development Model of fully functional AN/SPY-7(v)3 radar system, involving Foreign Military Sales to the government of Canada.",
    "amount": 18601447.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-08",
    "award_text": "Lockheed Martin, Rotary and Mission Systems, Moorestown, New Jersey, is awarded a $18,601,447 cost-plus-incentive-fee and cost type modification to a previously awarded contract (N00024-23-C-5101) to integrate and test one Engineering Development Model of fully functional AN/SPY-7(v)3 radar system. This contract involves Foreign Military Sales (FMS) to the government of Canada. Work will be performed in Moorestown, New Jersey and is expected to be completed by December 2027. FMS (Canada) funds in the amount of $18,601,447 will be obligated at the time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "M.C. Dean Inc.",
        "contract_id": "N33191-25-C-6008",
        "location": "Tysons, Virginia"
      }
    ],
    "purpose": "Construction of a secure working area in the renovated P-8A operations and fleet support facilities at Keflavik Air Station, Iceland.",
    "amount": 15566212.0,
    "contracting_agency": {
      "name": "Naval Facilities Engineering Systems Command, Europe Africa Central",
      "location": "Naples, Italy"
    },
    "contract_date": "2025-08-08",
    "award_text": "M.C. Dean Inc., Tysons, Virginia, is awarded a $15,566,212 firm-fixed-price contract for the construction of a secure working area in the renovated P-8A operations & fleet support facilities at Keflavik Air Station, Iceland. Work will be performed in Keflavik, Iceland and is expected to be completed by October 2027. Fiscal 2025 operations and maintenance (Navy) contract funds in the amount of $15,566,212 are obligated on this award and will expire at the end of the current fiscal year. This contract was competitively procured via the Solicitation Module in the Procurement Integrated Enterprise Environment, with four proposals received. The Naval Facilities Engineering Systems Command, Europe Africa Central, Naples, Italy, is the contracting activity (N33191-25-C-6008)."
  },
  {
    "contractors": [
      {
        "name": "Continental Maritime of San Diego LLC",
        "contract_id": "N0002425C4419",
        "location": "San Diego, California"
      }
    ],
    "purpose": "Maintenance, modernization, and repair of USS Pearl Harbor (LSD 52) for fiscal 2026 Docking Selected Restricted Availability, including all labor, supervision, equipment, production, testing, and quality assurance necessary to prepare for and accomplish the Chief of Naval Operations Availability for critical modernization, maintenance, and repair programs.",
    "amount": 573412.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-08",
    "award_text": "Continental Maritime of San Diego LLC, San Diego, California, was awarded a $573,412 firm-fixed-price contract action for maintenance, modernization and repair of USS Pearl Harbor (LSD 52) fiscal 2026 Docking Selected Restricted Availability. This contract includes options, which, if exercised, would bring the cumulative value of this contract to $112,669,566. The scope of this acquisition includes all labor, supervision, equipment, production, testing, and quality assurance necessary to prepare for and accomplish the Chief of Naval Operations Availability for critical modernization, maintenance, and repair programs. Work will be performed in San Diego, California, and is expected to be completed by June 2027. Fiscal 2025 other procurement, (Navy) funds in the amount of $573,412 will be obligated at the time of award, of which none of the funding will expire at the end of the current fiscal year. This contract was competitively procured using full and open competition via the System for Award Management website, with four offers received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N0002425C4419). (Awarded on Aug. 7, 2025)"
  },
  {
    "contractors": [
      {
        "name": "Ameriqual Group LLC",
        "contract_id": "SPE3S1-25-D-Z205",
        "location": "Evansville, Indiana"
      },
      {
        "name": "Baxters North America Inc.",
        "contract_id": "SPE3S1-25-D-Z206",
        "location": "Cincinnati, Ohio"
      }
    ],
    "purpose": "for unitized group ration-A modules",
    "amount": 246370725.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-08",
    "award_text": "Ameriqual Group LLC, doing business as Ameriqual Packaging, Evansville, Indiana (SPE3S1-25-D-Z205, $221,062,100); and Baxters North America Inc., doing business as The Wornick Co., Cincinnati, Ohio (SPE3S1-25-D-Z206, $25,308,625), have each been awarded a fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract under solicitation SPE3S1-22-R-0012 for unitized group ration-A modules. This was a competitive acquisition with three responses received. These are five-year contracts with no option periods. The ordering period end date is Aug. 7, 2030. Using military service is Army. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania."
  },
  {
    "contractors": [
      {
        "name": "The Source Group Inc.",
        "contract_id": "SPE603-25-D-5003",
        "location": "Signal Hill, California"
      }
    ],
    "purpose": "Contract announcement with incorrect award date correction",
    "amount": 26513566.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Energy",
      "location": "Fort Belvoir, Virginia"
    },
    "contract_date": "2025-08-08",
    "award_text": "CORRECTION: The contract announced on Aug. 1, 2025, for The Source Group Inc., Signal Hill, California (SPE603-25-D-5003), for $26,513,566 was announced with an incorrect award date. The correct award date is Aug. 6, 2025. The contracting activity is the Defense Logistics Agency Energy, Fort Belvoir, Virginia."
  },
  {
    "contractors": [
      {
        "name": "Intellisense Systems Inc.",
        "contract_id": "FA2330-25-D-B001",
        "location": "Torrance, California"
      }
    ],
    "purpose": "Sustainment and procurement for the Advanced Micro Weather Station (AMWS) and Integrated Weather Observation System (IWOS) for the Expeditionary Weather Program, including contractor logistics support and procurement to sustain the currently fielded ExMet systems, observation, forecast, modeling, imagery, and computational solutions developed and fielded for the ExMet Program.",
    "amount": 58000000.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Hanscom Air Force Base, Massachusetts"
    },
    "contract_date": "2025-08-08",
    "award_text": "Intellisense Systems Inc., Torrance, California, was awarded a $58,000,000 indefinite-delivery/indefinite-quantity, firm-fixed-price contract, for the sustainment and procurement for the Advanced Micro Weather Station (AMWS) and Integrated Weather Observation System (IWOS) for the Expeditionary Weather Program. This contract provides contractor logistics support and procurement of the IWOS and AMWS to sustain the currently fielded ExMet systems, observation, forecast, modeling, imagery, and computational solutioned developed and fielded for the ExMet Program. Work will be performed at Torrance, California, and is expected to be completed by Aug. 12, 2030. This contract was a Small Business Innovation Research Phase III sole source acquisition. Fiscal 2025 operations and maintenance appropriations funds in the amount of $1,942,941 will be obligated on the first task order. The Air Force Life Cycle Management Center, Hanscom Air Force Base, Massachusetts, is the contracting activity (FA2330-25-D-B001)."
  },
  {
    "contractors": [
      {
        "name": "Razor Consulting Solutions Inc.",
        "contract_id": "FA4600-25-D-0002",
        "location": "Watford City, North Dakota"
      },
      {
        "name": "MCL-MRK VII LLC",
        "contract_id": "FA4600-25-D-0003",
        "location": "La Vista, Nebraska"
      },
      {
        "name": "Matai Services LLC",
        "contract_id": "FA4600-25-D-0004",
        "location": "Kansas City, Missouri"
      },
      {
        "name": "Infinite Energy Construction Inc.",
        "contract_id": "FA4600-25-D-0005",
        "location": "Kansas City, Missouri"
      },
      {
        "name": "Shekar Engineering P.L.C.",
        "contract_id": "FA4600-25-D-0006",
        "location": "Des Moines, Iowa"
      },
      {
        "name": "Elkhorn West Construction Inc.",
        "contract_id": "FA4600-25-D-0007",
        "location": "Omaha, Nebraska"
      },
      {
        "name": "MDM Construction LLC",
        "contract_id": "FA4600-25-D-0008",
        "location": "West Fargo, North Dakota"
      },
      {
        "name": "Leisnoi Professional Services LLC",
        "contract_id": "FA4600-25-D-0009",
        "location": "Kodiak, Alaska"
      }
    ],
    "purpose": "general construction projects",
    "amount": 49999999.0,
    "contracting_agency": {
      "name": "55th Contracting Squadron",
      "location": "Offutt AFB, Nebraska"
    },
    "contract_date": "2025-08-08",
    "award_text": "Razor Consulting Solutions Inc., Watford City, North Dakota (FA4600-25-D-0002); MCL-MRK VII LLC, La Vista, Nebraska (FA4600-25-D-0003); Matai Services LLC, Kansas City, Missouri (FA4600-25-D-0004); Infinite Energy Construction Inc., Kansas City, Missouri (FA4600-25-D-0005); Shekar Engineering P.L.C., Des Moines, Iowa (FA4600-25-D-0006); Elkhorn West Construction Inc., Omaha, Nebraska (FA4600-25-D-0007); MDM Construction LLC, West Fargo, North Dakota (FA4600-25-D-0008); and Leisnoi Professional Services LLC, Kodiak, Alaska (FA4600-25-D-0009), were awarded ceiling $49,999,999 firm-fixed-price, multiple award, construction contract. This provides for general construction projects. Work will be performed at Offutt Air Force Base, Nebraska, as is expected to be completed on July 30, 2030. These contracts were competitive acquisitions and 24 offers were received. Fiscal 2025 operational and maintenance appropriations funds in the amount of $478,298 are being obligated at time of award. The 55th Contracting Squadron, Offutt AFB, Nebraska, is the contracting activity. (Awarded Aug. 1, 2025)"
  },
  {
    "contractors": [
      {
        "name": "City Light and Power JBLM LLC",
        "contract_id": "W912QR-25-C-A018",
        "location": "Greenwood Village, Colorado"
      }
    ],
    "purpose": "construction of a microgrid",
    "amount": 33506686.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Louisville, Kentucky"
    },
    "contract_date": "2025-08-08",
    "award_text": "City Light and Power JBLM LLC, Greenwood Village, Colorado, was awarded a $33,506,686 firm-fixed-price contract with a cumulative total face value of $34,860,907 for construction of a microgrid. Bids were solicited via the internet with one received. Work will be performed at Joint Base Lewis-McChord, Washington, with an estimated completion date of Aug. 27, 2029. Fiscal 2025 military construction, defense-wide funds in the amount of $33,506,686 were obligated at the time of the award. U.S. Army Corps of Engineers, Louisville, Kentucky, is the contracting activity (W912QR-25-C-A018)."
  },
  {
    "contractors": [
      {
        "name": "Carbon 9 Defense LLC",
        "contract_id": "N6600120A0022",
        "location": "Annapolis Junction, Maryland"
      }
    ],
    "purpose": "for Splunk products",
    "amount": 9654861.0,
    "contracting_agency": {
      "name": "U.S. Special Operations Command",
      "location": "MacDill Air Force Base, Florida"
    },
    "contract_date": "2025-08-08",
    "award_text": "Carbon 9 Defense LLC, Annapolis Junction, Maryland, was awarded a $9,654,861 firm-fixed price order for Splunk products (N6600120A0022) for a period of 12 months. U.S. Special Operations Command, MacDill Air Force Base, Florida, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Owl Cyber Defense Solutions LLC",
        "contract_id": "FA8750-25-D-B003",
        "location": "Columbia, Maryland"
      }
    ],
    "purpose": "Research and development for the delivery of software releases, including completion and transition of Voice and Video Cross Domain Solution, XD Vision, and Cross Domain Full Motion Video to the Minerva user community, along with computer software, technical documentation, hardware, and installation and maintenance of systems.",
    "amount": 150000000.0,
    "contracting_agency": {
      "name": "Air Force Research Laboratory",
      "location": "Rome, New York"
    },
    "contract_date": "2025-07-29",
    "award_text": "Owl Cyber Defense Solutions LLC, Columbia, Maryland, was awarded a maximum $150,000,000 indefinite-delivery/indefinite-quantity contract for research and development. This contract provides for the delivery of several software releases, including completion and transition of Voice and Video Cross Domain Solution, XD Vision, and Cross Domain Full Motion Video to the Minerva user community, to include computer software, technical documentation, hardware, and installation and maintenance of the current systems located at existing customer sites. Work will be performed at Columbia, Maryland, and is expected to be completed by July 29, 2030. This contract was the result of a sole source acquisition under the Small Business Innovation Research Program. Fiscal 2025 research, development, test and evaluation funds in the amount of $10,000 are being obligated at the time of award. The Air Force Research Laboratory, Rome, New York, is the contracting activity (FA8750-25-D-B003)."
  },
  {
    "contractors": [
      {
        "name": "AM General LLC",
        "contract_id": "W912CH-24-F-0229",
        "location": "South Bend, Indiana"
      }
    ],
    "purpose": "for M1165A1B3 HMMWV vehicles",
    "amount": 126531778.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Detroit Arsenal, Michigan"
    },
    "contract_date": "2025-07-29",
    "award_text": "AM General LLC, South Bend, Indiana, was awarded a $126,531,778 modification (P00023) to contract W912CH-24-F-0229 for M1165A1B3 HMMWV vehicles. The modification brings the total cumulative face value of the contract to $3,050,585,536. Work will be performed in South Bend, Indiana, with an estimated completion date of Aug. 28, 2027. Fiscal 2025 other procurement, Army funds in the amount of $126,531,778 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity. (Awarded June 28, 2025)"
  },
  {
    "contractors": [
      {
        "name": "Amentum/DynCorp International",
        "contract_id": "W58RGZ-24-C-0026",
        "location": "Fort Worth, Texas"
      }
    ],
    "purpose": "maintenance support services",
    "amount": 70662146.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Redstone Arsenal, Alabama"
    },
    "contract_date": "2025-07-29",
    "award_text": "Amentum/DynCorp International, Fort Worth, Texas, was awarded a $70,662,146 modification (P00008) to contract W58RGZ-24-C-0026 for maintenance support services. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2026. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "cBEYONData LLC",
        "contract_id": "W91CRB-25-C-A010",
        "location": "Arlington, Virginia"
      }
    ],
    "purpose": "Enterprise Resource Planning Systems and Enterprise Business System Convergence",
    "amount": 17732287.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Aberdeen Proving Ground, Maryland"
    },
    "contract_date": "2025-07-29",
    "award_text": "cBEYONData LLC, Arlington, Virginia, was awarded a $17,732,287 firm-fixed-price contract for Enterprise Resource Planning Systems and Enterprise Business System Convergence. Bids were solicited via the internet with four received. Work will be performed at the Pentagon with an estimated completion date of July 28, 2030. Fiscal 2025 research, development, test and evaluation, Army funds in the amount of $3,300,000 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W91CRB-25-C-A010). (Awarded June 28, 2025)"
  },
  {
    "contractors": [
      {
        "name": "DZSP 21 LLC",
        "contract_id": "N40192-23-C-5300",
        "location": "Chantilly, Virginia"
      }
    ],
    "purpose": "Base operations support services at Navy, Marine Corps, and Air Force installations in the Joint Region Marianas area of responsibility.",
    "amount": 115954444.0,
    "contracting_agency": {
      "name": "Naval Facilities Engineering Systems Command",
      "location": "Marianas, Guam"
    },
    "contract_date": "2025-07-29",
    "award_text": "DZSP 21 LLC, Chantilly, Virginia, is awarded a $115,954,444 cost-plus-award-fee modification to a previously awarded contract (N40192-23-C-5300) for base operations support services. This award brings the cumulative face value of the contract to $848,892,639. This modification provides for the exercise of Option Five for base operating support services at Navy, Marine Corps, and Air Force installations in the Joint Region Marianas area of responsibility. Work will be performed in Guam and is expected to be completed by July 2026. Fiscal 2025 operations and maintenance (O&M) (Navy) funds; fiscal 2025 O&M (Marine Corps) funds; and fiscal 2025 O&M (Defense) funds, in the amount of $53,280,434, will be obligated at time of award, and funds will expire at the end of the current fiscal year. The Naval Facilities Engineering Systems Command, Marianas, Guam, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Corp.",
        "contract_id": "N0001925C0070",
        "location": "Fort Worth, Texas"
      },
      {
        "name": "Lockheed Martin Aeronautics Co.",
        "contract_id": "N0001925C0070",
        "location": "Fort Worth, Texas"
      }
    ],
    "purpose": "This modification adds scope to procure long lead materials, parts, components, and associated support in support of the F-35 Lot 21 production aircraft for non-U.S. Department of Defense (DOD) partners and Foreign Military Sales (FMS) customers.",
    "amount": 92900000.0,
    "contracting_agency": {
      "name": "Naval Air Systems Command",
      "location": "Patuxent River, Maryland"
    },
    "contract_date": "2025-07-29",
    "award_text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a not-to-exceed $92,900,000 modification (P00002) to a previously awarded fixed-price incentive (firm-target) undefinitized contract (N0001925C0070). This modification adds scope to procure long lead materials, parts, components, and associated support in support of the F-35 Lot 21 production aircraft for non-U.S. Department of Defense (DOD) partners and Foreign Military Sales (FMS) customers. Work will be performed Fort Worth, Texas (59%); El Segundo, California (14%); Warton, United Kingdom (9%); Cameri, Italy (4%); Orlando, Florida (4%); Nashua, New Hampshire (3%); Baltimore, Maryland (3%); San Diego, California (2%); and other various locations outside of the continental U.S. (2%), and is expected to be completed May 2031. FMS customer funds in the amount of $74,800,000; and non-U.S. DOD partner funds in the amount of $18,100,000, will be obligated at the time of award, none of which expire at the end of the current fiscal year. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity"
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Aeronautics Co.",
        "contract_id": "N0001925C0068",
        "location": "Fort Worth, Texas"
      }
    ],
    "purpose": "to provide agile software development required to enhance the functionality of combat data systems common reprogramming tool minimum viable capability release to support F-35 Lightning II air system capabilities and configurations for the Air Force, Marine Corps, Navy, and non-U.S. Department of Defense (DOD) partners.",
    "amount": 72107096.0,
    "contracting_agency": {
      "name": "Naval Air Systems Command",
      "location": "Patuxent River, Maryland"
    },
    "contract_date": "2025-07-29",
    "award_text": "Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a cost-plus-fixed-fee $72,107,096 contract to provide agile software development required to enhance the functionality of combat data systems common reprogramming tool minimum viable capability release to support F-35 Lightning II air system capabilities and configurations for the Air Force, Marine Corps, Navy, and non-U.S. Department of Defense (DOD) partners. Work will be performed Fort Worth, Texas (90%); and Eglin Air Force Base, Florida (10%), and is expected to be completed December 2028. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $2,000,002; fiscal 2025 research, development, test and evaluation (Air Force) funds in the amount of $2,000,000; and non-U.S. DOD partner funds in the amount of $890,876, will be obligated at the time of award, none of which expire at the end of the current fiscal year. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity (N0001925C0068)."
  },
  {
    "contractors": [
      {
        "name": "Raytheon Co.",
        "contract_id": "N00024-24-C-5408",
        "location": "Tucson, Arizona"
      }
    ],
    "purpose": "for Evolved Seasparrow Missile Blk 2 guided missile assemblies",
    "amount": 67550000.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-07-29",
    "award_text": "Raytheon Co., Tucson Arizona, is awarded a $67,550,000 firm-fixed-price modification to previously awarded contract N00024-24-C-5408 for Evolved Seasparrow Missile Blk 2 guided missile assemblies. Work will be performed in Tucson, Arizona (12%); Edinburgh, Australia (11%); Mississauga, Canada (10%); San Jose, California (9%); Raufoss, Norway (9%); Hengelo OV, Netherlands (5%); Ottobrunn, Germany (5%); Cambridge, Canada (4%); Nashua, New Hampshire (4%); Koropi Attica, Greece (3%); Lystrup, Denmark (2%); Ankara, Turkey (2%); Andover, Massachusetts (2%); Torrance, California (2%); Westlake Village, California (2%); Grenaa, Denmark (2%); Eight Mile Plains Brisbane, Australia (2%); Canton, New York (1%); Camden, Arkansas (1%); Aranjuez, Spain (1%); Milwaukie, Oregon (1%); and various other locations each less than 1% (10%), and is expected to be completed by September 2030. Fiscal 2025 other customer funds in the amount of $67,550,000 will be obligated at the time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(4). Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "CIRCOR Naval Solutions LLC",
        "contract_id": "N00104-25-C-ZA19",
        "location": "Warren, Massachusetts"
      }
    ],
    "purpose": "procurement of 20 trim and drain pumps used on Virginia Class submarines",
    "amount": 40000000.0,
    "contracting_agency": {
      "name": "Naval Supply Systems Command Weapon Systems Support",
      "location": "Mechanicsburg, Pennsylvania"
    },
    "contract_date": "2025-07-29",
    "award_text": "CIRCOR Naval Solutions LLC, Warren, Massachusetts, is awarded a not-to-exceed $40,000,000, for a firm-fixed-price, undefinitized contract action for the procurement of 20 trim and drain pumps used on Virginia Class submarines. This is a stand-alone contract with no options. All work will be performed in Warren, Massachusetts, and is expected to be completed by January 2029. Working capital funds (Navy) in the amount of $19,600,000 will be obligated at time of the award, and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement with one offer received. Naval Supply Systems Command Weapon Systems Support, Mechanicsburg, Pennsylvania, is the contracting activity (N00104-25-C-ZA19)."
  },
  {
    "contractors": [
      {
        "name": "The Boeing Co.",
        "contract_id": "N6134025F8000",
        "location": "St. Louis, Missouri"
      }
    ],
    "purpose": "To provide Simulator Integration Kits and long lead items/hardware for the P-8A Canada Training Systems, including planning, coordinating, scheduling, procuring, packaging, delivering, conducting inventory events, and providing facilities requirements support for various trainers such as operational flight trainers, weapons tactics trainers, part task trainers, training systems support centers, virtual maintenance trainers, a maintenance support cabinet, and electronic classrooms.",
    "amount": 37909683.0,
    "contracting_agency": {
      "name": "Naval Air Warfare Center Training Systems Division",
      "location": "Orlando, Florida"
    },
    "contract_date": "2025-07-29",
    "award_text": "The Boeing Co., St. Louis, Missouri, was awarded a $37,909,683 firm-fixed-price order (N6134025F8000) against a previously issued basic ordering agreement (N0001921G0006). This order is to provide the Simulator Integration Kits (SIKs) and long lead items/hardware for the P-8A Canada Training Systems. This effort will include contractor effort to plan, coordinate, schedule, procure, package and deliver the P-8A SIKs and other long lead hardware; as well as conducting inventory events and providing facilities requirements support. These SIKs and hardware will support the development and manufacture of operational flight trainers, weapons tactics trainers, part task trainers, training systems support centers, virtual maintenance trainers, a maintenance support cabinet, and electronic classrooms. Work will be performed in Huntington Beach, California (62%); St. Louis, Missouri (25%); various other locations within the continental U.S (10%); Tampa, Florida (2%); and Greenwood, Nova Scotia, and Comox, British Columbia (1%), and is expected to be completed in November 2029. Foreign Military Sales funds in the amount of $37,909,683 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This order was not competed. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Andantech Professional Corp.",
        "contract_id": "N6133125D0007",
        "location": "Gainesville, Florida"
      }
    ],
    "purpose": "Development of large-scale circuit designs for various image-sensor, memory, and computation-logic components that will be used as part of a high-throughput, low-power, low-bandwidth vision sensor with reconfigurable analog processing logic called the autonomous vision sensor.",
    "amount": 14800000.0,
    "contracting_agency": {
      "name": "Naval Surface Warfare Center, Panama City Division",
      "location": "Panama City, Florida"
    },
    "contract_date": "2025-07-29",
    "award_text": "Andantech Professional Corp.,* Gainesville, Florida, was awarded a $14,800,000 firm-fixed-price, indefinite-delivery/indefinite-quantity requirements contract for the development of large-scale circuit designs for various image-sensor, memory, and computation-logic components that will be used as part of a high-throughput, low-power, low-bandwidth vision sensor with reconfigurable analog processing logic called the autonomous vision sensor. Work will be performed in Gainesville, Florida, and is expected to be completed by July 2031. If all options are exercised, work will continue through July 2031. This contract will be funded from fiscal research, development, testing, and evaluation of 2026-2031 funds by delivery order with a ceiling of $14,800,000. There will be no funding assigned at the time of this award. This contract was not competitively procured via the Sam.gov, in accordance with 10 U.S. Code 3204(a)(1) and Federal Acquisition Regulation 6.302-1 — only one responsible source and no other supplies or services will satisfy agency requirements. Naval Surface Warfare Center, Panama City Division, Panama City, Florida, is the contracting activity (N6133125D0007)."
  },
  {
    "contractors": [
      {
        "name": "BAE Systems Land & Armaments L.P.",
        "contract_id": "N6339421C0008",
        "location": "Minneapolis, Minnesota"
      }
    ],
    "purpose": "to exercise options for design agent engineering and technical specialized support services for legacy rotating Guided Missile Launching Systems",
    "amount": 9216354.0,
    "contracting_agency": {
      "name": "Naval Surface Warfare Center Port Hueneme Division",
      "location": "Port Hueneme, California"
    },
    "contract_date": "2025-07-29",
    "award_text": "BAE Systems Land & Armaments L.P., Minneapolis, Minnesota, is awarded a $9,216,354 cost-plus-fixed-fee modification to previously awarded contract (N6339421C0008) to exercise options for design agent engineering and technical specialized support services for legacy rotating Guided Missile Launching Systems. Work will be performed in Taiwan (85%); and Minneapolis, Minnesota (15%), and is expected to be completed by July 2026. Fiscal 2025 other procurement (Navy) funds in the amount of $1,210,800 (70%); fiscal 2025 operation and maintenance (Navy) funds in the amount of $375,000 (21%); and Foreign Military Sales funds in the amount of $152,500 (9%), will be obligated at time of award; and funds in the amount of $375,000 will expire at the end of the current fiscal year. Naval Surface Warfare Center Port Hueneme Division, Port Hueneme, California, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Zygos Consulting LLC",
        "contract_id": "HT001525C0003",
        "location": "Arlington, Virginia"
      }
    ],
    "purpose": "Advisor support services that provides recommendations for support to management, assists supervision, support technical direction, and support coordination of acquisition actions, reporting, analytical activities, support reviews and support recommendations for acquisition policies, coordinates acquisition activities, analyzes and measures probable effects of various acquisition strategies, make recommendations on acquisition strategies, and streamlining on IT products and services.",
    "amount": 18446701.0,
    "contracting_agency": {
      "name": "Defense Health Agency, Enterprise Medical Services Contracting Division",
      "location": "San Antonio, Texas"
    },
    "contract_date": "2025-07-29",
    "award_text": "Zygos Consulting LLC, Arlington, Virginia, is awarded an $18,446,701 firm-fixed-price contract (HT001525C0003) for advisor support services that provides recommendations for support to management, assists supervision, support technical direction, and support coordination of acquisition actions, reporting, analytical activities, support reviews and support recommendations for acquisition policies, coordinates acquisition activities, analyzes and measures probable effects of various acquisition strategies, make recommendations on acquisition strategies, and streamlining on IT products and services. This is a 12-month base contract with four 12-month option periods, with a July 22, 2030, performance completion date. Base year funding is fiscal 2025 operations and maintenance funds in the amount of $2,146,418 obligated at time of award. Place of performance is San Antonio, Texas and Falls Church, Virginia. The Defense Health Agency, Enterprise Medical Services Contracting Division, San Antonio, Texas, is the contracting activity. (Awarded July 18, 2025)"
  },
  {
    "contractors": [
      {
        "name": "Dynetics Inc.",
        "contract_id": "W31P4Q-25-F-0222",
        "location": "Huntsville, Alabama"
      }
    ],
    "purpose": "Indirect Fire Protection Capability weapon system requirements",
    "amount": 264594352.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Redstone Arsenal, Alabama"
    },
    "contract_date": "2025-07-30",
    "award_text": "Dynetics Inc., Huntsville, Alabama, was awarded a cost-plus-fixed-fee, firm-fixed-price contract for Indirect Fire Protection Capability weapon system requirements. The amount of this action is $264,594,352. Bids were solicited via the internet with one received. Work will be performed in Huntsville, Alabama; Dallastown, Pennsylvania; and Chanhassen, Minnesota with an estimated completion date of July 30, 2026. Fiscal 2025 research, development, test and evaluation, Army funds in the amount of $127,875,297 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity (W31P4Q-25-F-0222)."
  },
  {
    "contractors": [
      {
        "name": "Computable Insights LLC",
        "contract_id": "W519TC-25-C-0037",
        "location": "Herndon, Virginia"
      }
    ],
    "purpose": "Enterprise License Agreement for Salesforce Software Licenses",
    "amount": 99697753.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Rock Island Arsenal, Illinois"
    },
    "contract_date": "2025-07-30",
    "award_text": "Computable Insights LLC, Herndon, Virginia, was awarded a firm-fixed-price contract for an Enterprise License Agreement with computable Insights/Salesforce for Salesforce Software Licenses. The amount of this action is $99,697,753. Bids were solicited via the internet with one received. Work will be performed on Fort Belvoir, Virginia, with an estimated completion date of June 26, 2030. Fiscal 2025 operation and maintenance, Army funds in the amount of $9,071,430 were obligated at the time of the award. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity (W519TC-25-C-0037)."
  },
  {
    "contractors": [
      {
        "name": "Amentum Services Inc.",
        "contract_id": "W58RGZ23-C-0029",
        "location": "Chantilly, Virginia"
      }
    ],
    "purpose": "To increase contract ceiling",
    "amount": 31742028.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Rock Island Arsenal, Illinois"
    },
    "contract_date": "2025-07-30",
    "award_text": "Amentum Services Inc., Chantilly, Virginia, was awarded a $31,742,028 modification (P00127) to contract W58RGZ23-C-0029 to increase contract ceiling. The modification brings the total cumulative face value of the contract to $978,296,891. Work will be performed in Chantilly, Virginia, with an estimated completion date of Jan. 15, 2030. Fiscal 2010 operation and maintenance, Army funds in the amount of $31,742,028 were obligated at the time of the award. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Day & Zimmermann Lone Star LLC",
        "contract_id": "W519TC250-F-0323",
        "location": "Texarkana, Texas"
      }
    ],
    "purpose": "Production of M82A1 Percussion Primers",
    "amount": 30912513.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Rock Island Arsenal"
    },
    "contract_date": "2025-07-30",
    "award_text": "Day & Zimmermann Lone Star LLC, Texarkana, Texas, was awarded a firm-fixed-price contract for Production of M82A1 Percussion Primers. The amount of this action is $30,912,513. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of April 30, 2028. Army Contracting Command, Rock Island Arsenal is the contracting activity (W519TC250-F-0323)."
  },
  {
    "contractors": [
      {
        "name": "FSCX Inc.",
        "contract_id": "W9124G-24-C-0001",
        "location": "Lawton, Oklahoma"
      }
    ],
    "purpose": "Survival, Evasion, Resistance and Escape (SERE) Instruction and Support Services",
    "amount": 13570300.0,
    "contracting_agency": {
      "name": "Army Field Directorate Office",
      "location": "Fort Eustis, Virginia"
    },
    "contract_date": "2025-07-30",
    "award_text": "FSCX Inc., Lawton, Oklahoma, was awarded a $13,570,300 modification (P00007) to contract W9124G-24-C-0001 for Survival, Evasion, Resistance and Escape (SERE) Instruction and Support Services. The modification brings the total cumulative face value of the contract to $25,266,709. Work will be performed on Fort Rucker, Alabama, with an estimated completion date of Aug. 25, 2029. Fiscal 2025 operation and maintenance, Army funds in the amount of $3,387,020 were obligated at the time of the award. Army Field Directorate Office, Fort Eustis, Virginia, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Security Signals Inc.",
        "contract_id": "W519TC-25-F-0325",
        "location": "Cordova, Tennessee"
      }
    ],
    "purpose": "for production of the M82A1 Percussion Primer",
    "amount": 10654852.0,
    "contracting_agency": {
      "name": "Army Contracting Command, Rock Island Arsenal",
      "location": "Illinois"
    },
    "contract_date": "2025-07-30",
    "award_text": "Security Signals Inc., Cordova, Tennessee, was awarded a $10,654,852 firm-fixed-price contract for production of the M82A1 Percussion Primer. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of Feb. 28, 2029. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity (W519TC-25-F-0325)."
  },
  {
    "contractors": [
      {
        "name": "DigiFlight Inc.",
        "contract_id": "W31P4Q-19-F-E002",
        "location": "Columbia, Maryland"
      }
    ],
    "purpose": "Apache Attack Helicopter Project Office logistics support services",
    "amount": 9493651.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Redstone Arsenal, Alabama"
    },
    "contract_date": "2025-07-30",
    "award_text": "DigiFlight Inc., Columbia, Maryland, was awarded a $9,493,651 modification (P00091) to contract W31P4Q-19-F-E002 for Apache Attack Helicopter Project Office logistics support services. Work will be performed in Huntsville, Alabama, with an estimated completion date of Oct. 31, 2025. Fiscal 2025 other procurement, Army; and Foreign Military Sales funds, in the amount of $9,493,651, were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Loc Performance Products LLC",
        "contract_id": "W912CH-25-D-0037",
        "location": "St. Marys, Ohio"
      }
    ],
    "purpose": "track pad repair kit",
    "amount": 9247996.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Detroit Arsenal, Michigan"
    },
    "contract_date": "2025-07-30",
    "award_text": "Loc Performance Products LLC, St. Marys, Ohio, was awarded a firm-fixed-price contract for track pad repair kit. The amount of this action is $9,247,996. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 29, 2030. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W912CH-25-D-0037)."
  },
  {
    "contractors": [
      {
        "name": "US Facilities Inc.",
        "contract_id": "W91236-24-C-5000",
        "location": "Philadelphia, Pennsylvania"
      }
    ],
    "purpose": "to conduct all services for the Atlantic Intracoastal Waterway bridges, structures, and facilities",
    "amount": 7721940.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Norfolk, Virginia"
    },
    "contract_date": "2025-07-30",
    "award_text": "US Facilities Inc., Philadelphia, Pennsylvania, was awarded a $7,721,940 modification (P00002) to contract W91236-24-C-5000 to conduct all services for the Atlantic Intracoastal Waterway bridges, structures, and facilities. The modification brings the total cumulative face value of the contract to $20,898,995. Work will be performed in Norfolk, Virginia, with an estimated completion date of Sept. 29, 2026. Fiscal 2025 civil operation and maintenance funds in the amount of $7,721,940 were obligated at the time of the award. U.S. Army Corps of Engineers, Norfolk, Virginia, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Sysco Seattle Inc.",
        "contract_id": "SPE300-25-D-3018",
        "location": "Kent, Washington"
      }
    ],
    "purpose": "Supply of full-line food and beverage items for the Army, Navy, Air Force, and Marine Corps.",
    "amount": 175625908.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-07-30",
    "award_text": "Sysco Seattle Inc., Kent, Washington, has been awarded a maximum $175,625,908 firm-fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for full-line food and beverage items. This was a competitive acquisition with two responses received. This is a five-year contract with no option periods. The ordering period end date is Sept. 28, 2030. Using military services are Army, Navy, Air Force, and Marine Corps. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE300-25-D-3018)."
  },
  {
    "contractors": [
      {
        "name": "Sysco Montana Inc.",
        "contract_id": "SPE300-25-D-3019",
        "location": "Billings, Montana"
      }
    ],
    "purpose": "full-line food and beverage items",
    "amount": 13695844.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-07-30",
    "award_text": "Sysco Montana Inc., Billings, Montana, has been awarded a maximum $13,695,844 fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for full-line food and beverage items. This was a competitive acquisition with one response received. This is a five-year contract with no option periods. The ordering period end date is July 27, 2030. Using military services are Army and Air Force. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE300-25-D-3019)."
  },
  {
    "contractors": [
      {
        "name": "AM General LLC",
        "contract_id": "SPRDL1-24-D-0034",
        "location": "South Bend, Indiana"
      }
    ],
    "purpose": "for A2 and Up Armored High Mobility Multi-Purpose Wheeled Vehicle hydraulic transmission units",
    "amount": 8645046.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Land and Maritime",
      "location": "Warren, Michigan"
    },
    "contract_date": "2025-07-30",
    "award_text": "AM General LLC, South Bend, Indiana, has been awarded a maximum $8,645,046 firm-fixed-price delivery order (SPRDL1-25-F-0162) against a three-year firm-fixed-price requirements contract (SPRDL1-24-D-0034) for A2 and Up Armored High Mobility Multi-Purpose Wheeled Vehicle hydraulic transmission units. This was a sole-source acquisition using justification 10 U.S. Code 3204 (2)(1), as stated in Federal Acquisition Regulation 6.302-1. The ordering period end date is May 1, 2027. Using military service is Army. Type of appropriation is fiscal 2025 through 2026 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan."
  },
  {
    "contractors": [
      {
        "name": "Pomp's Tire Service Inc.",
        "contract_id": "SPRDL1-25-F-0146",
        "location": "New Berlin, Wisconsin"
      }
    ],
    "purpose": "for M1076 load handling system wheel and tire assembly units",
    "amount": 8095156.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Land and Maritime",
      "location": "Warren, Michigan"
    },
    "contract_date": "2025-07-30",
    "award_text": "Pomp's Tire Service Inc., New Berlin, Wisconsin, has been awarded a maximum $8,095,156 firm-fixed-price delivery order (SPRDL1-25-F-0146) against a three-year basic ordering agreement (SPRDL1-22-D-0051) contract for M1076 load handling system wheel and tire assembly units. This was a competitive acquisition with three responses received. The ordering period end date is Sept. 1, 2025. Using military service is Army. Type of appropriation is fiscal 2025 through 2026 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan."
  },
  {
    "contractors": [
      {
        "name": "Northrop Grumman Systems Corp.",
        "contract_id": "SPE4A5-25-C-0040",
        "location": "Annapolis, Maryland"
      }
    ],
    "purpose": "Correction to contract announcement for services or supplies",
    "amount": 14027974.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Aviation",
      "location": "Richmond, Virginia"
    },
    "contract_date": "2025-07-30",
    "award_text": "CORRECTION: The contract announced on July 18, 2025, for Northrop Grumman Systems Corp., Annapolis, Maryland (SPE4A5-25-C-0040), for $14,027,974 was announced with an incorrect award date.  The correct award date is July 25, 2025. The contracting activity is the Defense Logistics Agency Aviation at Richmond, Virginia."
  },
  {
    "contractors": [
      {
        "name": "Teledyne Brown Engineering Inc.",
        "contract_id": "N00189-25-D-Z018",
        "location": "Huntsville, Alabama"
      }
    ],
    "purpose": "Support services to include designing and developing IT applications, developing medical manpower analytical methodologies, implementing algorithms, mapping capabilities, optimizing simulation engines, migration of tools to a cloud environment, delivering training and providing help-desk services in support of the medical modeling, simulation and mission support department at the Naval Health Research Center.",
    "amount": 126687633.0,
    "contracting_agency": {
      "name": "Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-07-30",
    "award_text": "Teledyne Brown Engineering Inc., Huntsville, Alabama, is being awarded $126,687,633 indefinite-delivery/indefinite-quantity contract with cost-plus-fixed-fee and firm-fixed-price ordering provisions for support services to include designing and developing IT applications, developing medical manpower analytical methodologies, implementing algorithms, mapping capabilities, optimizing simulation engines, migration of tools to a cloud environment, delivering training and providing help-desk services in support of the medical modeling, simulation and mission support department at the Naval Health Research Center. The contract will include a five-year ordering period with no options. The ordering period is expected to begin August 2025 and be completed by August 2030. Work will be performed in Huntsville, Alabama (80%); and San Diego, California (20%). Fiscal 2025 research, development, test and evaluation (RDT&E) (Navy) funds in the amount of $1,000 will be obligated to fund the contract's minimum amount and funds will not expire at the end of the current fiscal year. Subsequent task orders will be funded with appropriate fiscal year operations and maintenance (Navy) or RDT&E (Navy) funds. The contract was competitively procured electronically through the Navy Electronic Commerce Online and the System for Award Management (sam.gov) websites with three offers received. Naval Supply Systems Command Fleet Logistics Center Norfolk, Contracting Department, Philadelphia, Pennsylvania, is the contracting activity (N00189-25-D-Z018)."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Rotary and Mission Systems",
        "contract_id": "N00024-20-C-6117",
        "location": "Manassas, Virginia"
      }
    ],
    "purpose": "to exercise options for Foreign Military Sales (FMS) engineering design and development in support of sound navigation and ranging systems.",
    "amount": 21681442.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-07-30",
    "award_text": "Lockheed Martin Rotary and Mission Systems, Manassas, Virginia, is awarded a $21,681,442 cost-plus-incentive-fee modification to a previously awarded contract (N00024-20-C-6117) to exercise options for Foreign Military Sales (FMS) engineering design and development in support of sound navigation and ranging systems. Work will be performed in Manassas, Virginia (65%); Clearwater, Florida (32%); Syracuse, New York (2%); and Marion, Florida (1%), and is expected to be completed by September 2026. FMS funds in the amount of $3,716,552 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "L3Harris Corp.",
        "contract_id": "N00024-16-C-6251",
        "location": "Millersville, Maryland"
      }
    ],
    "purpose": "to procure spares parts and components",
    "amount": 16000000.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-07-30",
    "award_text": "L3Harris Corp., Millersville, Maryland, is awarded a $16,000,000 firm-fixed-price modification to a previously awarded contract N00024-16-C-6251. This modification is to procure spares parts and components. Work will be performed in Ashaway, Rhode Island (85%); and Syracuse, New York (15%), and is expected to be completed by January 2029. Fiscal 2025 other procurement (Navy) spares funds in the amount of $5,910,105 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "SyQwest Inc.",
        "contract_id": "N66604-25-C-0562",
        "location": "Cranston, Rhode Island"
      }
    ],
    "purpose": "for source and sensor kits",
    "amount": 7925190.0,
    "contracting_agency": {
      "name": "Naval Undersea Warfare Center Division, Newport",
      "location": "Newport, Rhode Island"
    },
    "contract_date": "2025-07-30",
    "award_text": "SyQwest Inc.,* Cranston, Rhode Island, is awarded an undefinitized contract action with a not-to-exceed amount of $7,925,190 for source and sensor kits. This is an eight-month contract with no option periods. Work will be performed in Cranston, Rhode Island, and is expected to be completed by January 2026. Fiscal 2024 weapons procurement (Navy) funds in the amount of $3,883,343 (49%) will be obligated on the award and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S.C. 3204(a)(7). Naval Undersea Warfare Center Division, Newport, Newport, Rhode Island, is the contracting activity (N66604-25-C-0562)."
  },
  {
    "contractors": [
      {
        "name": "Mercury Mission Systems, LLC",
        "contract_id": "FA8615-20-D-6070",
        "location": "Gulf Breeze, Florida"
      }
    ],
    "purpose": "for F-16 cockpit communications control panel organizer units and associated support",
    "amount": 70000000.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Wright-Patterson Air Force Base, Ohio"
    },
    "contract_date": "2025-07-30",
    "award_text": "Mercury Mission Systems, LLC, Gulf Breeze, Florida, has been issued a ceiling $25,000,000 value increase modification (P00004) to previously awarded (FA8615-20-D-6070) for F-16 cockpit communications control panel organizer units and associated support. The modification brings the total cumulative face value of the contract to $70,000,000. Work will be performed in Gulf Breeze, Florida, and is expected to be completed on Sept. 29, 2032. No funds are being obligated at the time of award. The Air Force Life Cycle Management Center, Wright-Patterson Air Force Base, Ohio, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "L3Harris Technologies, Integrated Systems L.P",
        "contract_id": "FA8620-25-F-B051",
        "location": "Greenville, Texas"
      }
    ],
    "purpose": "Procurement of contractor management services for program management and project engineering support for the Tactical Airborne Surveillance System program",
    "amount": 11017782.0,
    "contracting_agency": {
      "name": "645th Aeronautical Systems Group",
      "location": "Wright-Patterson Air Force Base, Ohio"
    },
    "contract_date": "2025-07-30",
    "award_text": "L3Harris Technologies, Integrated Systems L.P, Greenville, Texas, was awarded an $11,017,782 firm-fixed-price contract for the procurement of contractor management services. This contract provides for program management and project engineering support for the Tactical Airborne Surveillance System program. Work will be performed at Greenville, Texas, and is expected to be completed by July 30, 2026. This contract involves foreign military sales. This contract was a sole source acquisition. Foreign Military Sales funds in the amount of $11,017,782 are being obligated at the time of award. The 645th Aeronautical Systems Group, Wright-Patterson Air Force Base, Ohio, is the contracting activity (FA8620-25-F-B051)."
  },
  {
    "contractors": [
      {
        "name": "Open X Education Inc.",
        "contract_id": "FA3020-21-A-0007",
        "location": "Layton, Utah"
      }
    ],
    "purpose": "Innovation Sherpas",
    "amount": 9000000.0,
    "contracting_agency": {
      "name": "82nd contracting squadron",
      "location": "Sheppard Air Force Base, Texas"
    },
    "contract_date": "2025-07-30",
    "award_text": "Open X Education Inc., Layton, Utah, was awarded a $9,000,000 ceiling firm-fixed-price modification (P00002) to a previously awarded contract (FA3020-21-A-0007) for Innovation Sherpas. This modification brings the total cumulative face value of the contract to $9,000,000 from $1,900,000. Work will be performed throughout the Department of Defense based on individual calls and is expected to be completed by August 31, 2026. No funds are being obligated at the time of award. The 82nd contracting squadron, Sheppard Air Force Base, Texas, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin",
        "contract_id": "FA8807‐08‐C‐0010",
        "location": "Littleton, Colorado"
      }
    ],
    "purpose": "for Global Positioning System III non-flight single board computers",
    "amount": 4696831149.0,
    "contracting_agency": {
      "name": "Space Systems Command, Military Communication and Positioning",
      "location": "Los Angeles Air Force Base, California"
    },
    "contract_date": "2025-07-30",
    "award_text": "Lockheed Martin, Littleton, Colorado, has been awarded a $8,133,823 modification (P00805) to a previously awarded contract (FA8807‐08‐C‐0010) for Global Positioning System III non-flight single board computers. The modification brings the total cumulative face value of the contract to $4,696,831,149. Work will be performed at Littleton, Colorado, and is expected to be completed by January 2028. Fiscal 2025 missile procurement funds in the amount of $8,133,823 are being obligated at time of award. The Space Systems Command, Military Communication and Positioning, Los Angeles Air Force Base, California, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Vane Line Bunkering LLC",
        "contract_id": "HTC71125CE120",
        "location": "Baltimore, Maryland"
      }
    ],
    "purpose": "This contract is to obtain transportation fuel by tug and barge between all ordered U.S. ports and points on the Atlantic and Gulf Coasts, and their connecting, inland, and coastal waterways and tributaries.",
    "amount": 11863942.0,
    "contracting_agency": {
      "name": "U.S. Transportation Command, Directorate of Acquisition",
      "location": "Scott Air Force Base, Illinois"
    },
    "contract_date": "2025-07-30",
    "award_text": "Vane Line Bunkering LLC, Baltimore, Maryland (HTC71125CE120), has been awarded a firm-fixed-price contract with a face value of $11,863,942. This contract is to obtain transportation fuel by tug and barge between all ordered U.S. ports and points on the Atlantic and Gulf Coasts, and their connecting, inland, and coastal waterways and tributaries. The base period of performance is from Sep. 1, 2025, through Aug. 31, 2026. Working capital funds (Defense) will be obligated for fiscal 2025. The U.S. Transportation Command, Directorate of Acquisition, Scott Air Force Base, Illinois, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Vertex Aerospace LLC",
        "contract_id": "FA8106-25-D-B002",
        "location": "Madison Mississippi"
      }
    ],
    "purpose": "Contract for the contractor operated and maintained supply service contract for the T-6 aircraft, providing support for safe flyable aircraft to meet users' daily flight schedule and depot requirements consistent with Department of Defense and commercial sector best practices in procuring, producing, and delivering products and services to customers.",
    "amount": 4322844989.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Tinker Air Force Base, Oklahoma"
    },
    "contract_date": "2025-07-31",
    "award_text": "Vertex Aerospace LLC, Madison Mississippi, was awarded a maximum $4,322,844,989 value, indefinite-delivery/indefinite-quantity contract for the contractor operated and maintained supply service contract for the T-6 aircraft. This contract provides support for safe flyable aircraft to meet users' daily flight schedule and depot requirements consistent with Department of Defense and commercial sector best practices in procuring, producing, and delivering products and services to customers. Work will be performed at a variety of military bases across the continental U.S., and is expected to be completed by July 31, 2034. This contract was a competitive source selection with three offers received. Fiscal 2025 operation and maintenance funds in the amount of $5,324,080 are being obligated at the time of award. The Air Force Life Cycle Management Center, Tinker Air Force Base, Oklahoma, is the contracting activity (FA8106-25-D-B002)."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Missiles and Fire Control",
        "contract_id": "FA8682-24-C-B001",
        "location": "Orlando, Florida"
      }
    ],
    "purpose": "Procurement of Joint Air-To-Surface Standoff Missile (JASSM) and Long-Range, Anti-Ship Missile (LRASM) large lot for JASSM Lots 22-26 and LRASM Lots 9-12.",
    "amount": 4288108296.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Eglin Air Force Base, Florida"
    },
    "contract_date": "2025-07-31",
    "award_text": "Lockheed Martin Missiles and Fire Control, Orlando, Florida, has been awarded a $4,288,108,296 firm-fixed-price definitization modification (PZ0007) to a previously awarded contract (FA8682-24-C-B001) for the Joint Air-To-Surface Standoff Missile (JASSM) and Long-Range, Anti-Ship Missile (LRASM) large lot procurement for JASSM Lots 22-26 and LRASM Lots 9-12. This modification brings the total cumulative face value of the contract to $9,485,190,471. Work will be performed at Orlando, Florida; and Troy, Alabama, and is expected to be completed by Jan. 31, 2033. This contract action involves Foreign Military Sales (FMS) to Poland, Netherlands, Japan, and Finland. Fiscal 2023 (Air Force) missiles procurement funds in the amount $3,015,000; Fiscal 2024 (Air Force) missiles procurement funds in the amount of $634,523,930; fiscal 2025 (Air Force) missiles procurement funds in the amount of $418,007,325; fiscal 2025 (Air Force) research, development, test and evaluation funds in the amount of $7,944,999; fiscal 2024 (Navy) weapons procurement funds in the amount of $60,524,996; fiscal 2025 (Navy) weapons procurement funds in the amount of $44,349,985; and FMS funds in the amount of $238,899,984, are being obligated at time of award. The Air Force Life Cycle Management Center, Eglin Air Force Base, Florida, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Raytheon, Division of Raytheon Technologies Corp.",
        "contract_id": "FA8659-25-C-B003",
        "location": "Tucson, Arizona"
      }
    ],
    "purpose": "Production of Advanced Medium Range Air-to-Air Missile (AMRAAM) Production Lots 39 and 40, including AMRAAM missiles, AMRAAM Telemetry System, initial and field spares, and other production engineering support activities.",
    "amount": 3500000000.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center, Air Dominance Division Contracting Office",
      "location": "Eglin Air Force Base, Florida"
    },
    "contract_date": "2025-07-31",
    "award_text": "Raytheon, Division of Raytheon Technologies Corp., Tucson, Arizona, was awarded a not-to-exceed $3,500,000,000 firm-fixed-price incentive, undefinitized contract action for Advanced Medium Range Air-to-Air Missile (AMRAAM) Production Lots 39 and 40. This contract provides for the production of AMRAAM missiles, AMRAAM Telemetry System, initial and field spares, and other production engineering support activities. This contract involves Foreign Military Sales (FMS) to: Denmark, Belgium, Japan, Netherlands, Canada, Finland, Germany, Hungary, Spain, Poland, Sweden, Taiwan, Lithuania, the United Kingdom, Australia, Switzerland, Ukraine, Isreal, and Kuwait. Work will be performed in Tucson, Arizona, and is expected to be completed in the third quarter of fiscal 2031. This contract was a sole source acquisition. Fiscal 2024 Navy weapons procurement funds in the amount of  $113,000,000; fiscal 2025 Navy weapons procurement funds in the amount of  $190,000,000; fiscal 2023 Air Force missile procurement funds in the amount of $1,300,000; fiscal 2024 Air Force missile procurement funds in the amount of $116,000,000; fiscal 2025 Air Force missile procurement funds in the amount of $472,000,000; fiscal 2025 Air Force research, development, test and evaluation funds in the amount of $507,000; fiscal 2024 Air Force operation and maintenance funds in the amount of $253,936; and FMS funds in the amount of  $621,000,000, are being obligated at the time of award. The Air Force Life Cycle Management Center, Air Dominance Division Contracting Office, Eglin Air Force Base, Florida, is the contracting activity. (FA8659-25-C-B003)"
  },
  {
    "contractors": [
      {
        "name": "The University of Dayton Research Institute",
        "contract_id": "",
        "location": "Dayton, Ohio"
      }
    ],
    "purpose": "Counter-targeting enhancement research, including the advancement and maturation of promising technologies for intelligence, surveillance and reconnaissance (ISR), and counter-targeting/counter-ISR.",
    "amount": 98500000.0,
    "contracting_agency": {
      "name": "Air Force Research Laboratory Wright Research Site",
      "location": "Wright-Patterson Air Force Base, Ohio"
    },
    "contract_date": "2025-07-31",
    "award_text": "The University of Dayton Research Institute, Dayton, Ohio, was awarded a $98,500,000 cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract for counter-targeting enhancement research. This contract provides for the advancement and maturation of promising technologies for intelligence, surveillance and reconnaissance (ISR), and counter-targeting/counter-ISR. Work will be performed at Dayton, Ohio, and is expected to be completed July 31, 2030. This contract was a competitive acquisition and one offer was received. An initial task order totaling $22,700,000 will be awarded concurrently. Fiscal 2025 research, development, test and evaluation funds in the amount of are being obligated to the task order at the time of award. The Air Force Research Laboratory Wright Research Site, Wright-Patterson Air Force Base, Ohio, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "The Boeing Co.",
        "contract_id": "FA8105-23-D-0002",
        "location": "Oklahoma City, Oklahoma"
      }
    ],
    "purpose": "KC-135 engineering sustainment support",
    "amount": 154538133.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Tinker Air Force Base, Oklahoma"
    },
    "contract_date": "2025-07-31",
    "award_text": "The Boeing Co., Oklahoma City, Oklahoma, has been awarded a $79,349,247 option modification (P00009) to a previously awarded contract (FA8105-23-D-0002) for KC-135 engineering sustainment support. The modification brings the total cumulative face value of the contract to $154,538,133. Work will be performed at Oklahoma City, Oklahoma; San Antonio, Texas; Huntsville, Alabama; Houston, Texas; Pleasanton, California; Long Beach, California; Mesa, Arizona; Tukwila, Washington; St. Louis, Missouri; Fort Walton Beach, Florida; and Vancouver, Canada, and is expected to be complete by June 30, 2033. This modification involves unclassified Foreign Military Sales to Chile, France, and Turkey. Fiscal 2025 operations and maintenance appropriation funds in the estimated amount of $21,200,000 are being obligated at the time of award. The Air Force Life Cycle Management Center, Tinker Air Force Base, Oklahoma, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Montana State University",
        "contract_id": "FA8750-25-C-B027",
        "location": "Bozeman, Montana"
      }
    ],
    "purpose": "This contract provides for expanding the capabilities of applied quantum capacity, operational resilience, and regional equity test-bed facility to include heterogeneous entanglement capabilities, to further foster a collaborative industry-facing workforce development program, including a hands-on training facility, exploring fidelity definitions and processes, benchmarking in partnership with the Quantum Economic Development Consortium, and establishing an accelerator to facilitate regional economic development with industrial partners.",
    "amount": 31518010.0,
    "contracting_agency": {
      "name": "Air Force Research Laboratory",
      "location": "Rome, New York"
    },
    "contract_date": "2025-07-31",
    "award_text": "Montana State University, Bozeman, Montana, was awarded a $31,518,010 cost-type contract for Expand Q-CORE. This contract provides for expanding the capabilities of applied quantum capacity, operational resilience, and regional equity test-bed facility to include heterogeneous entanglement capabilities, to further foster a collaborative industry-facing workforce development program, including a hands-on training facility, exploring fidelity definitions and processes, benchmarking in partnership with the Quantum Economic Development Consortium, and establishing an accelerator to facilitate regional economic development with industrial partners. Work will be performed in Bozeman, Montana, and is expected to be completed by July 30, 2028. This contract was a competitive acquisition and two offers were received. Fiscal 2025 research, development, test and evaluation funds in the amount of $15,752,203 are being obligated at time of award. The Air Force Research Laboratory, Rome, New York, is the contracting activity (FA8750-25-C-B027)."
  },
  {
    "contractors": [
      {
        "name": "L3Harris Technologies Integrated Systems L.P.",
        "contract_id": "FA8555-25-C-0001",
        "location": "Greenville, Texas"
      }
    ],
    "purpose": "Integrated Broadcast Service – Common Interactive Broadcast – Uplink Site Sustainment Program",
    "amount": 9306234.0,
    "contracting_agency": {
      "name": "Air Force Life Cycle Management Center",
      "location": "Robins Air Force Base, Georgia"
    },
    "contract_date": "2025-07-31",
    "award_text": "L3Harris Technologies Integrated Systems L.P., Greenville, Texas, has been awarded a $9,306,234 firm-fixed-price, cost-plus-fixed-fee, and cost-reimbursement-no fee definitizing modification (PZ00001) to a previously awarded contract (FA8555-25-C-0001) for the Integrated Broadcast Service – Common Interactive Broadcast – Uplink Site Sustainment Program. Work will be performed in multiple locations in the contiguous U.S. and outside the contiguous U.S. and is expected to be completed Feb. 28, 2026, if all options are exercised. This contract was a sole source acquisition. Fiscal 2025 operation and maintenance funds in the amount of $336,757 will be obligated at time of award. The Air Force Life Cycle Management Center, Robins Air Force Base, Georgia, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "General Dynamics, Bath Iron Works",
        "contract_id": "N00024-23-C-2305",
        "location": "Bath, Maine"
      }
    ],
    "purpose": "To exercise the fiscal 2025 option for construction of an Arleigh Burke-class ship (DDG 148), including options for engineering change proposals, design budgeting requirements, and post-delivery availabilities.",
    "amount": 0.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-07-31",
    "award_text": "General Dynamics, Bath Iron Works, Bath, Maine, is awarded a fixed-price incentive (firm-target) modification to a previously awarded contract (N00024-23-C-2305) to exercise the fiscal 2025 option for construction of an Arleigh Burke-class ship (DDG 148). This modification also includes options for engineering change proposals, design budgeting requirements, and post-delivery availabilities. Work will be performed in Bath, Maine (69%); Cincinnati, Ohio (4%); Walpole, Massachusetts (4%); York, Pennsylvania (2%); South Portland, Maine (1%); Falls Church, Virginia (1%); and other locations (< 1% (totaling 19%), and is expected to be completed by August 2032. Fiscal 2025 shipbuilding and conversion (Navy) funds will be obligated at the time of award and will not expire at the end of the current fiscal year. The Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Corp.",
        "contract_id": "N0001925F0090",
        "location": "Fort Worth, Texas"
      },
      {
        "name": "Lockheed Martin Aeronautics Co.",
        "contract_id": "N0001925F0090",
        "location": "Fort Worth, Texas"
      }
    ],
    "purpose": "Procure fiscal 2025 F-35 air vehicle initial spares, including basic spares pool, global spares pool, customer-specific afloat spares pool, deployable spares pool, and support labor, to meet immediate maintenance needs and ensure mission capable aircraft for U.S. services, Collaborative Program Partner nations, and Foreign Military Sales customers.",
    "amount": 578729839.0,
    "contracting_agency": {
      "name": "Naval Air Systems Command",
      "location": "Patuxent River, Maryland"
    },
    "contract_date": "2025-07-31",
    "award_text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded an undefinitized contract action with a not-to-exceed value of $578,729,839, firm-fixed-price order (N0001925F0090) against a previously issued basic ordering agreement (N0001924G0010). This order procures fiscal 2025 F-35 air vehicle initial spares. The subject contract procures basic spares pool and global spares pool spares shared between the customers involved, customer specific afloat spares pool and deployable spares pool, and support labor. These initial spares are necessary to meet immediate maintenance needs and ensure the U.S. services, Collaborative Program Partner nations, and Foreign Military Sales (FMS) customers have mission capable aircraft.  Work will be performed in Fort Worth, Texas (100%), and is expected to be completed in June 2030. Fiscal 2025 aircraft procurement (Air Force) funds in the amount of $148,743,106; fiscal 2025 aircraft procurement (Marine Corps) funds in the amount of $58,473,883; fiscal 2025 aircraft procurement (Navy) funds in the amount of $21,551,619; fiscal 2024 aircraft procurement (Air Force) funds in the amount of $8,519,727; fiscal 2024 aircraft procurement (Marine Corps) funds in the amount of $3,495,556; fiscal 2024 aircraft procurement (Navy) funds in the amount of $1,876,609; fiscal 2023 aircraft procurement (Air Force) funds in the amount of $4,306,095; fiscal 2023 aircraft procurement (Navy) funds in the amount of $7,061,999; international partner funding in the amount of $43,292,470; and FMS funds in the amount of $241,095,906, will be obligated at the time of award, $11,360,000 of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Lockheed Martin Rotary and Mission Systems",
        "contract_id": "N00024-25-C-6202",
        "location": "Syracuse, New York"
      }
    ],
    "purpose": "Engineering and technical support and production of submarine multifunction modular masts on new construction and in-service submarines",
    "amount": 57258872.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-07-31",
    "award_text": "Lockheed Martin Rotary and Mission Systems, Syracuse, New York, is awarded a $57,258,872 cost-plus-fixed-fee and firm-fixed-price contract for engineering and technical support and production of submarine multifunction modular masts on new construction and in-service submarines. This contract includes options which, if exercised, would bring the cumulative value of this contract to $202,772,544. Work will be performed in Syracuse, New York, and is expected to be completed by July 2030. Fiscal 2024 shipbuilding and conversion (Navy) funds in the amount of $38,683,770 (71%); fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $15,490,815 (28%); and fiscal 2025 other procurement (Navy) funds in the amount of $100,000 (1%), will be obligated and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1). Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-6202)."
  },
  {
    "contractors": [
      {
        "name": "EA Engineering, Science, and Technology Inc. PBC",
        "contract_id": "N44255-25-D-0004",
        "location": "Hunt Valley, Maryland"
      }
    ],
    "purpose": "environmental services at various locations within the Naval Facilities Engineering Systems Command (NAVFAC) Northwest area of operations",
    "amount": 45000000.0,
    "contracting_agency": {
      "name": "NAVFAC Northwest",
      "location": "Silverdale, Washington"
    },
    "contract_date": "2025-07-31",
    "award_text": "EA Engineering, Science, and Technology Inc. PBC, Hunt Valley, Maryland, is awarded a $45,000,000 indefinite-delivery/indefinite-quantity contract for environmental services. Work will be performed at various locations within the Naval Facilities Engineering Systems Command (NAVFAC) Northwest area of operations and is expected to be completed by January 2031. Fiscal 2025 Environmental Restoration, Navy (ERN) funds in the amount of $10,000 will be obligated at time of award and will expire at the end of the current fiscal year. Future task orders will be primarily funded by operation and maintenance, Navy, and ERN funds. This contract was competitively procured via SAM.gov with two proposals received. NAVFAC Northwest, Silverdale, Washington, is the contracting activity (N44255-25-D-0004)."
  },
  {
    "contractors": [
      {
        "name": "Framaco-Bozdemir JV LLC",
        "contract_id": "N33191-25-C-6007",
        "location": "Rye Brook, New York"
      }
    ],
    "purpose": "renovations and upgrades to three existing facilities at Keflavik Air Station, Iceland",
    "amount": 38186062.0,
    "contracting_agency": {
      "name": "Naval Facilities Engineering Systems Command, Europe Africa Central",
      "location": "Naples, Italy"
    },
    "contract_date": "2025-07-31",
    "award_text": "Framaco-Bozdemir JV LLC, Rye Brook, New York, is awarded a $38,186,062 firm-fixed-price contract for renovations and upgrades to three existing facilities at Keflavik Air Station, Iceland. Work will be performed in Keflavik, Iceland, and is expected to be completed by February 2027.  Fiscal 2025 operations and maintenance (Navy) contract funds in the amount of $38,186,062 are obligated on this award and will expire at the end of the current fiscal year. This contract was competitively procured via the Solicitation Module in the Procurement Integrated Enterprise Environment, with three proposals received. The Naval Facilities Engineering Systems Command, Europe Africa Central, Naples, Italy, is the contracting activity (N33191-25-C-6007).Fighter Jet Metals Inc.,* Lake Worth Beach, Florida (N6893625D0017); Rache Corp.,* Camarillo, California (N6893625D0018); Rickard Metals Inc.,* Santa Fe Springs, California (N6893625D0019); and T & T Materials Inc.,* Rochester, New York (N6893625D0020), are awarded combined $19,300,000 firm-fixed-price, multiple-award, indefinite‐delivery/indefinite‐quantity contracts for the procurement of commercially available types of materials such as metals, alloys, acrylic, delrin, fiberglass, plastic, polyvinyl chloride, rubber, and fluoropolymer. Work will be performed at the listed contractor's locations and is expected to be completed by July 2030. These contracts were a competitive acquisition and five offers were received. Funding will be obligated as individual orders are placed. No funding is being obligated at the time of award. Naval Air Warfare Center Weapons Division, China Lake, California, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "L3Harris Corp.",
        "contract_id": "N00024-16-C-6239",
        "location": "Millersville, Maryland"
      }
    ],
    "purpose": "to procure spares parts and components",
    "amount": 15363176.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-07-31",
    "award_text": "L3Harris Corp., Millersville, Maryland, is awarded a $15,363,176 firm-fixed-price modification to a previously awarded contract (N00024-16-C-6239). This modification is to procure spares parts and components. Work will be performed in Ashaway, Rhode Island (85%); and Syracuse, New York (15%), and is expected to be completed by January 2029. Fiscal 2025 other procurement (Navy) spares funds in the amount of $7,725,875 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "StraCon Services Group LLC",
        "contract_id": "N6134025F0094",
        "location": "Fort Worth, Texas"
      }
    ],
    "purpose": "Provides engineering, logistics, and program management support to the Navy and Foreign Military Sales (FMS) customers.",
    "amount": 12185713.0,
    "contracting_agency": {
      "name": "Naval Air Warfare Center Training Systems Division",
      "location": "Orlando, Florida"
    },
    "contract_date": "2025-07-31",
    "award_text": "StraCon Services Group LLC,* Fort Worth, Texas, is awarded a $12,185,713 cost-plus-fixed-fee order (N6134025F0094) against a previously awarded indefinite-delivery/indefinite-quantity contract (N6134020D0024). This order provides engineering, logistics, and program management support to the Navy and Foreign Military Sales (FMS) customers. Work will be performed in Orlando, Florida, and is expected to be completed in March 2026. Fiscal 2025 aircraft procurement (Navy) funding in the amount of $2,913,642; fiscal 2025 working capital (Navy) funds in the amount of $2,481,149; fiscal 2025 operations and maintenance (Navy) funds in the amount of $936,716; fiscal 2025 operations and maintenance (Air Force) funds in the amount of $137,602; fiscal 2025 other procurement (Navy) funds in the amount of $233,964; fiscal 2025 Royal Australian Air Force (unique) funds in the amount of $246,277; fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $598,668; and FMS customer funds in the amount of $1,650,810, will be obligated at award, $3,555,467 of which will expire at the end of the current fiscal year. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Countrywide Quality Services",
        "contract_id": "N3904025C2937",
        "location": "Pasadena, Texas"
      },
      {
        "name": "DRS Laurel Technologies Inc.",
        "contract_id": "N00024-17-C-4109",
        "location": "Johnstown, Pennsylvania"
      }
    ],
    "purpose": "Rental of single-occupancy efficiency lodging for naval project team and procurement of AN/USQ-82(V) Gigabit Ethernet Data Multiplex System hardware and spare parts.",
    "amount": 11706592.0,
    "contracting_agency": {
      "name": "Portsmouth Naval Shipyard",
      "location": "Kittery, Maine"
    },
    "contract_date": "2025-07-31",
    "award_text": "Countrywide Quality Services,* Pasadena, Texas, is awarded an $11,706,592 firm-fixed-price contract (N3904025C2937) for rental of single-occupancy efficiency lodging to accommodate members of a Portsmouth Naval Shipyard project team assigned to temporary duty to support the Docking Selected Restricted Availability of a Los Angeles-class submarine. Work will be performed in Groton, Connecticut, and is expected to be completed by July 2026. Fiscal 2025 operation and maintenance (Navy) funds in the amount of $11,706,592 will be obligated at the time of award. This contract was competitively procured via the SAM.gov website, with 17 offers received. Portsmouth Naval Shipyard, Kittery, Maine, is the contracting activity.DRS Laurel Technologies Inc., Johnstown, Pennsylvania, is awarded a not-to-exceed $11,526,652 firm-fixed-price contract modification to previously awarded contract (N00024-17-C-4109) for the procurement of AN/USQ-82(V) Gigabit Ethernet Data Multiplex System hardware and spare parts in support of Arleigh Burke-class destroyer new construction and modernization. Work will be performed in Johnstown, Pennsylvania, and is expected to be completed by March 2027. Fiscal 2020 shipbuilding and conversion (Navy) funds in the amount of $121,489 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Northrop Grumman Systems Corp.",
        "contract_id": "N00024-23-C-6110",
        "location": "McLean Virginia"
      }
    ],
    "purpose": "to exercise year two options for operation of the progressive depot level repair facility and torpedo maintenance and support at the Navy Submarine Torpedo Facility in support of the MK48 Heavyweight Torpedo efforts. Work will be performed in Yorktown, Virginia, and is expected to be completed by July 2026.",
    "amount": 7558892.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-07-31",
    "award_text": "Northrop Grumman Systems Corp., McLean Virginia, is awarded a $7,558,892 cost-plus-incentive-fee modification to a previously awarded contract (N00024-23-C-6110) to exercise year two options for operation of the progressive depot level repair facility and torpedo maintenance and support at the Navy Submarine Torpedo Facility in support of the MK48 Heavyweight Torpedo efforts. Work will be performed in Yorktown, Virginia, and is expected to be completed by July 2026. Fiscal 2025 operation and maintenance (Navy) funds in the amount of $3,745,750 will be obligated at the time of award and will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Conco Inc.",
        "contract_id": "W15QKN-20-D-0003",
        "location": "Louisville, Kentucky"
      }
    ],
    "purpose": "to manufacture, inspect, test, and deliver metal containers and covers for the M231 and M232 series for the Modular Artillery Charge Systems",
    "amount": 329435528.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Newark, New Jersey"
    },
    "contract_date": "2025-07-31",
    "award_text": "Conco Inc., Louisville, Kentucky, was awarded a $329,435,528 modification (P00015) to contract W15QKN-20-D-0003 to manufacture, inspect, test, and deliver metal containers and covers for the M231 and M232 series for the Modular Artillery Charge Systems. The modification brings the total cumulative face value of the contract to $628,655,767. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Dec. 12, 2026. Army Contracting Command, Newark, New Jersey, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "ACC Construction Co. Inc.",
        "contract_id": "W912HN-25-C-4002",
        "location": "Augusta, Georgia"
      }
    ],
    "purpose": "to construct a new standard design Automation-Aided Instructional area",
    "amount": 165948726.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Savannah, Georgia"
    },
    "contract_date": "2025-07-31",
    "award_text": "ACC Construction Co. Inc., Augusta, Georgia, was awarded a firm-fixed-price contract to construct a new standard design Automation-Aided Instructional area. The amount of this action is $165,948,726. Bids were solicited via the internet with three received. Work will be performed on Fort Gordon, Georgia with an estimated completion date of March 24, 2029. Fiscal 2024 military construction, Army funds in the amount of $165,948,726 were obligated at the time of the award. U.S. Army Corps of Engineers, Savannah, Georgia, is the contracting activity (W912HN-25-C-4002)."
  },
  {
    "contractors": [
      {
        "name": "A&H-Ambica JV LLC",
        "contract_id": "W912CH-25-D-A018",
        "location": "Livonia, Michigan"
      },
      {
        "name": "Angels General Construction",
        "contract_id": "W912CH-25-D-A019",
        "location": "Detroit, Michigan"
      },
      {
        "name": "B&B Industries",
        "contract_id": "W912CH-25-D-A023",
        "location": "Frasier, Michigan"
      },
      {
        "name": "CAVU Construction",
        "contract_id": "W912CH-25-D-A024",
        "location": "Virginia Beach, Virginia"
      },
      {
        "name": "DCR Services & Construction",
        "contract_id": "W912CH-25-D-A025",
        "location": "Detroit, Michigan"
      },
      {
        "name": "DMC Consultants",
        "contract_id": "W912CH-25-D-A026",
        "location": "Detroit, Michigan"
      },
      {
        "name": "Enfield Enterprises LLC",
        "contract_id": "W912CH-25-D-A027",
        "location": "Springfield, Massachusetts"
      },
      {
        "name": "Erie Affiliates",
        "contract_id": "W912CH-25-D-A028",
        "location": "Cleveland, Ohio"
      },
      {
        "name": "Nisou Enterprises",
        "contract_id": "W912CH-25-D-A029",
        "location": "Farmington Hills, Michigan"
      },
      {
        "name": "Pontiac Drywall Systems Inc.",
        "contract_id": "W912CH-25-D-A031",
        "location": "Pontiac, Michigan"
      },
      {
        "name": "RB Construction Co.",
        "contract_id": "W912CH-25-D-A032",
        "location": "Mt. Clemens, Michigan"
      },
      {
        "name": "Sanalil Construction",
        "contract_id": "W912CH-25-D-A033",
        "location": "Fort Lauderdale, Florida"
      }
    ],
    "purpose": "construction",
    "amount": 96200000.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Detroit Arsenal, Michigan"
    },
    "contract_date": "2025-07-31",
    "award_text": "A&H-Ambica JV LLC,* Livonia, Michigan (W912CH-25-D-A018); Angels General Construction,* Detroit, Michigan (W912CH-25-D-A019); B&B Industries,* Frasier, Michigan (W912CH-25-D-A023) CAVU Construction,* Virginia Beach, Virginia (W912CH-25-D-A024); DCR Services & Construction,* Detroit, Michigan (W912CH-25-D-A025); DMC Consultants,* Detroit, Michigan (W912CH-25-D-A026); Enfield Enterprises LLC,* Springfield, Massachusetts (W912CH-25-D-A027); Erie Affiliates,* Cleveland, Ohio (W912CH-25-D-A028); Nisou Enterprises,* Farmington Hills, Michigan (W912CH-25-D-A029); Pontiac Drywall Systems Inc.,* Pontiac, Michigan (W912CH-25-D-A031); RB Construction Co.,* Mt. Clemens, Michigan (W912CH-25-D-A032); and Sanalil Construction,* Fort Lauderdale, Florida (W912CH-25-D-A033), will compete for each order of the $96,200,000 firm-fixed-price contract for construction. The total combined face value of the contract is $96,200,000. Bids were solicited via the internet with 13 received. Work locations and funding will be determined with each order, with an estimated completion date of Aug 2, 2030. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Loc Performance Products LLC",
        "contract_id": "W15QKN-18-C-0073",
        "location": "Plymouth, Michigan"
      }
    ],
    "purpose": "for Improved Armored Cab production kits and IAC Integration Spares kits for the M270A2 Multiple Launcher Rocket System",
    "amount": 69805302.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Redstone Arsenal, Alabama"
    },
    "contract_date": "2025-07-31",
    "award_text": "Loc Performance Products LLC, Plymouth, Michigan, was awarded a $69,805,302 modification (P00033) to contract W15QKN-18-C-0073 for Improved Armored Cab production kits and IAC Integration Spares kits for the M270A2 Multiple Launcher Rocket System. The modification brings the total cumulative face value of the contract to $334,927,813. Work will be performed in Plymouth, Michigan, with an estimated completion date of Aug. 31, 2029. Fiscal 2024 M270 Cooperative Partner (Italy, United Kingdom); 2025 missile procurement, Army funds; and 2025 Foreign Military Sales (Finland) funds, in the amount of $69,805,302 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Conti Federal Services LLC",
        "contract_id": "W912ER-25-C-0007",
        "location": "Orlando, Florida"
      }
    ],
    "purpose": "construction",
    "amount": 64998730.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers, Middle East District",
      "location": "Middle East"
    },
    "contract_date": "2025-07-31",
    "award_text": "Conti Federal Services LLC, Orlando, Florida, was awarded a firm-fixed-price contract for construction. The amount of this action is $64,998,730. Bids were solicited via the internet with four received. Work will be performed in Israel with an estimated completion date of July 17, 2028. Fiscal 2025 Foreign Military Sales (Israel) funds in the amount of $64,998,730 were obligated at the time of the award. U.S. Army Corps of Engineers, Middle East District, is the contracting activity (W912ER-25-C-0007)."
  },
  {
    "contractors": [
      {
        "name": "Donjon Marine Co. Inc.",
        "contract_id": "W912DS-25-C-A003",
        "location": "Hillside, New Jersey"
      }
    ],
    "purpose": "to perform maintenance dredging of portions of the Newark Bay, New Jersey, Federal Navigation Project",
    "amount": 53624500.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "New York, New York"
    },
    "contract_date": "2025-07-31",
    "award_text": "Donjon Marine Co. Inc., Hillside, New Jersey, was awarded a firm-fixed-price contract to perform maintenance dredging of portions of the Newark Bay, New Jersey, Federal Navigation Project. The amount of this action is $53,624,500. Bids were solicited via the internet with three received. Work will be performed in Newark Bay, New Jersey with an estimated completion date of Jan. 25, 2026. Fiscal 2025 civil operation and maintenance funds in the amount of $53,624,500 were obligated at the time of the award. U.S. Army Corps of Engineers, New York, New York, is the contracting activity (W912DS-25-C-A003)."
  },
  {
    "contractors": [
      {
        "name": "Emerson Construction Co. Inc.",
        "contract_id": "W9126G-25-C-0010",
        "location": "Temple, Texas"
      }
    ],
    "purpose": "for construction",
    "amount": 26704000.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Fort Worth, Texas"
    },
    "contract_date": "2025-07-31",
    "award_text": "Emerson Construction Co. Inc., Temple, Texas, was awarded a firm-fixed-price contract for construction. The amount of this action is $ $26,704,000. Bids were solicited via the internet with five received. Work will be performed in Abilene, Texas, with an estimated completion date of Feb. 1, 2027. Fiscal 2025 military construction, defense-wide funds in the amount of $26,704,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Fort Worth, Texas, is the contracting activity (W9126G-25-C-0010)."
  },
  {
    "contractors": [
      {
        "name": "Precision Build Solutions",
        "contract_id": "W91237-25-F-A074",
        "location": "Gibsonton, Florida"
      }
    ],
    "purpose": "to fabricate and supply a Miter Gate to Greenup Lock and Dam",
    "amount": 19112957.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Huntington, West Virginia"
    },
    "contract_date": "2025-07-31",
    "award_text": "Precision Build Solutions, Gibsonton, Florida, was awarded a firm-fixed-price contract to fabricate and supply a Miter Gate to Greenup Lock and Dam. The amount of this action is $19,112,957. Bids were solicited via the internet with two received. Work will be performed in Greenup, Kentucky, with an estimated completion date of Aug. 31, 2028. Fiscal 2025 civil operation and maintenance funds in the amount of $19,112,957 were obligated at the time of the award. U.S. Army Corps of Engineers, Huntington, West Virginia, is the contracting activity (W91237-25-F-A074)."
  },
  {
    "contractors": [
      {
        "name": "Direct Viz Solutions",
        "contract_id": "W91RUS-19-C-0014",
        "location": "Chantilly, Virginia"
      }
    ],
    "purpose": "enterprise-level Command, Control, Communications, Computers, and Information Management common-user services",
    "amount": 13643328.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Aberdeen Proving Ground, Maryland"
    },
    "contract_date": "2025-07-31",
    "award_text": "Direct Viz Solutions, Chantilly, Virginia, was awarded a $13,643,328 modification (P00054) to contract W91RUS-19-C-0014 for enterprise-level Command, Control, Communications, Computers, and Information Management common-user services. The modification brings the total cumulative face value of the contract to $242,465,411. Work will be performed on Fort Huachuca, Arizona, with an estimated completion date of Oct. 31, 2025. Fiscal 2025 operation and maintenance, Army funds in the amount of $13,643,328 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "General Dynamics Land Systems",
        "contract_id": "W56HZV-22-C-0012",
        "location": "Sterling Heights, Michigan"
      }
    ],
    "purpose": "to add labor hours and funding",
    "amount": 11501017.0,
    "contracting_agency": {
      "name": "Army Contracting Command",
      "location": "Detroit Arsenal, Michigan"
    },
    "contract_date": "2025-07-31",
    "award_text": "General Dynamics Land Systems, Sterling Heights, Michigan, was awarded a $11,501,017 modification (P00108) to contract W56HZV-22-C-0012 to add labor hours and funding. The modification brings the total cumulative face value of the contract to $1,024,379,235. Work will be performed in Sterling Heights, Michigan, with an estimated completion date of Feb. 27, 2027. Fiscal 2010 Foreign Military Sales (Kuwait) funds; 2024 and 2025 other procurement, Army funds; and 2025 research, development, test, and evaluation Army funds, in the amount of $11,501,017 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Southwest Shipyard Lip",
        "contract_id": "W912BU-25-C-A012",
        "location": "Channelview, Texas"
      }
    ],
    "purpose": "firm-fixed-price contract for welded steel revetment barges",
    "amount": 7800000.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-07-31",
    "award_text": "Southwest Shipyard Lip, Channelview, Texas, was awarded a firm-fixed-price contract for welded steel revetment barges. The amount of this action is $7,800,000. Bids were solicited via the internet with three received. Work will be performed in Galveston, Texas with an estimated completion date of March 3, 2027. Fiscal 2025 revolving funds in the amount of $7,800,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Philadelphia, Pennsylvania, is the contracting activity (W912BU-25-C-A012)."
  },
  {
    "contractors": [
      {
        "name": "ASRC Federal Facilities Logistics LLC",
        "contract_id": "SPE8E3-25-D-0022",
        "location": "Beltsville, Maryland"
      }
    ],
    "purpose": "facilities maintenance, repair and operations supplies",
    "amount": 90000000.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-07-31",
    "award_text": "ASRC Federal Facilities Logistics LLC,** as successor-in-interest to Science Applications International Corp., Beltsville, Maryland, has been awarded a maximum $90,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for facilities maintenance, repair and operations supplies. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a 336-day bridge contract with no option periods. Locations of performance are Colorado, New Mexico, Oklahoma, Kansas, and Arkansas, with a July 2, 2026, ordering period end date. Using customers are Army, Navy, Air Force, Marine Corps and Coast Guard. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE8E3-25-D-0022)."
  },
  {
    "contractors": [
      {
        "name": "Amsted Graphite Materials LLC",
        "contract_id": "SP8000-25-C-0007",
        "location": "Anmoore, West Virginia"
      }
    ],
    "purpose": "for Iso-statically Molded Synthetic Graphite",
    "amount": 9996800.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Contracting Services Office, Columbus Division #3",
      "location": "Columbus, Ohio"
    },
    "contract_date": "2025-07-31",
    "award_text": "Amsted Graphite Materials LLC, Anmoore, West Virginia, has been awarded a maximum $9,996,800 firm-fixed-price contract for Iso-statically Molded Synthetic Graphite. This was a competitive acquisition with three responses received. This is a three-year contract with no option years. The performance completion date is July 31, 2028. Using military services are Army, Marine Corps, Navy, Air Force, and Space Command. Type of appropriation is fiscal 2025 transaction funds. The contracting activity is the Defense Logistics Agency Contracting Services Office, Columbus Division #3, Columbus, Ohio (SP8000-25-C-0007)"
  },
  {
    "contractors": [
      {
        "name": "Pomp's Tire Service Inc.",
        "contract_id": "SPRDL1-25-D-0064",
        "location": "New Berlin, Wisconsin"
      }
    ],
    "purpose": "for wheel and tire assemblies",
    "amount": 8448334.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Land and Maritime",
      "location": "Warren, Michigan"
    },
    "contract_date": "2025-07-31",
    "award_text": "Pomp's Tire Service Inc., New Berlin, Wisconsin, has been awarded an estimated $8,448,334 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for wheel and tire assemblies. A delivery order (SPRDL1-25-F-0204) was also executed at the time of award. This was a competitive acquisition with three responses received. This is a five-year contract with no option periods. The ordering period end date is July 31, 2030. Using military service is Army. Type of appropriation is fiscal 2025 through 2030 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan (SPRDL1-25-D-0064)."
  },
  {
    "contractors": [
      {
        "name": "Combat Medical Systems LLC",
        "contract_id": "SPE2DH-25-D-0023",
        "location": "Huntersville, North Carolina"
      }
    ],
    "purpose": "multiple award contract for medical equipment and accessories for the Defense Logistics Agency Electronic Catalog",
    "amount": 20000000.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-07-31",
    "award_text": "UPDATE: Combat Medical Systems LLC,** Huntersville, North Carolina (SPE2DH-25-D-0023, $20,000,000) has been added as an awardee to the multiple award contract for medical equipment and accessories for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DH-21-R-0002 and awarded Feb. 10, 2022. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania."
  },
  {
    "contractors": [
      {
        "name": "Jadin Tech LLC",
        "contract_id": "H9241525DE001",
        "location": "Anchorage, Alaska"
      }
    ],
    "purpose": "For Tactical Local Area Network family of systems accessory cases and ancillary items in support of U.S. Special Operations Command (USSOCOM), Special Operations Forces Acquisition, Technology, and Logistics, Tactical Information Systems' Program Executive Office.",
    "amount": 45250000.0,
    "contracting_agency": {
      "name": "USSOCOM",
      "location": "MacDill Air Force Base, Florida"
    },
    "contract_date": "2025-07-31",
    "award_text": "Jadin Tech LLC,*** Anchorage, Alaska, is being awarded a single award, indefinite-delivery/indefinite-quantity contract for Tactical Local Area Network family of systems accessory cases and ancillary items with a five-year ordering period beginning July 31, 2025, and ending July 30, 2030.  This contract, with a ceiling value of $45,250,000, is in support of U.S. Special Operations Command (USSOCOM), Special Operations Forces Acquisition, Technology, and Logistics, Tactical Information Systems' Program Executive Office. Fiscal 2025 procurement funds are being obligated on the first delivery order at time of award. USSOCOM, MacDill Air Force Base, Florida, is the contracting activity (H9241525DE001)."
  },
  {
    "contractors": [
      {
        "name": "Enterprise Resource Planning International Inc.",
        "contract_id": "HC104720D2045",
        "location": "Laurel, Maryland"
      }
    ],
    "purpose": "Non-competitive contract modification for a ceiling increase on a single-award, indefinite-delivery/indefinite-quantity vehicle.",
    "amount": 20000000.0,
    "contracting_agency": {
      "name": "Defense Information Technology Contracting Organization",
      "location": "Fort Meade, Maryland"
    },
    "contract_date": "2025-07-31",
    "award_text": "Enterprise Resource Planning International Inc., Laurel, Maryland, was awarded a non-competitive contract modification (P00016) to a single-award, indefinite-delivery/indefinite-quantity vehicle for a ceiling increase. The face value of this action is $20,000,000 and will be funded via orders made to the vehicle. The total cumulative face value of the contract is $85,000,000. Places of performance for this contract vary and are specified within each task order. Performance under this contract is expected to be completed Sept. 23, 2026. Proposals were not solicited, and a Notice of Intent to Sole Source was posted to SAM.gov on June 27, 2025. The Defense Information Technology Contracting Organization, Fort Meade, Maryland, is the contracting activity (HC104720D2045)."
  },
  {
    "contractors": [
      {
        "name": "Raytheon Co.",
        "contract_id": "N00024-25-C-5413",
        "location": "Tucson, Arizona"
      }
    ],
    "purpose": "Engineering, manufacturing, and development of the Standard Missile 2 (SM-2) Block IIICU All Up Round",
    "amount": 258742330.0,
    "contracting_agency": {
      "name": "Naval Sea Systems Command",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-12",
    "award_text": "Raytheon Co., Tucson, Arizona, was awarded a $258,742,330 cost-plus-incentive-fee contract for the engineering, manufacturing, and development of the Standard Missile 2 (SM-2) Block IIICU All Up Round. This contract includes options which, if exercised, would bring the cumulative value of this contract to $263,137,090. Work will be performed in Tucson, Arizona (72%); Simsbury, Connecticut (7%); Wolverhampton, United Kingdom (3%); Salt Lake City, Utah (3%); North Logan, Utah (1%); McKinney, Texas (1%); Warrington, Pennsylvania (1%); Bristol, Pennsylvania (1%); Hauppauge, New York (1%); Coxsackie, New York (1%); Tampa, Florida (1%); San Jose, California (1%); Anniston, Alabama (1%); and various other locations each less than 1% (6%), and is expected to be completed by September 2031. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $52,054,849 (65%); Foreign Military Sales (Canada) funds in the amount of $18,473,766 (23%); and fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $9,071,456 (11%), were obligated at time of award, of which $9,071,456 will expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1) (only one responsible source and no other supplies or services will satisfy agency requirements). Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-25-C-5413). (Awarded on July 31, 2025)"
  },
  {
    "contractors": [
      {
        "name": "Arimon Technologies Inc.",
        "contract_id": "N64498-25-D-4034",
        "location": "Montello, Wisconsin"
      }
    ],
    "purpose": "for the procurement of uninterruptable power supplies and bypass switches for use on Navy ships",
    "amount": 7773506.0,
    "contracting_agency": {
      "name": "Naval Surface Warfare Center, Philadelphia Division",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-12",
    "award_text": "Arimon Technologies Inc., Montello, Wisconsin, is awarded a $7,773,506 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for the procurement of uninterruptable power supplies and bypass switches for use on Navy ships. Work will be performed at the contractor’s facility in Montello, Wisconsin, and is expected to be completed by August 2030. Fiscal 2025 other procurement (Navy) funds in the amount of $91,727 will be obligated at the time of award and will not expire at the end of the fiscal year. This contract was competitively procured via the SAM.gov website, with three offers received. Naval Surface Warfare Center, Philadelphia Division, Philadelphia, Pennsylvania, is the contracting activity (N64498-25-D-4034)."
  },
  {
    "contractors": [
      {
        "name": "Aleut Management Services LLC",
        "contract_id": "FA4800-25-C-0009",
        "location": "Colorado Springs, Colorado"
      }
    ],
    "purpose": "Base maintenance and sustainment of Air Force Real Property and Real Property Installed Equipment",
    "amount": 50000000.0,
    "contracting_agency": {
      "name": "633rd Contracting Squadron",
      "location": "Joint Base Langley-Eustis, Hampton, Virginia"
    },
    "contract_date": "2025-08-12",
    "award_text": "Aleut Management Services LLC, Colorado Springs Colorado, was awarded a $50,000,000 firm-fixed-price contract for base maintenance. This contract provides for base maintenance and sustainment of Air Force Real Property and Real Property Installed Equipment. Work will be performed at Joint Base Langley-Eustis, Virginia, and is expected to be completed by Aug. 10, 2030. This contract was a competitive acquisition and three offers were received. Fiscal 2025 operations and maintenance appropriations funds in the amount of below $50,000,000 are being obligated at time of award. The 633rd Contracting Squadron, Joint Base Langley-Eustis, Hampton, Virginia, is the contracting activity (FA4800-25-C-0009)."
  },
  {
    "contractors": [
      {
        "name": "Geost",
        "contract_id": "FA8819-21-C-1001",
        "location": "Tucson, Arizona"
      }
    ],
    "purpose": "development and demonstrating concepts for low-cost, low size, weight, and power hosted space-based sensors to improve Space Domain Awareness in geosynchronous orbit.",
    "amount": 80783924.0,
    "contracting_agency": {
      "name": "Space Systems Command, Space Domain Awareness and Combat Power",
      "location": "El Segundo, California"
    },
    "contract_date": "2025-08-12",
    "award_text": "Geost, Tucson, Arizona, has been awarded a ceiling $15,616,578 modification (P00034) to a previously awarded contract (FA8819-21-C-1001) for development and demonstrating concepts for low-cost, low size, weight, and power hosted space-based sensors to improve Space Domain Awareness in geosynchronous orbit. The modification brings the total cumulative face value of the contract to $80,783,924 from $64,890,561. Work will be performed at Tucson, Arizona, and is expected to be completed by July 20, 2026. Fiscal 2025 research, development, test and evaluation funds in the amount of $11,000,000 are being obligated at time of award. The Space Systems Command, Space Domain Awareness and Combat Power, El Segundo, California, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "Matrix Research, Inc.",
        "contract_id": "FA2377-25-F-B004",
        "location": "Beavercreek, Ohio"
      }
    ],
    "purpose": "Science and Technology Applied Radio Frequency Systems under a multiple award, fair opportunity, indefinite-quantity/indefinite-delivery contract",
    "amount": 94975000.0,
    "contracting_agency": {
      "name": "Department of the Air Force",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-12",
    "award_text": "UPDATE: Matrix Research, Inc., Beavercreek, Ohio (FA2377-25-F-B004) was added as an awardee to the $94,975,000 multiple award, fair opportunity, indefinite-quantity/indefinite-delivery contract for Science and Technology Applied Radio Frequency Systems announced on Aug. 11, 2025. Fiscal 2025 research, development, test and evaluation funds in the amount of $364,941 for Matrix Research Inc. are being obligated at time of award."
  },
  {
    "contractors": [
      {
        "name": "G&G Steel Inc.",
        "contract_id": "W912QR-25-F-A090",
        "location": "Russellville, Alabama"
      }
    ],
    "purpose": "to fabricate, assemble, and deliver one upstream miter gate with two leaves and the associated equipment",
    "amount": 18169068.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers",
      "location": "Louisville, Kentucky"
    },
    "contract_date": "2025-08-12",
    "award_text": "G&G Steel Inc.,* Russellville, Alabama, was awarded a firm-fixed-price contract to fabricate, assemble, and deliver one upstream miter gate with two leaves and the associated equipment. The amount of this action is $18,169,068 with a total cumulative face value of $38,697,288. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 15, 2028. U.S. Army Corps of Engineers, Louisville, Kentucky, is the contracting activity (W912QR-25-F-A090)."
  },
  {
    "contractors": [
      {
        "name": "Tetra Tech Inc.",
        "contract_id": "W912DY-22-F-0322",
        "location": "San Diego, California"
      }
    ],
    "purpose": "recurring maintenance, minor and emergency repairs at fueling sites",
    "amount": 9136582.0,
    "contracting_agency": {
      "name": "U.S. Army Corps of Engineers' Engineering and Support Center",
      "location": "Huntsville, Alabama"
    },
    "contract_date": "2025-08-12",
    "award_text": "Tetra Tech Inc., San Diego, California, was awarded a $9,136,582 modification (P00010) to contract W912DY-22-F-0322 for recurring maintenance, minor and emergency repairs at fueling sites. The modification brings the total cumulative face value of the contract to $58,328,032. Work will be performed in San Diego, California; Des Moines, and Sioux City, Iowa; Topeka, and Wichita, Kansas; Duluth, and St. Paul, Minnesota; Lemay, and St. Joseph, Missouri; Lincoln, and Omaha, Nebraska; Fargo, Grand Forks, Minot, and Pembina, North Dakota; Sioux Falls, South Dakota; and Finley, Madison, and Milwaukee, Wisconsin, with an estimated completion date of Aug. 12, 2026. Fiscal 2025 revolving funds in the amount of $9,136,582 were obligated at the time of the award. U.S. Army Corps of Engineers' Engineering and Support Center, Huntsville, Alabama, is the contracting activity."
  },
  {
    "contractors": [
      {
        "name": "M M Manufacturing LLC",
        "contract_id": "SPE1C1-23-D-0070",
        "location": "Lajas, Puerto Rico"
      }
    ],
    "purpose": "for various types of coats and trousers",
    "amount": 12988318.0,
    "contracting_agency": {
      "name": "Defense Logistics Agency Troop Support",
      "location": "Philadelphia, Pennsylvania"
    },
    "contract_date": "2025-08-12",
    "award_text": "M M Manufacturing LLC,* Lajas, Puerto Rico, has been awarded a maximum $12,988,318 modification (P00011) exercising the second one-year option period of a one-year base contract (SPE1C1-23-D-0070) with four one-year option periods for various types of coats and trousers. This is a firm-fixed-price, indefinite-delivery/indefinite-quantity contract. The ordering period end date is Aug. 21, 2026. Using military services are Army and Air Force. Type of appropriation is fiscal 2025 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania."
  },
  {
    "contractors": [
      {
        "name": "Ameriqual Group LLC d/b/a Ameriqual Packaging",
        "contract_id": "SPE3S1-25-D-Z205",
        "location": "Evansville, Indiana"
      },
      {
        "name": "Baxters North America Inc. d/b/a The Wornick Co.",
        "contract_id": "SPE3S1-25-D-Z206",
        "location": "Cincinnati, Ohio"
      }
    ],
    "purpose": "Correction to contract announcement for supply-related services",
    "amount": 246370725.0,
    "contracting_agency": {
      "name": "Department of Defense",
      "location": "Washington, D.C."
    },
    "contract_date": "2025-08-12",
    "award_text": "CORRECTION: The contract announced on Aug. 8, 2025, for Ameriqual Group LLC, doing business as Ameriqual Packaging, Evansville, Indiana (SPE3S1-25-D-Z205), for $221,062,100 and Baxters North America Inc., doing business as The Wornick Co., Cincinnati, Ohio (SPE3S1-25-D-Z206), for $25,308,625 was announced with an incorrect award date. The correct award date is Aug. 14, 2025."
  }
]